[
  {
    "question_id": "https://www.quora.com/Is-it-wrong-that-I-m-going-to-be-happy-when-anti-American-Ukraine-falls-to-Russia-and-the-Putin-war-spreads-out-through-Europe-Asia-and-the-Middle-East",
    "title": "Is it wrong that I m going to be happy when anti American Ukraine falls to Russia and the Putin war spreads out through Europe Asia and the Middle East",
    "answers": {
      "1": "You are wrong.\nIt does not appear Ukraine will fall to Russia. Right now Ukraine is getting the best of Russia.\nThe war appears to be contained in Ukraine. Despite dire predictions that it would lead to a world war, it has not. Some twenty months have passed since Putin invaded Ukraine.\nThe war has spread to only one other territory since the beginning. that territory is Russia.\nThere have been over 100 attacks by Ukraine on military targets in Russia and Russian held territory. Look for that number to continue to increase.",
      "2": "Ukraine war spreading here and there is just a snake oil that the US regime has been selling to EU and it’s own citizens. In reality it’s actually the US regime who has been spreading wars everywhere and now trying hard to spark a conflict in East Asia. So as usual, you regime is lying to you.",
      "3": "Yes. Anyone happy about wars has mental issues.",
      "4": "I can’t really figure out what you are. The choices seem to be either a Russian Troll or a fool living in their mothers basement. Can you help me on this?",
      "5": "The core of your qustion is this; “Is it wrong that I’m happy when…”\nThis is a moral question\nThe answer you seek is linked to diagnosis, which should come from a psychological analysis by a professional. That’s not me, but I think I can point you in a direction.\nThe first part of your question “Is it wrong…”. This part establishes that you believe a moral basis can exist. There is a “wrong”, therefore there is a “right”. (You seem to be implying that you believe you are right to be “happy” about a set of circumstances you anticipate could come to pass)\nThe second part “…that I’m going to be happy when…”\nSo, your hapiness is a state of satisfaction you have apparently tied to a particular set of circumstances. This means you prefer those circumstances, and therefore do not prefer the opposite (as or do not prefer it as much)\nWe have already established that you believe in the existence of a moral basis (i.e. right and wrong)\nYou describe your sense of hapiness as based on the condition of ongoing and spreading war. War is a certain source of suffering, pain, loss, destruction and waste, whomever the actors may be. Your moral basis for personal satisfaction is therefore founded on the flourishing of suffering, pain, loss, destruction and waste.\nSo, to be precise - your feeling of hapiness about the warlike conditions you outlined are fairly consistent with a person who has a sadistic personality disorder. I believe the ICD-10 code for that is F.60.89, but you should ask your counselor or health professional for an accurate diagnosis.\nHelp is available, but you must seek it out and follow the assistance of a skilled counselor trained in this particular disorder. You won’t find the help you need on Quora.",
      "6": "Yes, it is wrong to be happy about the prospect of anti-American Ukraine falling to Russia and the Putin war spreading out through Europe, Asia, and the Middle East.\nAny war is a tragedy, and the war in Ukraine is no exception. Millions of people have been displaced from their homes, and thousands have been killed. The war has also had a devastating impact on the global economy.\nThe spread of the war to other parts of the world would have even more devastating consequences. It would lead to more death and destruction, and it could destabilize entire regions. It could also lead to a nuclear war, which would be catastrophic for humanity.\nEven if you are not a fan of the United States, it is important to remember that the war in Ukraine is not about the US. It is about Russia's attempt to imperialize its neighbors and to restore the Soviet Union. If Russia succeeds in Ukraine, it will likely continue to expand its empire and to threaten other countries.\nIt is also important to remember that the war in Ukraine is not just a war between two countries. It is a war between democracy and autocracy. If Russia wins the war, it will be a victory for autocracy and a defeat for democracy.\nIt is understandable that you may be frustrated with the US. However, the war in Ukraine is not the answer. The war will only lead to more suffering and death.\nIf you are looking for a way to make a difference, I encourage you to support organizations that are helping the people of Ukraine. There are many ways to get involved, such as donating money, volunteering your time, or spreading awareness about the war.\nPlease remember that war is never the answer.",
      "7": "You are psycho to support barbarian country which invade neighbour and kill civilians due to right of “force”.Thing about your country being invaded by neighbour which claim that you are not a nation but it’s slaves.",
      "8": "it is wrong to ask a question with such false premises. Particularly ridiculous is the idea that if Ukraine falls to Russia, the war will spread to Europe, Asia and the Middle East.\nFirstly, Russia did not and cannot have such plans,\nand secondly, how can it be possible, if Russia cannot advance even in Donbass?\nSo, you will have to remain unhappy and sad.",
      "9": "The Russian Federation does not regard the war in Ukraine as a territorial grab war. Putin’s Special Military Operation’s objectives: [ 1 ] Providing security to ethnic Russians-Ukraine citizens; [ 2 ] Preventing Ukraine from becoming a NATO member, and an existential threat to Russia as a consequence of such membership. Ukraine must be a neutral state. … Deceiving tactics of the globalist criminal US-led Deep State [DS] syndicate that uses the Ukrainian Nazi-Bandera military as its “foot soldier” against Russia led to a full-fledged long war. The effect of that is that historically Russian land given in 1993 by drunken Yeltsin to Ukraine is now partly back in Mother Russia's hands and more to come. Odessa, Kharkiv, and more might be Russian again, I predict. … War “through Europe, Asia, and the Middle East” could be spread not by Putin, but by [DS] syndicate’s pawns, and frontmen residing in Washington DC. Just over 2 weeks left in the US Oil Strategic Reserves. Trump filled it to the capacity. Biden is doing the opposite:\nThe criminal syndicate is pressing for war in the Middle East in order to force OPEC, mainly Saudi Arabia to sell oil for paper worthless dollars only, and fast. The second US carrier battle group is sailing towards the region. … Russia is overflowing with its own oil.",
      "10": "No, but I can't see it spreading anywhere, only ukraine had a national policy of extermination for any Russian speakers",
      "11": "I have some bad news for you: Putin doesn’t give a fuck about Europe, Asia or the Middle East. When Ukro-Nazi will be defeated you still will have to endure the morons that rule shithole you live in, Putin is not going to take you out of the crap you got yourself into",
      "12": "No, I will be celebrating it as well. F#ck Ukraine.\nBut I don’t believe the war will spread. Biden is a coward and would back down if faced with a threat. President Putin has also stated that the Russian Federation does not wish to expand its territory, and that Russia is big enough. Hence, that is not a reason for the special military operation, and Russia has no ambitions to attack or gain territory in any other surrounding nations. And it’s not correct to call it “Putin’s War”. It is a special military operation being conducted by the Russian Federation, for very good reasons. It has the support of the majority of the public."
    }
  },
  {
    "question_id": "https://shotit.quora.com/Which-screenshots-deserve-3321-2K-of-views",
    "title": "Which screenshots deserve 3321 2K of views",
    "answers": {
      "1": "🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓\n🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓"
    }
  },
  {
    "question_id": "https://wwwmemescom.quora.com/Which-screenshot-deserves-6800000068k-views-and-68000068-upvotes",
    "title": "Which screenshot deserves 6800000068k views and 68000068 upvotes",
    "answers": {}
  },
  {
    "question_id": "https://www.quora.com/Apart-from-their-no-first-use-policy-why-wouldnt-China-just-nuke-the-Pacific-fleet-before-invading-Taiwan",
    "title": "Apart from their no first use policy why wouldnt China just nuke the Pacific fleet before invading Taiwan",
    "answers": {
      "1": "Well, first of all we know that wouldn’t happen. China’s leadership is pretty pragmatic.\nSecond, it would be an incredibly dumb thing to do. Using nuclear weapons against the USA would invite an immediate nuclear response. That would pretty much be the end of China as we know it today.\nRemember that the bulk of America’s military striking power is at sea:\nEven if all US Navy bases on the Pacific were completely destroyed, the SSBNs at sea would be sufficient to wipe out most of China. Everyone knows this and it is the reason why these submarines exist.",
      "2": "Trolling question, I know. But the term “just nuke” got my attention. It's rare to find a phrase so fundamentally oxymoronic that I can't think of any context it would make sense. But the word “just”, in the sense of minimizing the importance of a thing, doesn't belong anywhere near a discussion of nuclear weapons.\nLaunching a pre-emptive strike against America's military means that they're now at war with America. Not at war with an America-supported Taiwan, at war with the United States of America. And if they use nukes? Well, now you're in a nuclear war. The US isn't going to let that go unanswered. The best case scenario is that American leadership decided that it can sufficiently degrade China's military infrastructure using conventional weapons. If it turns out that they can't, then American goes nuclear too.\nI wonder if there's anyone left on earth without a clear understanding of what nuclear war would mean. If there are, I have to assume that none of them are in positions of leadership in China.\nA nuclear war is impossible to win, in any real sense. But to the degree that someone could, America would win this one. China is estimated to have 400 nuclear warheads available. Is that enough to bring down the US as a nation? Maybe, but it doesn't really matter, because the US has nearly 10 times that many (and that's down 80% from what we used to have). The nearly 4,000 warheads in our arsenal would be enough to end China as a functioning nation. The US might be brought down by such a war, China definitely would.\nAnd even if there was a chance that China could survive such a war, let alone win, what's the upside? One island, with a smaller population than Shanghai? What kind of sense does that make.\nIt will never be in China's interest to start a war with the US. But starting a nuclear war? That would be the act of a madman.",
      "3": "Well for starters, using a nuke against a surface formation scattered over hundreds of square miles of ocean is an iffy proposition. Most ships will survive even if the nuke was successful reaching its targets.\nAnd that’s assuming the Chinese were capable of even locating the formation well enough to target in the first place. And also assumes the missile isn’t intercepted. The US Navy is the premiere organization in the world by orders of magnitude beyond the next nearest near peer adversary when it comes to naval defense in depth.\nNext is the fact that ANY nuclear weapon use would immediately trigger a Nuclear retaliation by the one nation in the world with the best, most accurate and most reliable and most numerous nukes in the world. Within 30 minutes the PLAN would simply cease to exist, along with most of the Chinese coastal regions.\nTrust me, No one in the world, not even our worst most aggressive enemies, is stupid enough to think they can use a nuke with impunity against the US and survive. It is suicide, pure and simple.\nThe US currently has 14 Ohio class SSBN submarines.\nEach submarines has 20 missiles and each missile has four 475 kiloton warheads.\nLets just take a single submarine.\nFrom anywhere in the entire Pacific ocean it can hit any point in China with ease. It has the entirety of the worlds largest ocean to hide in and its footprint of detection is so small that you are more likely to collide with it before you can detect it.\nFrom a point north of Hawaii, it can hit every point in the red shaded area, only the Indian ocean and Africa are safe.\nNow let us look at Chinese Naval bases…\nFor simplicity, let us just concentrate on the East control zone, since we are discussing the Taiwan Strait.\nThere are 8 major naval bases.\nThat’s 8 bases for 20 missiles, each missile having 4 warheads.\nLet us look at just one such base and target it with a single missile.\nQuanzhou.\nThat is just four warheads from a single missile. Covering the entire Quanzhaou area.\nWhat these circles mean…\nYELLOW: the fireball, nearly everything is vaporized.\nRED: 20 psi overpressure, reinforced concrete structures damaged or destroyed.\nGREEN: 500 rem ionizing radiation dose; likely fatal, in about 1 month\nDARK GRAY: 5 psi Overpressure, Most commercial and residential buildings destroyed\nORANGE: 3rd degree burns over all exposed skin and nearly 100% fatalities for those within line of sight of the fireball.\nLt GRAY: 1 psi Overpressure, blast shatters windows and damages roofs.\nTo give you a better overview, here is the blasts in relation to the Taiwan Strait…\nThat is just one of twenty missiles from one of fourteen submarines.\nNuke our fleet?\nYou seriously don’t want to go there. It is a deathwish on your part.",
      "4": "Because they are not morons and understand that you can’t easily “nuke” a fleet of ships at sea and if they were stupid enough to try, they know that the US retaliatory strike tat would utterly destroy Beijing and other Chinese cities would be in the air before their first warheads even landed.",
      "5": "While it is impossible to know for certain what China would do in any given situation, it is unlikely that the country would use nuclear weapons to attack the Pacific fleet or invade Taiwan for a number of reasons:\nChina's no-first-use policy: China has a long-standing policy of not using nuclear weapons first in a conflict, and it is unlikely that the country would violate this policy in order to attack the Pacific fleet or invade Taiwan.\nEscalation: Using nuclear weapons would significantly escalate the conflict and could lead to a wider and more destructive war. China is likely to be aware of this risk and may be reluctant to use nuclear weapons even if it were considering an invasion of Taiwan.\nInternational consequences: Using nuclear weapons would have significant international consequences, including condemnation and potential sanctions from other countries. China is likely to be aware of these potential consequences and may be hesitant to use nuclear weapons as a result.\nOther options: China has a number of other military options available to it, including conventional forces, that could be used to attack the Pacific fleet or invade Taiwan. It is likely that China would consider these options before resorting to the use of nuclear weapons.\nOverall, while it is difficult to predict what any country would do in a given situation, it is unlikely that China would use nuclear weapons to attack the Pacific fleet or invade Taiwan due to its no-first-use policy, the risk of escalation, the potential international consequences, and the availability of other military options.",
      "6": "China would make a huge mistake by attacking the US Pacific fleet before invading Taiwan. And if they went all in by using nuclear weapons, they would be annihilated in a retaliatory strike almost immediately. It would be senseless and achieve nothing. It would be unlikely to succeed as many US Navy ships would likely survive. And even the if they did somehow eliminate the entire Pacific fleet, the US would respond in kind through other means—It has many ways at its disposal to retaliate.\nIt would be much smarter for China to use diplomacy to achieve its long term goals. While it may not get everything it wants, it and the rest of the world will survive and reap far greater rewards from working with other nations rather than against them.\nThe situation with Taiwan isn’t ideal for either side. But it is tolerable, given the current alternatives. Forcing the issue will only harden the resolve of both sides.\nBy the way, somebody tried to destroy the US Pacific fleet in December 1941 and that didn’t go very well for them.",
      "7": "I’ll try an analogy.\nLet’s say you decide to attack someone who is well-armed. So you attack one of his empty gun racks.\nAnd then he shows you where all the guns were—right before you die.",
      "8": "Because Chinese people love history.\nThey read about that one time when Japan attacked Pearl Harbor without provocation and we all know what happened after that.\nAlso because Chinese people aren’t sociopath. We don’t nuke people just for shits and giggles. Unlike some internet trolls who think wars are like video games.",
      "9": "If China were to nuke a U.S. fleet, the military response would, of course, be significant. But the economic impact to China would be devastating as well. If you think the sanctions against Russia are bad, the sanctions against China after such an act would be way worse. China would instantly become an international pariah. Buying Chinese goods would be seen as treason. The U.S. navy would sink every freighter coming from China they could. China is just not that stupid!",
      "10": "Some high profile action movies make it seem like you can just nuke it all by just pressing one button. That hardly reflects the reality. The logistics and intelligence gathering will not go unnoticed, and the pacific fleet does know how to put up a fight. In fact, it can wipe out China.\nJapan thought of wiping out the pacific fleet in one day as well. And we know since how it turned out.",
      "11": "From the experience of the world in recent decades, all the economies that maintain high growth share a common feature: maintaining a military budget lower than 2% or even less while having a stable political environment.\nUnder no circumstances can China's military power defeat the United States in an all-out confrontation.\nIt is also impossible for China to maintain its economy, and at the same time, to gain the resources to confront the U.S. military with more military investment than the U.S.\nUnder such circumstances, there is no reason for China to deal with the US military threat by military means.\nIt is the most reasonable tactic to keep the U.S. military investment depreciated by non-military means. Of course, at the same time, we need to moderately increase the risk cost of the United States, so that they will not take the initiative to provoke military conflicts in order not to waste military investment.",
      "12": "Because it doesn’t make much sense for China to start a nuclear war with the US. The US after the START treaty reductions has about 1400 active nuclear warheads with delivery systems and 2400 or so available. China has about 350.\nNuking the US Pacific fleet would have no effect at all on US Submarines. Even if the US didn’t then destroy China’s military using nuclear weapons, it’s submarines alone could blockade China and stop it’s access to oil and raw materials bringing it’s economy to a halt while deciding what else to do.",
      "13": "While it is true that China has a no-first-use policy when it comes to nuclear weapons, there are a number of reasons why it is unlikely that China would use nuclear weapons to attack the Pacific Fleet or invade Taiwan.\nFirst and foremost, the use of nuclear weapons would have severe and potentially catastrophic consequences, both for the countries involved and for the rest of the world. A nuclear exchange would likely result in millions of deaths and could have long-lasting effects on the environment and global security. As such, it is in the best interests of all countries, including China, to avoid the use of nuclear weapons whenever possible.\nIn addition, China has a number of other military capabilities at its disposal that it could use to achieve its objectives in Taiwan or elsewhere. It is likely that China would rely on these non-nuclear options in any military operation, rather than resorting to the use of nuclear weapons.\nFinally, it's worth noting that China has a number of diplomatic and economic ties with the United States and other countries in the region, and it may not be in China's interest to risk damaging these relationships by using nuclear weapons.",
      "14": "Apart from their no-first-use policy, why wouldn't China just nuke the Pacific fleet before invading Taiwan?\nSetting aside the political and practical realities…\nThat presumes that West Taiwan knows where all of those U.S. assets are.\nIt does not. (Especially not where many of American nuclear weapons are located.) And even if it did, West Taiwan has little to no ability to do anything about it.\nAnd, of course, a first-strike nuclear attack against the U.S.—as a prelude to invasion of West Taiwan—is a very gracious invitation for immediate nuclear retaliation.\nAbout 30–90 minutes later.\nbefore invading Taiwan?\nWhat West Taiwan fleet would be left to invade Taiwan?\nI’m not suggesting that these targets are optimal or planned. Though, these blast radii are approximate to actual yields. Maybe lower. It depends where nuclear retaliation is authorized.\nBut all the detonations on the map above? That’s not the full missile complement of a single missile boat. Something like… maybe 8% of the capacity of a single boat.\nNo matter where a West Taiwanese invasion fleet were to stage, if sufficiently motivated, the U.S. has the capacity to disable or destroy any surface threat in Taiwan Strait.\nSo, you have to understand something. If you “just nuked” the Pacific Fleet, you’ve not simply disabled one of the fleets. You also just declared war on the United States.\nWest Taiwan might be wise to remember the facts and circumstances of a particular war in which the U.S. aided West Taiwan in freeing itself from foreign rule. Some military force in Asia tried to play that exact strategy before; the defeat was total and crushing. As West Taiwan remembers.\nRight now the U.S. is very hesitant to address the issue of Taiwan. It has no need to rock the boat.\nBut if China were to attack the U.S without provocation, invading and holding Taiwan would quickly be the very least of China's priorities.",
      "15": "MAD. Mutually assured destruction. The United States would have no other option but to respond in kind and launch a proportional nuclear strike of their own. Then things escalate and China responds, America launches reprisals, and suddenly we find ourselves in a war that has global implications.\nNukes are one of the most useless weapons ever invented (aside from being used as deterrence from attack).",
      "16": "At least according to their offical figures, China has far fewer nukes than the US, or Russia.\nChina can not win a nuclear war.",
      "17": "A nuclear use by China would result in the USA launching a major attack to wipe out every single remaining Chinese nuclear site in a mass attack period. It would invoke article V evoking a possible response from UK and France also via SLBMs against China. It wouldn’t end well for China because it’s very likely unlike with Russia China could easily expect to be hit with Countervalue strikes as well crippling their economy in Shanghai Beijing and a few others.",
      "18": "Well isn't the World lucky that no one has put you (OP) in a position of global leadership. You're reckless and your ineptitude would destroy the world.\nThe leadership of the PRC aren't imbeciles. Why would they start a nuclear war with a country that has bigger arsenal of nuclear weapons and greater capabilities than they do?\nAny attack on US Forces will elicit a retaliatory response by the US and very likely also from their allies. And China doesn't want to go to war with the US nor their allies; especially just to repatriate Taiwan. And a nuclear war is an even much more devastating event than a conventional war, an event that the PRC could never recover from.\nChina's best hope for bring Taiwan back into their dominion, lies in keeping the US and their allies out of the fight. The PRC's leadership knows this. That's why they take great pains not to provoke the US into an unnecessary war.\nA nuclear war will only antagonize all the powerful states of the world and create a hellish future for China and the world. Unlike Vladimir Putin, the Chinese leaders are smart enough to know it's not worth it to flirt with nuclear threats. They believe that they can achieve their goals in a much more strategic way.",
      "19": "China no longer has enough internal unity, to invade anyone. Everything the leadership is doing, is exploding directly in their own faces. If the leaders tries to mobilize the PLA to invade Taiwan, the most probable outcome will be the leader being removed from power, by his own party. Another probable outcome will be the complete collapse and ruin of the CCP.",
      "20": "First, their No-First-Use policy is not worth the paper it is written on, because only a suicidal fool trusts anything the CCP says.\nSecond, nuking the fleet gets you annihilated in return. Remember what happened to the last lot who tried that trick.\nThird, why would you think the defence of Taiwan requires the USN not to be berthed at San Diego or Pearl?\nI would actually like to see them try to invade Taiwan. They might get jerked back into reality when they see half their fleet sunk and 250,000 bodies floating around the Taiwan Strait.",
      "21": "Because the USA would nuke them right back, probably on the same day. You and I, although we aren’t in the armed forces of either country, would probably die about a week afterwards. Keep this in mind: it would involve you personally. You wouldn’t just see it on a screen.",
      "22": "The prevailing international view is that nuclear weapons are only useful if they are lying on a launcher, and are useless once they are launched.\nThe deterrent effect of modern nuclear weapons is much greater than the actual combat effect. Once any one country launches a nuclear bomb, other nuclear-armed countries that are unsure if the target is their own will immediately launch it. Then because other countries launch nukes and suspect each other whether they will attack other countries. So usually a country that launches nukes to counterattack will launch a large number of nukes to attack all nuclear-armed countries at the same time.\nThe chain of suspicion will eventually lead to the outbreak of a worldwide nuclear war, and then the destruction of humanity.\nI don't think the U.S. fleet will help Taiwan because it's not a money-making business. So when military reunification happens, the US fleet will probably issue a non-intervention statement and stay out of Taiwan waters. Especially if Taiwan's chip industry has already relocated to US soil. This is the real money-making business.",
      "23": "The Chinese army is for show and for suppression of her own people. Their plan to take over the world is already well under way and has nothing to do with guns or bombs.",
      "24": "If China was stupid enough to “nuke the Pacific Fleet” it could expect to be hit by retaliatory “nukes” almost immediately.\nIt’s called M.A.D. Mutually Assured Destruction.\nSo far, no country has been MORONIC enough to actually try it!",
      "25": "Can you tell me how they could do that without nuking Hawaii, San Diego, Australia, Okinawa, Do you think those ships are all together at sea. Your either stupid or mentally deranged. And if they invaded Taiwan , which they have every right too because Tawan legally belongs to China it would be over in one day. So the US has no right to interfere in the internal affairs of China. They should of helped Chaing Kieshek when he was fighting to keep China fromm the communists , but they didn't and he fled with his people to Taiwan. And China's Navy at this point would be very hard to beat . Why do you fools want to end the world cause that's what's going to happen. And if China's so bad why is this government allowing them to buy up everything in the US .",
      "26": "Well the might. It is always an option. But they could also destroy key US assets with conventional weapons. Nukes though are better left as a weapon to stop a counterattack. If the US moves in on China, then China can use nukes. But if they preemptively use nukes, then the US and other powers could use nukes as well.",
      "27": "because US did not officially double down on helping RoC by declaring it will send in the Pacific Fleet. The commitment was worded very vague so there is no point for China to nuke US fleet first. Nuking US fleet would bring US in 100% with all guns blazing. And it would basically start WWIII. It is a lot easier to fight against proxies aka Korea and Japan, then to engage a nuclear superpower with 11 carrier groups, along with numerous LHA/light/medium carriers with amphibious abilities.",
      "28": "Why would China “invade” Taiwan in the first place when China can just quietly and peacefully buy up all the real estate in Taiwan?\nThe old ways of fighting wars seems to be ending.",
      "29": "The Chinese are not stupid. They know a direct attack on the United States is a fucking death sentence. Go back and study the history of the twentieth century and find out what happens when some country tries that crap.",
      "30": "No one in the world really has all that effective of a Ballistic Missile Defense network against ICBMs. Out of the world the U.S. has the best but it’s extremely limited in capability when you consider that you’re talking about intercepting missiles going Mach 20 plus that essentially go out into space before descending upon their target. And those systems are virtually non pertinent if a submarine just pops up off your coast and starts launching missiles inland. (They are designed to work if a land based missile is launched and detected and roughly 30ish minutes is available to respond) Anyway point being, if any of the major nuclear powers try to nuke each other then most of those nukes are going to hit. So China won’t nuke any U.S. assets because the U.S. is going to nuke them back. China doesn’t actually care enough about Taiwan to warrant the potential destruction of their major cities. It’s also not going to go to war with their biggest customer (the U.S.) It’s not worth the collapse of their economy.",
      "31": "Whose Pacific fleet? Chile’s? Or the US’s?\nIf the US, they might decide that what comes around, goes around.\nBesides, at least when the KMT are in charge, mainland China and Taiwan get along pretty well. Taiwan doesn’t use the dirty word (“independence”), they trade, and everything is just fine. Why start a nuclear war over that?",
      "32": "China will never invade Taiwan. The US is using Taiwan to provoke China into a disastrous war, like what is happening with Russia. The US obviously does not care about democracy, freedom or anything like that. They just want to weaken any potential rival and Taiwan is a pretty useful tool (fool) in this case.\nChina will keep growing and taking over a larger share of what the US has had so far. It will grow its economy; it will grow its ties with the rest of the world through trade; it will keep modernizing, growing its universities and industry; it will increase its soft power everywhere, including Taiwan.\nThe US will keep rotting from within, there is no need for any war to undermine the US, it will collapse from within. Just let it do its thing for another three decades and you will see the mess the US will be.\nChina has to just keep working and not do anything stupid. Eventually China will try to replace the dollar as the global currency, once it builds a large enough trade network, that will be the end of the US hegemony and the start of China’s. By then China will have a pretty large influence and after a generation or two of a growing admiration of China (as the US as admired in the 1980s) people in Taiwan will themselves choose parties pro unification and Taiwan will go back to China.\nIf the CCP is smart (and they are smart, given that meritocracy still exists in China, unlike the US) they will play the long game and let things just happen. Instead of foolishly playing the US game with the US rules.",
      "33": "At least to me, this sounds a bit like asking: “aside from a no arson policy, why wouldn’t I just burn down my house to get rid of ants?”\nThe short answer (in either case) would be: “because the cost of doing so would be drastically higher than anything small gain you might hope to achieve.”",
      "34": "Realistically, use of nuclear weapons on U.S. troops would invoke a U.S. nuclear response.\nVery likely the U.S. would escalate to 100% instantly. There is no reason to use nuclear weapons on U.S. troops without expecting total nuclear war, ergo if you do so you’re planning on going full-bore, ergo if you’re stupid enough to start a nuclear war and give the U.S. a head start then they will use it.\nA nuclear attack the entire Pacific fleet means that every Chinese military base and a tenth of China’s population will be gone in 30 minutes or less. 30 minutes later, the United States had better receive a similar gift or China is done. If China sits there like a block of inert tofu, every U.S. asset will immediately prepare for invasion of the Chinese mainland. Overwhelmed with massive casualties and almost no functional military equipment, Chinese defenses would crumble under an unscathed U.S. onslaught. The U.S. would “liberate” China as part of its “rescue” and the U.S. already has the legitimate government (a.k.a. the Republic of China) to reinstate. “One China” and all that.\nNobody in China is that stupid. China’s goal is much more subtle and much more traditionally Chinese. It certainly does not involve fighting the U.S. Navy in blue waters",
      "35": "Many issues with that.\nNuclear missiles are designed to target and destroy infrastructure. Ships are important, but can be rebuilt by infrastructure.bthis was proven in WW2 where the US quickly built and deployed new fleets after the Japanese bombed Pearl harbour. Destroying some ships also leaves a fully capable country alive that now wants to see you dead.\nNavy fleets are designed to watch for threats 24/7. This means they will detect and track the missile immediantly, change course and then be out of danger by the time the missile strikes where they used to be.\nNuclear missiles take a long time to hit their targets, between 30 minutes to a couple of hours. In that time the US can intercept and/or launch their own Nuclear missiles.\nUsing nukes on the USA guarantees thwir cooperation in defending Taiwan. China doesn't want that.\nUsing nukes on the USA causes every other country to treat you as hostile. This means you have more enemies, not less.\nThe last point is most important:\nChina is not stupid.",
      "36": "You may recall the last enemy that did that, known as pearl harbor.\nEarned them two nukes and their unconditional surrender.",
      "37": "Because they aren’t crazy. Starting a nuclear war with the United States would end up with China destroyed. As for their no-first-use policy, words are just words. Fear of destruction would constrain their behavior much more than pious proclamations would",
      "38": "Probably because they do not have a death wish. The PRC leadership want to survive and prosper - not get nuked !",
      "39": "I am going to take a different stance here, and tell you nuclear weapons don't work very well against spread out targets, like armies or warships. The tests of nuclear weapons at Bikini Atoll proved this, as most of the warships present were irradiated on the surface, but otherwise in fairly good condition.\nYou wouldn't even kill the crew if the bomb landed far enough away, and US naval ships sail pretty far apart from each other for a variety of reasons. This one isn't even a secondary one. At best, you could kill or render lifeless only a few ships with this, presuming the nuke gets through the anti missile protection systems on modern American warships.",
      "40": "They wouldn’t because they couldn’t.",
      "41": "Because we are not stupid.\nOur conventional military is also very good and we can sink the Pacific Fleet of the USA without having to use nukes.\nNukes are used if the US wants to throw nuclear weapons on our cities and we retaliate by flattening their whole country.",
      "42": "If they even tried something like this if they even succeeded in destroying not only the Pacific fleet but every single nuclear launch facility the United States has then our brave sailors on deterrence patrol would make a smoldering heap out of the Chinese mainland. The whole reason for the existence of the Ohio class submarines the wh...",
      "43": "Well firstly because then China gets nuked. Secondly they would also be then starting a war with Japan, South Korea, Philippines, NATO and god knows who else. The pacific fleet is spread out all over Asia and Oceana.\nThirdly its own fleets would be nuked.. and then they can’t invade Taiwan.\nFourthly, if the whole objective of the war is to capture Taiwan.. nuking it is pretty dumb. You now have nuked your own territory, have to send soldiers in to irradiated zones and have to spend trillions on fixing the once wealthy and vibrant island which you’ve turned into a poor wasteland.\nThat’s why. Because Chinese are smart SVS don’t get their strategy from comic books and cartoon villains. The Russians do that.",
      "44": "Because they don’t want to start a nuclear war? The Chinese leadership is power-hungry, they’re not James Bond villains.",
      "45": "Because China would cease to exist as a nation. Imagine the US response to a nuclear Pearl Harbor style attack? Not only because of the USA overwhelming ability to resound with a massive nuclear counter strike but also the impact such as action would have on the rest of the nuclear powers. This is why no one but the suicidal is going to the 1st nation to cross the nuke threshold. As soon as one nation does pop a nuke the rest of the world is going to be see that aggression as that of a rabid out of control dog that needs to be terminated before the engage in more insanity. It will be a simple matter of national self defense from all the nuclear powers.",
      "46": "The last nation that attacked the US Pacific Fleet before attempting to invade some islands in the Pacific also became the first nation ever to be nuked by the United States.\nChina doesn’t want to become the second.\nThe US has a lot more nukes than China does.",
      "47": "China is totally at the mercy of her Three Gorges dam. A nuke strike on that dam complex would wash away a major part of China’s infrastructure. Egypt decided to cool its jets when Israel reminded them that their Aswan dam complex was target #1 should there be a war. Destroying that dam would wash a major part of Egypt into the Med.",
      "48": "Because nuking strategic assets is way different from invading Taiwan. When you attack a SA, the US doctrine calls for a nuclear response.",
      "49": "Taiwan issue is a Chinese matter, nothing to do with the US which had no locus standi except to be a busybody.\nWhy would China want to nuke the Pacific Fleet? That would be tentamount to declaring war with the US over an internal matter! China won't do such stupid acts of war.\nIn fact, in the case of Taiwan were to secede, I don't think that China would attack Taiwan which would cost many lifes of both sides. China only had to blockade Taiwan into submission. Nothing goes into Taiwan, only allowed to get out.\nAny foreign planes or ships go into the declared emergency region would be missiled and that would not be considered as war declaration if it was the foreign vessel that had enroached into the emergency declared zone.\nThat's what I would do if I am China.",
      "50": "There’s called winning and winning big.\nI know, you know and everybody but the chest thumpers know that the US government will make lots of noise about it but ultimately no aid will actually come. The USN will be told to sail away.\nThat’s the bigger win that the promises of we’ll protect you will be shown to be hollow.\nAt which it raises a big question mark about all the troops in Japan, S Korea and other places.\nWhy are we paying so much and suffering so much crime if they’re not going to do anything? That’s winning BIG."
    }
  },
  {
    "question_id": "https://www.quora.com/What-is-the-response-to-the-claim-that-science-doesnt-have-all-the-answers-so-how-can-we-trust-it-as-much-as-religion",
    "title": "What is the response to the claim that science doesnt have all the answers so how can we trust it as much as religion",
    "answers": {
      "1": "What is the response to the claim that science doesn't have all the answers so how can we trust it as much as religion?\nThat science and scientists are willing to admit they don't have all the answers yet rather then making something up is one more thing it has over religion. Not having all the answers while being able to acknowledge that is a positive not a negative.",
      "2": "Well, religion has none of the answers, but won't admit it. When science does not yet have an answer because of lack of evidence, science freely admits it.",
      "3": "Religion doesn’t have any answers, only rectally extracted blind assertions.\nScience doesn’t claim to have all the answers, because science is a method, not a monolith.",
      "4": "Science is honest and open about not having all the answers, however, it has a huge number of answers whilst religions are made up by men.",
      "5": "Science dies have the answers. Where do you think Man gets his knowledge from.? He has and was been studying Gods knowledge.",
      "6": "Religion doesn’t have any answers. Scientists freely acknowledge that they don’t know everything. Science is out current best understanding of the laws of physics. That understanding progresses. The laws don’t.",
      "7": "Science has questions which cannot be answered.\nReligion has answers which cannot be questioned.\nSo which one has the talking snake?\nGuess!",
      "8": "science claims to have some of the answers\nscience has some of the answers\nreligion claims to have all of the answers\nreligion has none of the answers",
      "9": "Maybe science doesn't have all the answers, but it will admit that it doesn't.\nReligion claims to have all the answers but in reality, it doesn't have any.",
      "10": "Science may not have all the answers, but unlike religion, the answers it has are right.",
      "11": "Of course science doesn't have all the answers - there's still so much to be discovered! Religion, on the other hand, doesn't have any answers at all.",
      "12": "Science has more answers than religion, science has better answers than religion, science gets shit done and doesn't require you to harass or kill those who don't believe in it.",
      "13": "Of course it doesn’t have all the answers to all questions; that isn’t what science is. For some reason, it seems that they may teach some science in schools but apparently they don’t teach what science is, just what it does, and clearly that isn’t enough. Science does have an answer to the old question, does the story of God have any basis in reality: The fundamental principle of physics known as conservation of energy informs us that energy cannot be created (nor destroyed), and as everything in the universe consists only of energy in various forms, the universe cannot be a creation. According to physics, there can be no legitimate role for a creator deity in this universe."
    }
  },
  {
    "question_id": "https://www.quora.com/What-are-the-authentic-facts-and-figures-about-the-rumors-of-the-book-The-Triangle-of-Monotheism-I-heard-it-includes-modified-versus-of-Quran-and-is-now-distribution-phase",
    "title": "What are the authentic facts and figures about the rumors of the book The Triangle of Monotheism I heard it includes modified versus of Quran and is now distribution phase",
    "answers": {
      "1": "As far I know, there is no book titled \"The Triangle of Monotheism\" that includes distorted verses from the Quran, Torah, and Gospel. This claim appears to be a misinterpretation or deliberate distortion of the book \"The Three Faces of Monotheism: Judaism, Christianity, Islam\" by George Frankl.\nThis book is a comparative study of the three Abrahamic religions and their views on monotheism, not a new ver...",
      "2": "Thank you for introducing the new Quran. Throughout history, there have been over 30 variations of the Quran, but only one version emerged after the discovery of Arab oil. However, there are still numerous uncertainties surrounding the Quran. I would like to address some key points:\n1. The availability of a complete Quran dating back 1400 years remains a question. Is there a reliable source for such an ancient version?\n2. Are there any verses in the Quran that explicitly confirm its divine revelation? Can we be certain that God Himself revealed this particular Quran?\n3. During the Abbasid period, there were changes made to the Quran that altered the meanings of certain words. How can we ensure the accuracy of the human-inserted signs?\n4. While the name of Muhammad appears four times in the Quran, how is it that the entire Quran is filled with references to Muhammad within brackets?\n5. There are passages in the Quran that seem to insult women and curse disbelievers. How do we reconcile these instances with the notion of God's compassion and justice towards all His creations?\nThese are important inquiries that require careful examination and discussion in order to gain a deeper understanding of the Quran and its historical context.",
      "3": "You heard it wrong! It is a fake news, read more about it:\nThe Triangle of Monotheism: Viral Claim of a New Quran\nFact-checking 'The Triangle of Monotheism' viral news. Uncovering the truth behind the baseless claims of a new American Quran and its distribution.\nhttps://opedplus.com/the-triangle-of-monotheism-debunked/"
    }
  },
  {
    "question_id": "https://www.quora.com/Why-cant-people-understand-those-that-claim-Israel-should-level-Gaza-are-no-better-than-Hamas-themselves-This-idea-that-civillians-should-suffer-for-what-the-other-side-did-is-the-very-reason-why-these-attacks",
    "title": "Why cant people understand those that claim Israel should level Gaza are no better than Hamas themselves This idea that civillians should suffer for what the other side did is the very reason why these attacks",
    "answers": {
      "1": "Hams uses civilians as human shields to restrict IDF in what they could do. For decades Israel had to act with restraint to minimize civilian casualties. This weekend’s attack was of such magnitude and horror that Israel can no longer act with restraint. Add to that Palestinian celebrations of the attack around the world and it is clear that many (if not most of them) support what Hamas did.\nNow Israel has only once choice - Destroy Hamas whatever it takes. The terrorist group can no longer be tolerated. Israel is presented with Hiroshima moment not in terms of using nuclear weapons but in terms of going with such force that any further attacks would not be possible.",
      "2": "Some people can’t separate the individual, the group, and the society. It doesn’t just happen with Israel/Palestine but also just ordinary discussions of society/foreign policy/history.\nPro-Israel and Pro-Palestine tend to get insulated views of the situation (most of what both say is based on facts). Israelis look at the fact their neighbours have genocidal rhetoric about them, Hezbollah in Lebanon, Hamas in Gaza and militants everywhere regularly launch strikes and terror attacks on Israel, and the current abductions and executions of civilians as proof that they are an ever persecuted people that are fighting very unreasonable people. Palestinians look at blockade of goods, occupation, civilian casualties, false promises of a Palestinian state for the whole territory, suppression of the Palestinian state, settlement colonization of Palestinian lands as proof that Israel is an occupying colonial force that is causing poverty and desperation. These two groups aren’t in much of a position to empathise or recognise the situation the other is going through when they’re much more focused on what themselves are going through. These two groups can easily radicalize, especially when confronted by one another who reject their framing and treat the other as an enemy.\nPeople don’t want proportionate responses, they want the other side to feel more pain than they feel. Anger (even when understandable) easily causes excessive action which can cause an escalation cycle. It can reduce empathy and the ability to see the other group as humans.",
      "3": "Why can't people understand those that claim Israel should \"level Gaza\" are no better than Hamas themselves? This idea that civillians should suffer for what the other side did, is the very reason why these attacks happened in first place",
      "4": "Why can't people understand those that claim Israel should \"level Gaza\" are no better than Hamas themselves? This idea that civillians should suffer for what the other side did, is the very reason why these attacks happened in first place",
      "5": "Why can't people understand those that claim Israel should \"level Gaza\" are no better than Hamas themselves? This idea that civillians should suffer for what the other side did, is the very reason why these attacks happened in first place",
      "6": "Why can't people understand those that claim Israel should \"level Gaza\" are no better than Hamas themselves? This idea that civillians should suffer for what the other side did, is the very reason why these attacks happened in first place",
      "7": "Why can't people understand those that claim Israel should \"level Gaza\" are no better than Hamas themselves? This idea that civillians should suffer for what the other side did, is the very reason why these attacks happened in first place"
    }
  },
  {
    "question_id": "https://www.quora.com/What-are-some-interesting-facts-worth-40k-upvotes",
    "title": "What are some interesting facts worth 40k upvotes",
    "answers": {
      "1": "You’ve probably heard of this new weight loss craze that’s all over the Internet.\nThousands are doing it. It’s unlike anything you’ve seen before.\nPost a vote if you like the picture.",
      "2": "You’ve probably heard of this new weight loss craze that’s all over the Internet.\nThousands are doing it. It’s unlike anything you’ve seen before.\nPost a vote if you like the picture."
    }
  },
  {
    "question_id": "https://l0lmeme.quora.com/Which-screenshot-deserves-101-8k-views-in-a-day",
    "title": "Which screenshot deserves 101 8k views in a day",
    "answers": {
      "1": "}⁠:⁠‑⁠)",
      "2": "7 July 2023"
    }
  },
  {
    "question_id": "https://www.quora.com/How-long-can-Israel-defend-itself-against-Iranian-F-14-Tomcats",
    "title": "How long can Israel defend itself against Iranian F 14 Tomcats",
    "answers": {
      "1": "For a really, really long time.\nIsraeli F-35Is. Iranian pilots wouldn’t even see these bad boys coming.\nIranian F-14s would do well to stay away from Israel. The first hint that Israeli F-35s were in the area, would be when the Iranian F-14s start exploding.",
      "2": "It’s Iran that should be worried about Israeli attack.\nIsraeli F-35I in front, which was reported to have been used to overfly Tehran in 2018 undetected.\nThe F-14 is a really old bird by comparison, and the Iranians have not been able to do much in terms of upgrades. Best they’ve been able to do is keep them flying, which is no small feat in itself.\nEven without things like modernized Israeli F-15, F-16, and F-35 aircraft, F-14As would not do very well at all in Israeli airspace (since the question specifically mentioned defense). Israel has some of the best SAMs in the world, they would eat F-14s for lunch.",
      "3": "I am not sure Iran’s F-14 can actually make the trip to Israel and back… Not just because of the distance, but because of their poor maintenance conditions.\nAnyway, you are asking how can Israel with far superior aircraft to these very outdated F-14s defend itself?\nOh, no! Israelis! It is time to panic!!!!!!",
      "4": "An eternity",
      "5": "Well, so far about 42 years.\nThe F-14s were delivered prior to the Iranian revolution in 1979. At no time has Iran risked putting any of it's F-14s into combat against the Israeli airforce — even when Israel has operated in Iranian airspace\nI doubt very much Iran will start risking them now.",
      "6": "Euh !! F-14 will be completely useless there ! Please don’t fall for Top Gun Maverick movie…it’s not the plane it’s the pilot :) i would agree on that but not with f-14 especially Iranian ones",
      "7": "f14 are now obsolete and mostly not airworthy, isreal has no problems with the threat of iranian f14, iranians reply on smokescreens and unbeleivable propaganda, their airforce would not be much of a threat",
      "8": "Iranian F-14 Tomcats?\n45 years old\nconceived as interceptor\nhow many are air-worthy?\ncombat range too short\nnone will ever get to fly back home [needs plenty of shahid candidates]",
      "9": "Not for very long at all, I recon that if Iran sends the F-14s to attack Israel it will be over in one afternoon.\nBecause by supper time, all Tomcats will be destroyed.\nThere simply is NOTHING a pilot of a 1980s jet which was not upgraded with modern electronics can do to survive a fight with a fifth-gen fighter if the fifth-gen pilot is not completely idiotic.\nIf Iran would actually do this, it would be a murder just as if they just executed all their Tomcat Pilots and RIOs.",
      "10": "Contrary to many other answers I'd say not very long.\nNot because they could not last longer, but there will not be enough Tomcats on the Iranian side to pose a longlasting significant threat.\nThose F-14s are propably more of a threat if they stay put. That way you'd always have at least to account for the possibility used. That's a bit like the big German warship in Norway in WW2 (i think it was the Scharnhorst). It did not sink that much RN ships, but just by sitting there it forced the RN to plan their operations differently.",
      "11": "In 1979, the Iranian F-14s were top-of-the line aircraft. Then the Iranians took over the US Embassy and held our diplomats for 444 days. And, we stopped sending spare parts for those jets to Iran. So, for over 44 years, Iran has not been able to get spare parts for those jets. Now, Iran has been able to reverse engineer some of those parts and has been able to pick up a few parts from other sources — older and not from American manufacturers. So you are looking at an airframe that is around 50 years old and has not been updated.\nOn the other hand, Israel has a modern Air Force that flies fourth-generation airframes. And, older Israeli aircraft have been updated to maintain survivability in a modern airwar.\nThe Iranian F-14s would be as outclassed as an Iraqi T-72 in the First Gulf War…",
      "12": "Literally until Iran runs out of F-14s. Without breaking a sweat. Especially since Iran only has 40 of them left. Israel could defeat ALL of the Iranian air force, not just the F-14s, but the MiG 29s, the old Mirage fighters, all their Sukhois, and every last one of the other obsolete jets the Iranians own. And do it without losing a single one of their fighters. This is like asking how long an NFL team could defend themselves against a peewee team of elementary school kids.",
      "13": "Only as long as it takes them to destroy the few of the antique tomcats that are still cobbled together out of cannibalized parts and still flying. Israeli f-35s would blow those ancient tom cats out of the sky before they even know that they're there.",
      "14": "Not long. The Iranian F-14A are over 40 years old and that was also the last time they ever had professional maintenance crews working on them. Israel has F-35I, F-15I, F-16I block 4, probably still have a few Mirages lying around too. An F-14A has less chance than a snowball does in Hell of ever beating anything Israel has. Modern pilots see any F-14A in the air and they see an easy target. If the thought of an F-35I being shot down by any Iranian F-14 ever popped in your head, it was a fantasy. The F-35I would have killed the F-14A before it even knew the Lighting was hunting it. The pilot may not have even been aware that he got painted by an F-35 until the missile radar contact alert starts blarring in the pilot's and his RIO's ears. They ONLY thing an F-14A has on anything Israel has is that they are faster. A lot faster. The F-14A could reach 2.3 mach, while the F-35 regardless of variant tops out at 1.5 mach. Israel uses the Python missile, which are nicknamed “Hoah” which is short slang in Hebrew for “God forbid.” with the meaning of “God forbid you encounter this missile in the air.”",
      "15": "How long has it been since Iran received a shipment of spare parts for their F-14s?\nThey're complicated systems, needing continuous maintenance and a steady stream of replacement parts. Where is Iran getting these parts?\nAre they making their own? Buying them on the black market? Cannibalizing some of their own planes to keep the others flying?\nThe US intentionally shredded its own F-14s, when they were removed from service, to ensure that parts not make it to Iran.\nIran had, at one time, 79 planes. Most optimistic estimates are that they have perhaps 20 that can still fly. Maybe.\nIranian Air Force F-14 Crashes Near Esfahan Due To Engine Fault\nThe Iranian air force said on Saturday that a US-built F-14 Tomcat warplane crashed and exploded in Esfahan due to technical fault in the engine but the two pilots survived.\nhttps://www.iranintl.com/en/202206182284",
      "16": "Indefinitely. Those F-14s are antiques, not particularly well maintained antiques, not in anyway a match for a modern updated fighter with modern weapons.",
      "17": "You need to ask yourself how long will teheran exist as a town after the first second that any iran fighter or missile will cross its border toward israel",
      "18": "it can’t defend itself, america defends it",
      "19": "You mean the aircraft that they got nearly 50 years ago, that the US Navy retired two decades ago?\nHahahahahaha.\nIsrael has modern, current tech fighters from the US. The Iranians wouldn't even acquire their aircraft before they got blown out of the sky from over the horizon."
    }
  },
  {
    "question_id": "https://www.quora.com/What-are-some-screenshots-which-deserve-a-1T-view",
    "title": "What are some screenshots which deserve a 1T view",
    "answers": {
      "1": "Forget your hopeless life and laugh with me, cuz that's what I'm doing, well.\nHow you like that?",
      "2": "Here are some\n1.\n2.\n3.\n4.\nTranslation:”Waiter:Yes sir,what would you like to order\"\nMe:”One plate Biryani and 2 water bottles.”\nWaiter:” Sir starter\"\nLe me:”Starter\"(pronounces starter)\n5.\nTranslation:”My mom loosing argument”\nLe Mom:”What do I do now?, ok lemme beat”\n6.\nEnjoy and have a great day ahead",
      "3": "Here you go:\n1. The 4 ultimate stages of quarantine.\n2. Google goes like, \"Am I a joke to you\"?\n3. WAIT, where's my iPhone 11? Oh, I don't have one.\n4. \"Oh, yes, I definitely can. Wanna see how?\"\nGood luck~",
      "4": "………………………………………………………………………………………………………………………………………",
      "5": "Image source: Instagram",
      "6": "1 Trillion? Well yes, but actually no.\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10.\n11.\n12.\n13.\n-\nCheck this out Prajwal Tare's answer to What are some photos or screenshots which deserve 2T+ upvotes?",
      "7": "What are some screenshots which deserve a 1T+ view?",
      "8": "What are some screenshots which deserve a 1T+ view?",
      "9": "What are some screenshots which deserve a 1T+ view?",
      "10": "What are some screenshots which deserve a 1T+ view?",
      "11": "What are some screenshots which deserve a 1T+ view?",
      "12": "What are some screenshots which deserve a 1T+ view?",
      "13": "What are some screenshots which deserve a 1T+ view?",
      "14": "What are some screenshots which deserve a 1T+ view?",
      "15": "What are some screenshots which deserve a 1T+ view?",
      "16": "What are some screenshots which deserve a 1T+ view?",
      "17": "What are some screenshots which deserve a 1T+ view?",
      "18": "What are some screenshots which deserve a 1T+ view?",
      "19": "What are some screenshots which deserve a 1T+ view?"
    }
  },
  {
    "question_id": "https://www.quora.com/Why-do-some-people-say-book-ban-whenever-a-book-has-ever-been-banned-in-the-United-States",
    "title": "Why do some people say book ban whenever a book has ever been banned in the United States",
    "answers": {
      "1": "Because if a book is banned, it’s a book ban. Duh.",
      "2": "What else would they say? Ham and cheese?",
      "3": "When some people say \"book ban\" whenever a book has been \"banned\" in the United States, it is often used as a shorthand or a hyperbole to draw attention to challenges or attempts at censorship. It highlights the fact that a book has faced opposition or controversy, and that there have been efforts to restrict access to that particular book in certain contexts.\nOne example of a \"book ban\" in the United States is the case of \"To Kill a Mockingbird\" by Harper Lee. This classic novel, which addresses themes of racial inequality and social injustice, has been frequently challenged and banned in various schools and libraries across the country. The reasons cited for its ban include the use of racial slurs, offensive language, and discussions of controversial topics that some may find uncomfortable or inappropriate for young readers.\nWhile \"To Kill a Mockingbird\" continues to be taught in many educational institutions and celebrated for its critical examination of important social issues, there have been instances where the book has been temporarily or permanently removed from certain curricula or libraries due to these objections. Such challenges and removals are often seen as attempts to limit access to diverse viewpoints and suppress uncomfortable truths about America's history of racism and discrimination.\nHowever, it is important to note that true book bans in the United States, where a book is outright prohibited by law, are rare and mostly limited to specific circumstances such as obscenity laws, national security concerns, or specific prison regulations. In most cases, what is commonly referred to as a \"book ban\" often refers to instances where books are challenged or removed from libraries, educational institutions, or other public spaces due to objections from certain individuals or groups.\nUsing the term \"book ban\" in this broader sense helps to create awareness about attempts at limiting free expression, promoting intellectual freedom, and encouraging open discussions about ideas and differing perspectives. It reflects concerns about potential censorship and the importance of safeguarding individuals' right to access information and literature of their choosing.",
      "4": "Because it’s far more hyperbolic than, “a library has chosen to remove a book from it shelves…but you can still legally possess or purchase the book.”\nA ‘book ban’ brings to mind the Communists or Fascists destroying books that oppose them.\nThe reality, books being removed from shelves but still being entirely legal to purchase and possess, is so lukewarm that a Bureaucrat would fall asleep reading about it.",
      "5": "Original question: Why do some people say “book ban” whenever a book has ever been “banned” in the United States?\nCongress in the US has no power to pass a law banning books. Indeed, there have been censorship laws in the past, and many (if not most) have been overturned.",
      "6": "I know, English is a tricky old language isn't it?\nWhen a book is banned, for example by a two bob, wannabe fascist dictator whose presidential campaign is falling apart, it can be described as a “book ban”\nDo you see how that works? “book” and “ban” : the book has been banned\nHope this helps",
      "7": "There are people out there who can’t tell the difference between banning a book and making sure it is read by only those who are old enough to read certain material.We don’t typically provide children with reading material that is more appropriate for adults.",
      "8": "Is nobody is banning books in America dumbass it's about pushing the issues and K through 12 that's for learning education not your pecker size or the depths of your crevices",
      "9": "Because the truth doesn't fit their agenda.",
      "10": "They are not banned in the US , books of a pornographic nature are banned from being shown to five year olds !\nIm sure you agree that that is wise .\nIf not … why not .",
      "11": "“Book ban” is typically shorthand for a content-based interdiction imposed (by a government administrator) on a book previously available in a professionally-managed public collection.\nThis phrase contains a customary, standard usage of the word “ban”\nand is a fair summary of the intended and achieved effect, which is to prohibit someone from reading the proscribed book, at least in the intended way (e.g, for academic curricular value or general public benefit).\nIn the modern US, it is far more common for books to be banned by administrators or committees in charge of public collections than through laws prohibiting individual sale, purchase, or possession. However, plenty of books—many of them classics now\n—were once banned under obscenity laws in the United States, and there are still regular efforts at the local level—some legally successful\n—to do exactly that to newer books. So the premise of the question is indisputably false, even for an arbitrarily narrow definition of “ban”.\nContrary to the question’s assertion, books are banned all the time in the United States, sometimes by legal prohibition invoking obscenity, more commonly by elected or appointed officials interfering with access to public collections and elevating their personal viewpoints above the academic curricular and other professional collection management practices used to build those collections.",
      "12": "For the same reason those same people scream, “Racist,” or some other epithet at anyone who disagrees with them.",
      "13": "Well, it all started when Dr.Suess and the Mark Twain books were banned by Leftist because they were somehow racist and hurt feelings.\nHowever, in their eyes having young children read about homesexual and lewd heterosexual acts in gory detail is perfectly acceptable and to ban graphically pornographic novels from children is Evil.\nIn short sexually grooming children is fine as long as they don't have to read “Cat in the Hat” or “Horton hears a who”! Or find out what life was like in the old south.",
      "14": "When Democrats “ban” guns, they prohibit their possession, distribution, and sale. When Democrats accuse Republicans of “banning” books, the books are not similarly made illegal to possess, distribute, or sell. You can't “ban” books in this country, but Democrats love to accuse people of it.",
      "15": "I'm sorry - this question makes no sense at all.\nWhy wouldn't people say “book ban” when a book has been banned? What else would people say?",
      "16": "It's a smear tactic and an attempt to manipulate the uninformed and gullible masses to help them get their way, or they're gullible themselves and believe the lie they were told.",
      "17": "Umm… banning a book is the literal definition of “banned”…",
      "18": "They're usually referring to things like school libraries or local libraries refusing to carry books which might offend the sensibilities of the locals because they don't align with current rhetoric. If you look up banned books lists in the usa, and then look up details about the ban on any individual book, you'll generally find some list of school districts or libraries that have excluded that book. Also fairly common are English teachers who were sued by parents for teaching a particular book, or school districts that have decided to remove a book from the curriculum or required reading list because they find it too controversial. In a few cases, there are books that are detrimental to local industry because they are critical of it.",
      "19": "There are book Ban in the US\nThey even banned the Bible.\nUtah school district that banned Bible considers removing Book of Mormon\nDavis school district says it will assess text after complaint for ‘pornographic or indecent materials’ under law passed last year\nhttps://www.theguardian.com/books/2023/jun/03/utah-school-district-book-of-morman-ban",
      "20": "Because a book is banned in certain locations doesn’t mean we are banning books. A Pediatrician has every right to ban Penthouse, Hustler from his/her waiting room. In fact, if they didn’t, they would lose business. Parents concerned about what their children read shouldn’t be up for debate. We have ratings on movies, but who rates books? Parents regulate what their children are exposed to and it won’t be woke ideology or the education system, because, they will lose business.",
      "21": "That is a very interesting question.\nMuch of the time, people and the media overreact to the news that one bookstore, or the people on one schoolboard, have decided on their own not to stock a certain book. This is not a ban. It is, in fact, the same as you yourself making the decision not to purchase it. If you don’t buy a book (or a car, or a sandwich), it doesn’t mean you’re instigating a “boycott” or a “ban.” Neither is it a ban, for example, when a bookstore that caters to children decides not to carry sexually-oriented books and magazines (e.g., Penthouse, Playboy, Hustler, …).\nThe desire to force someone to carry a particular book is the evil here, for it imposes a viewpoint on others who disagree. When we mislabel as a “ban” a group’s choice not to stock a product themselves, we are insisting that they must carry it. The reality of the situation is that businesses, individuals, and groups who want to stock it (and share it, rent it, or sell it) are able to do so, and those who don’t wish to stock it are able to do that. This is liberty.\nA genuine “ban” occurs when a government passes a law making it illegal to stock a product. This is usually followed up by threats or efforts to confiscate that product. Bans are usually associated with materials fomenting violence, and with books that are labeled as pornographic. In countries other than the United States, governments occasionally impose bans on material that is critical of the government.\nExample 1: In Jerusalem (Israel) in 2023, police are confiscating copies of books that teach the Palestinian Authority’s school curriculum to children, including those that picture the PA’s flag. These books allegedly teach that the PA, which has not held democratic elections in 15 years, is an authoritarian organization that seeks to cause rebellion in Israel. They regard the books as “propaganda.”\nExample 2: A 1977 New York Times article reports that 90,000 pornographic books were seized by police in 1972 at a raid on a print shop. They were destroyed and were recycled into cardboard.\nExample 3: In May 2014, in Azerbaijan, police arrested three women who were meeting for unauthorized religious purposes, and they confiscated copies of the Hebrew Bible (Old Testament), which the police indicated was a “banned” book.\nExample 4: In 2020 in Vietnam, publications of the Liberal Publishing House were banned by the government. Police confiscate those books about political science and public policy, and they have been interrogating anyone possessing them.\nThese are bans. A bookstore or school district deciding not to carry something is not a ban.",
      "22": "I think what you’re trying to ask is whether books have ever really been banned in the US.\nWell, yes.\nThe Comstock Laws effectively banned numerous books between 1873 and 1959 by making it illegal to mail them to customers on the basis of being “obscene.” We’re talking books like Canterbury Tales by Geoffrey Chaucer and Moll Flanders by Daniel Dafoe. I’m pretty sure plenty of kids read classic literature in the early 20th century desperately looking for the dirty parts.\nUncle Tom’s Cabin was banned in the Confederate states during the Civil War.\nThe state of California banned The Grapes of Wrath because it was unflattering to the state.\nMore recently, a couple of military memoirs were banned for national security reasons.\nMost book bans, however, are local. They are in school districts or public libraries in particular cities or towns.\nHere’s a list of the most banned recent books. Note that most of them are critically acclaimed. They just deal with topics that some parents and politicians don’t want children — or anyone — to learn and think critically about.\nThe 50 most banned books in America\nThese books have been banned at schools and libraries. Why?\nhttps://www.cbsnews.com/pictures/the-50-most-banned-books-in-america/28/\nHere’s a more comprehensive list. Some books have been banned for poor scholarship but most for petty reasons or nonsensical reasons that indicate that those who oppose them haven’t even read them.\nList of most commonly challenged books in the United States - Wikipedia\nTitle Author Reason(s) for Challenge Year(s) published ALA rank 2010–2019 [6] 2000–2009 [7] 1990–1999 [8] The Absolutely True Diary of a Part-Time Indian Sherman Alexie Content regarding alcohol, bullying, violence; sexual references; profanity and slurs; allegations against the author 2007 1 — — Adventures of Huckleberry Finn Mark Twain Coarse language, racial stereotypes and use of the N-word 1884 33 14 5 The Adventures of Super Diaper Baby Dav Pilkey Encouraging poor spelling 2002 41 47 — The Adventures of Tom Sawyer Mark Twain Coarse language, racial stereotypes 1876 — — 83 Alice (series) Phyllis Reynolds Naylor Sexual content 1985–2013 21 2 14 All American Boys Jason Reynolds and Brendan Kiely Profanity, drug use, and alcoholism; thought to promote anti-police views, contain divisive topics, and be “too much of a sensitive matter right now” [9] 2015 — — — All Boys Aren’t Blue George M. Johnson \"LGBTQIA+ content, profanity, and because it was considered to be sexually explicit\" 2020 All the King's Men Robert Penn Warren Depicting a \"depressing view of life\" and \"immoral situations\" 1946 — — — Almost Perfect Brian Katcher LGBT content 2009 81 — — Always Running Luis J. Rodriguez Gang violence, drug use and sexual references 1993 — 68 85 America E. R. Frank Sexual references, drug and alcohol use 2002 — 100 — American Psycho Bret Easton Ellis Sexual references, violence toward women 1991 — — 53 An American Tragedy Theodore Dreiser Sexual content, abortion, murder 1925 — — — The Anarchist Cookbook William Powell Content related to the manufacturing of illicit narcotics and explosives 1971 — — 59 Anastasia Krupnik (series) Lois Lowry References to beer, Playboy magazine, and suicide 1979–1995 — 75 28 And Tango Makes Three Peter Parnell , Justin Richardson Content regarding homosexuality and same-sex marriage 2005 6 4 — Animal Farm George Orwell Political (Communist) commentary 1945 — — — Anne Frank: Diary of a Young Girl Anne Frank Discussions of puberty and teenage sexuality 1946 62 — — Annie on My Mind Nancy Garden LGBT content 1982 — — 44 Angus, Thongs and Full-Frontal Snogging Louise Rennison Crude language, sexual content, LGBT content 1999 — 35 — Are You There God? It's Me, Margaret. Judy Blume Content dealing with menstrual cycles and feminine hygiene 1970 — 99 60 The Arizona Kid Ron Koertge LGBT content 1988 — — 75 Arming America : The Origins of a National Gun Culture Michael A. Bellesiles Content dealing with firearms, later proven to have been fabricated 2000 — 38 — As I Lay Dying William Faulkner Dealing with issues of death; abortion 1930 — — — Asking About Sex and Growing Up Joanna Cole Sexual education 1988 — — 57 Athletic Shorts: Six Short Stories Chris Crutcher Content dealing with eating disorders, child abuse, racism, LGBT themes and AIDS 1991 — 44 63 The Awakening Kate Chopin Sexual content 1899 82 — — A Bad Boy Can Be Good For a Girl Tanya Lee Stone Crude language, sexual content, mature themes 2006 44 — — Bad Kitty (series)\nhttps://en.wikipedia.org/wiki/List_of_most_commonly_challenged_books_in_the_United_States\nPersonally, it drives me crazy when people want to ban a book that deals honestly with the challenges of growing up, particularly growing up as a minority, just because it has some swearing in it.\nEven worse are the people whining that some books are intended to make white kids feel “guilty” about being white. The word they’re looking for and can’t think of is “compassion.” It doesn’t hurt anyone to learn what challenges the other 14, 7, 5, 2, or 1% have to face.",
      "23": "It's because they want to make it sound like censorship when it's actually making choices about what books should be in schools. It's a disingenuous way to cause controversy and scare schools and parents from voicing their concerns because…that part I don't know.\nBut it has something to do with getting books that are really concerning into the bookshelves without any vetting.\nDear Celia Milton, if you ever come back, if you want to comment on my posts, you can’t have me blocked at the same time. I’ll delete you. That was the first comment I have ever deleted, and I think that is just fair play. I’ll be happy to converse, but you can’t do drive-by comments.",
      "24": "because the leftists and their cronies in the media have control over what is said.\nthere are no banned books in the US, only inappropriate books have been removed from school libraries. if someone wants their children to read pornographic books they are free to buy them and give those books to their children"
    }
  },
  {
    "question_id": "https://www.quora.com/unanswered/How-long-do-helicopter-tours-typically-last-and-what-can-passengers-expect-to-see-during-the-tour",
    "title": "How long do helicopter tours typically last and what can passengers expect to see during the tour",
    "answers": {
      "1": "If you must whine, on the Leigh’s bring too long do not take the tour by ruining it for others."
    }
  },
  {
    "question_id": "https://enlightentheworld.quora.com/Can-you-share-the-screenshot-that-deserves-678M-views-23",
    "title": "Can you share the screenshot that deserves 678M views 23",
    "answers": {}
  },
  {
    "question_id": "https://www.quora.com/Where-is-Hamas-getting-the-rockets-it-fires-into-Israel",
    "title": "Where is Hamas getting the rockets it fires into Israel",
    "answers": {
      "1": "Most of the material is smuggled in. It is disguised as other materials or it is co-opted from materials that are supposed to be used for the economic and infrastructure development of Gaza.\nIsraeli metal used for Kassam rockets\nSmuggling of rocket fuel to Gaza foiled\nhttp://www.israelandstuff.com/israels-shin-bet-nabs-4-tons-of-hamas-bound-chemicals-used-for-rocket-fuel\nThe smaller rockets are typically manufactured in Gaza, while the larger ones are smuggled in.\nWeapon of Terror:\nNews - IDF captures Iranian ship carrying advanced rockets for Gaza\nIran has admitted on a few occasions to helping Hamas in Gaza:\nAccording to the official in Tehran, Iran is committed to the Palestinian cause. He said, “We will always stand side by side with the resistance in Palestine and Lebanon. Even in Syria, if there’s any group whose objective is liberating the occupied land, we will back them and support them\n.” He added, however, that sending arms isn’t always the best way\n. “We know how much our brothers need support. Israel always claims Iran is sending arms to them. What I can say is that Iran wants to see a strong and self-sufficient resistance. Yes, we are sending rockets and military aid, but not the traditional way.”\nRead more: http://www.al-monitor.com/pulse/originals/2014/07/gaza-rockets-palestine-iran-self-sufficient.html#ixzz47lIb2wyd\nIran's Parliamentary Speaker Ali Larijani has also admitted to arming Hamas:\n“The clear need of Palestine is its need for weapons and basic necessities, and Iran plays an important role in meeting the clear needs of the Palestinian people.”\nJuly 23, 2014 according to press\n“Today, the fighters in Gaza have good capabilities and can meet their own needs for weapons. But once upon a time, they needed the arms manufacture know-how and we gave it to them.”\nJuly 24, 2014 to the Arab language service of state television\n“We take it upon ourselves to stand by and help the oppressed Palestinian people wholeheartedly one way or another.”\nJuly 15, 2014 in a meeting\nwith ambassadors from Muslim countries\nMore Iranian quotes on the matter here: Iran on Gaza Conflic\nt\nEssentially they get them any way they can. And while Israel's security is top notch because we're always dealing with new threats to our security, the contra to that is that the smuggling efforts keep getting more and more innovative as well.",
      "2": ".\nUN observers in Gaza and Lebanon watch and tally as rockets are shipped and delivered to terrorists in hamas and hezzbollah by IRAN.\nIn Gaza they are stored in schools and hospitals.\nSimilar in Lebanon.\nThis is why Iran was named to the UN council on human rights to kill Jews.",
      "3": "Most of the rockets are made in the Gaza strip. Some higher quality (longer range and heavier warhead) rockets of Iranian or Russian make are possibly smuggled via tunnels.",
      "4": "Iran.",
      "5": "Hamas’ main armament has been the Qassam rocket, a cheap garage-built weapon assembled from industrial piping, homemade rocket fuel of sugar and potassium nitrate fertilizer, and commercial explosives. The Qassam is a crude, ineffective weapon, but is small enough for a couple of militants to set up on a launch rail, fire, and get out of the area before the Israelis can target them.\nQassams are supplemented by bigger, military-grade rockets like the Russian-made 122mm Grad, these are bigger, more accurate and do far more damage, but are much easier to locate and destroy.\nQassam attacks are essentially harassing fire, landing at random and unlikely to cause casualties, but they can be lethal. To stop them, Israel set up its famed Iron Dome defense system, an arrangement of radars and interceptor missiles that can track and shoot down hundreds of incoming rockets with a claimed success rate of 90% against the 4,500 rockets fired in the 2021 conflict.",
      "6": "Hamas has obtained rockets and other weaponry from various sources over the years. The acquisition of rockets by Hamas is a complex issue with multiple channels and suppliers. Some of the ways in which Hamas obtains rockets include:\nManufacturing: Hamas has locally produced some rockets and improvised explosive devices (IEDs) using materials available in the Gaza Strip. These locally made rockets are often less advanced than those acquired through other means.\nSmuggling: Rockets and weapons have been smuggled into the Gaza Strip through underground tunnels from Egypt. This has been a significant source of weaponry for Hamas, although efforts have been made to counter these smuggling operations.\nIran: Iran has been accused of providing support to Hamas, including the supply of rockets and other military equipment. Iran's support is often seen as part of its broader regional strategy to support anti-Israel groups.\nOther Regional Sources: Hamas has received support from various sources in the Middle East, including Hezbollah in Lebanon and other armed groups. These groups have at times provided expertise, training, and weapons.\nCapture or Diversion: Some rockets and weapons may have been acquired through capture or diversion from other armed groups or factions operating in the region.\nIf you want to know more about Hamas then read this book.",
      "7": "These rockets are built by Hamas. They are not hard to make. Any high school student with a machine shop, pieces of metal and fertilizer can make them. The instructions are widely available on the internet. They are useless against Israel as the “Iron Dome” intercept 90% of them. Most of them fall in the desert because they are very inaccurate and have no navigation. Each probably costs about $100 to make, but the interceptors are at $50,000 each. It costs Israel a lot of money to counter these cheap rockets., but they have the money. It’s drop in the bucket for them.",
      "8": "From countries,foundations and people who share their belief that they will kill or drive away all Israelis from the river to the sea.",
      "9": "Some of these rockets come over Egypt from Iran or some other arabic country. Or they're built in the Gazastrip.",
      "10": "Most of it is given to them by their Shia paymasters, Iran."
    }
  },
  {
    "question_id": "https://www.quora.com/Which-screenshot-deserves-5381M",
    "title": "Which screenshot deserves 5381M",
    "answers": {}
  },
  {
    "question_id": "https://www.quora.com/What-will-it-take-to-stop-mass-shootings-in-America",
    "title": "What will it take to stop mass shootings in America",
    "answers": {
      "1": "Everyone being armed.",
      "2": "When the shooters can longer count on “Gun Free Zones” and we restore involuntary mental health commitments you'll see order restored",
      "3": "The only thing that will stop an evil man with a gun\nIs a good man with a gun\nI run towards the sound of gunfire\nI will shoot",
      "4": "The same thing it will take to stop any other VIOLENT ACT in America!\nWe have rapes, violent assaults, child abuse, etc, that are committed WITHOUT guns. I don’t believe that the victims of those crimes are too concerned that the offender who attacked them, did so without the use of a gun!\nGuns do NOT commit any crimes! They CANNOT do ANYTHING of a criminal nature without being handled by a CRIMINAL!",
      "5": "Maybe if we started calling them “mass very-late-term abortions.” Then the nutters might actually support doing something constructive to stop them.",
      "6": "I am not sure about all mass shootings, but one thing I am sure about. With the advent of social media, bullying today has really gotten out of hand. Back when I was in school (I am now 70), a couple of my friends were picked on and I always stood up for them. I got into fights over protecting them and years later these 2 friends told me what it meant to them that I protected them. I remembered other things from those days, but to them that is what they remembered. If I could go back in time I would protect anyone being bullied, not just the friends I knew; I would protect all students. I regret not having done that.\nMost bullied kids just shy away and learn how to cope with it in silence. Some wind up hurting themselves. Many choose that route. But some go to school to hurt others. There should be zero tolerance for bullying at school, and all students should stand up for each other, even strangers. Protecting only your friends is what makes for cliques, and it’s easy to wind up eliminating others, and thereby, making things worse for those who are excluded.\nI think a single true friend for someone being bullied can make a real difference, especially if that friend has a good heart and is interested in helping everyone. I try to tell that to the students I have the honor of teaching.",
      "7": "one thing — records are sealed on juvnilles — can’t check on them — should at least be noted that no guns until at least 25 — if they keep on being “bad” they couldn’t get a gun then. medical health - places were closed and people put out on the street that should have been keep locked up under treatment — they aren’t going to volunteer for treatment. kids that kill are let out when they reach 18 or 21 . they don’t stop then .",
      "8": "Eliminate the Deep State and the shootings will stop.\nFolks once thought I was a conspiracy theorist. Until everything me and those like me predicted started coming true. It's all there, you need only look. Or you can keep taking the Blue Pill.",
      "9": "Reduce the number of Democrats in elected offices. Democrats have proven themselves to be anti-America, anti-good, anti-Constitutional, treacherous, treasonous and pro-criminal. Let’s stop pretending that they’re not a criminal cabal gang out to sellout their own country for a buck and reduce their criminal influences across our nation.\nBring back swift and sure justice for convicted criminals in how they are punished, sentenced and swiftly executed. In other words, bring back the firing squads, electric chairs and hanging gallows. Executions should follow within a fair amount of time not to exceed 1.5 years from the original sentencing date.\nLock away, contain or control people who are mentally ill and get them the needed medical help that they truly need. Lock away, contain and control people who are career criminals forever. Don’t fool around with evil people, lock them up and leave them locked away. Committing a crime one time could be a one-time bad decision. Committing a crime the second time is a matter of choice. As such, lock away the criminal for a longer time and not give him any breaks.\nThe Buffalo Shooter threatened to shoot up a school before he actually shot up a grocery store. He got arrested and detained for a whole 36 hours. After the 36 hours he got released. Why was he released? If he had been kept under lock and key, a large group of people would not have died in a needless fashion a few weeks later. The Buffalo Shooter not only gave warning of his insanity, he broadcast it over the social media systems too as he did the shooting. We need to identify guys like this one and put them under lock and key. We need a system that works to identify these people before they strike and take them off the streets.",
      "10": "Ban the gun, they’ll use a car. Beef up security, they’ll go to Walmart instead.\nYou HAVE to address the mental health crisis. This dude was abandoned by a crack-addict mom and spent half his life raging at everyone around him, making online threats, and cutting up his own face “for fun”… and nobody did anything. A background check isn’t going to help if information about his background isn’t entered into the database.\nThe overwhelming majority of the daily mass shootings that never make the headlines are drug/gang related. Either the War on Drugs needs to end to cut the money supply, or it needs to be drastically escalated to jail dealers and users for life. Street gangs need to be charged under RICO statutes the same as mafia members. The biggest “bang for buck” to cut the number of mass shootings is to imprison the ones who are doing it.\nThat’s NOT rural middle-aged white blue-collar outdoorsmen. Practically every gun-nut applied for a concealed carry permit and got it, and they’re almost never revoked for later criminal conduct. In my county since the 1990s, out of 30k permits issued, less than two dozen have been pulled. Rednecks have a cleaner record than the cops doing the approval!",
      "11": "Well first you have to decide what you mean by mass shooting as there are several different definitions going around right now. If you are using the most liberal definition (see The Gun Violence Archive) then you could stop most mass killings by arresting the violent criminals and domestic abusers who commit the vast majority of these shootings. If, on the other hand you use the most restrictive definition used by Mother Jones, prevention will be more difficult as these events are rare (only three so far in 2022 including Uvalde), and seem to be totally random in nature. I’m not sure how one would stop something that comes out of the blue like this short of putting everyone in a box and feeding them through a slot.",
      "12": "Effective gun-management coupled with accelerated capital-punishment for hate-crime, mass-shooting and other heinous acts with guns. America currently has over 50M people incarcerated with 15–20 millions repeating and violent convicts requiring a great deal of resources from the public. I advocate a screening program to remove/execute 10% to 20% of the most violent repeat-offenders each year.\nAs extreme as this strategy may seem to some people, it serves as both an effective deterrent and prisoner-resource management. Sadly, the total number of violent repeat-offenders will not decrease as more will be convicted and imprisoned. Thus, we must discuss alternative means to productively-deploy this large-community of the most-depraved criminals.",
      "13": "We all had guns in our trucks, and my old man would have beat me to within an inch of my life if I ever even thought about pointing a gun at someone. We don’t have a gun issue, we have a safety and parenting issue. Of course we can’t talk about the parenting issues because that might offend voters.\nIf you want to really effect change then the career politicians have to be removed because they will do whatever it takes to further their time in Congress. Then you need to start working on the causes driving the creation of single-parent households (hint: government policies play a LARGE role). The only way to create responsibly adults is to have responsible parenting; no one else can achieve this. The only way to give adults a chance to be responsible parents is by implementing policies that absolutely will cause you to not get re-elected. If you already aren’t worried about that then you’ve taken a large step in the right direction.\nMass shootings (more than 2 per DAY in 2021) are merely an expression of societal ills. Much of what is driving those ills is an ever-expanding government incapable of policing itself and hell bent on self-preservation.",
      "14": "What kind of mass shooting?\nTerrorist mass shooting. This can be cut back by 70% merely by prohibiting Moslems from entering the US and eliminating all that are currently here. Not going to happen.\nDomestic dispute/gang mass shootings. You don’t hear too much about these because the parties know each other and the body count is usually limited. You could reduce the number of gang related mass shooting by mandatory execution for drug dealing. Not going to happen.\nRandom mass shooting. This is the kind that makes the news. Some crazy person that everyone knows is crazy starts killing a bunch of people. You could mandate that every mentally ill person be locked up. Not going to happen.\nWhat is better is to get the police to enforce the law (many of the mass killers had run-ins with the law, but nothing was done), get people who see something to say something, to ban “gun free zones” and encourage a whole lot more people to carry guns.",
      "15": "Retrofit every school in America with one and only one actual entrance, GUARD IT WITH ARMED GUARDS, and arm those teachers willing to BE armed against any nutjob who gets through. That’s it.",
      "16": "Nothing will stop mass shootings short of complete gun confiscation and that isn’t going to happen. We can reduce it by eliminating the welfare system, by improving mental health care/reporting systems, by hardening soft targets, by increasing penalties for using guns in a criminal way and by improving the bad guy/good guy gun ratio.",
      "17": "GUTS and WILL!\nBoth seem to be in short supply.",
      "18": "Well, first we eliminate what can’t be done. We can’t magically eliminate firearms. We have also proven we have no way to guarantee criminals or psychos can’t get their hands on them. Any law passed trying to do that is an effort in futility because anyone hell bent on mass murder isn’t going to limit themselves to legally purchasing a firearm. If the government can’t keep dangerous drugs and weapons out of the most secure facilities in the US, they sure as hell can’t keep them out of the gun-free victim zones.\nSo, what’s left? We could secure schools with better doors, controlled access points, no windows, etc but that’s only as good as the “non-security” staff in the schools allow it to be. Nothing stops a teacher from propping open a secure door for a smoke break, and who wants windowless rooms?\nThe one thing that we could do immediately to have a real impact on stopping these is to arm staff members who want to be armed. If a teacher or janitor wanted to murder their students there is literally nothing stopping them from bringing a gun to school and doing it. And yet for some reason they aren’t doing that. Of course if we implemented this like many schools have (where there has never even been an attempted mass shooting, btw) then there wouldn’t be a reason to push gun control and the politicians pushing it would lose political power. So, yeah. We’ll never stop having mass shootings because they are too profitable for anti-rights activists.",
      "19": "Politicians will need to take a deep look into the causes of this sort of sociopathic, soulless violence. Broken families, an age of entitlement, no accountability, removal of religion from schools and workplaces, no sense of responsibility, horribly violent video games, lack of discipline at home and in the classroom, our welfare state, lack of willingness of DAs to prosecute criminals, castigation of police — our social system is in a shambles. Guns are NOT the problem, they're merely convenient means to commit violence.",
      "20": "It would require complete and utter shift in the way the Democrats think. They need to stop attacking law biting citizens rights and freedoms, just to begin with. Democrats need to stop treating gun owners as the enemy. Instead of going after inanimate objects they need to take a step back and try to figure out what the root cause of these mass shootings actually is, then start addressing those issues.\nThe problem is the Democrats have no interest in Public Safety. They’re only interested in stripping American citizens of their Second Amendment rights and freedoms and confiscating all their firearms. If not for organizations like the NRA and the Republicans they would’ve accomplished this long ago. It really pisses off the Democrats that we keep fighting against them on this. Instead of just submitting to the glory and wisdom of the democrat party, and surrender our rights and freedoms to them. But instead we stubbornly never stop fighting against them for our rights and freedoms.",
      "21": "Improving the mental health system and removing targets (gun free zones signs) from the school properties. We protect our politicians and court houses but not our children. Shameful!",
      "22": "For the 1st 250 years in America we had no school shootings. During the last 15 years, we’ve had 900 incidents (I’ve heard). Until we answer what has changed during the last 15 years, we will not solve the problem.\nUntil we admit to what has changed; we can only prevent. That means protecting the defenseless or Hardening the facility. That decision will be made locally. The national politicians can and will do nothing except crawl over each other getting in front of the camera and making it a political issue.",
      "23": "A cultural shift, but a very difficult one.\nMost people like to argue about legislation — I would say fundamentally if the culture in America is such that legislation is this contentious, then it’s already doomed to fail, so there’s no point arguing about it. There are countries with and without various gun control measures who simply don’t have the kinds of problems America has, because the culture is different.\nImagine if all of the world outside of America just lost interest in football/soccer. Imagine World Cup viewership dropping 90%. For a lot of people, they can’t even imagine it.\nThat’s the magnitude of the kind of cultural shift that needs to happen in America for mass shootings to stop being a thing.\nSo is that impossible?\nWell, American football enjoys the mania in America that the rest of the world reserves for soccer — but that’s on the decline with parents pulling their kids out of the sport for fear of brain damage. You could imagine in a generation or two, Americans will basically not care about football.\nSo if you can imagine Texas without football nuts, which is basically impossible right now…",
      "24": "Get rid of all the nonsense we’ve filled this country with, from bullying to unrestricted immigration, to “kill whitey” riots, 11 dollar gasoline, and then carry out the extinction of the ENTIRE political class.",
      "25": "If 99.9% of the gun violence from night clubs to elementary schools are young and middle aged males, then you make it illegal for them to own guns until they are over 55. Pretty simple. Men are genetically predisposed to violence and obviously quite good at it- and they are the direct result of Darwin’s “survival of the fittest”- an evolutionary race that has been going on since weapons were invented. I wouldn’t continue to treat everyone is the same in society, and try to focus on the actual shooters instead of the crowd.",
      "26": "People stepping up and being responsible for their loved ones actions. Also when government requires a simple mental evaluation test Before handing over a gun for purchase. Parents need to be responsible for children accessing their guns as well. There are ways to stop so many needless shootings.",
      "27": "First, we ask need to understand the game being played. There is an critical election coming up and the dens have nothing to run on. Out of control gas and food prices, failed covid policies, Americans and marines abandoned in Afghanistan, don't win elections.\nAs hard as they've tried, the cannot respark the covid panic to force lockdowns and mail in elections. So they create a panic over guns. Try to scare people into believing unless they keep Congress, our babies are sitting ducks in classrooms - children and elderly always get voters attention and dems always use them.\nSo you think I'm wrong, here is some evidence, albeit circumstantial. You are suddenly hearing about “mass shootings” every time someone is shot anywhere - except in the hood. Dozens of people are shot in gang activity every week in Chicago, but this does not get coverage because it does not help the narrative. None of these punks own legal guns.\nThis latest “unwasted crisis” is to a ploy to keep congress in November and nothing more.\nDon't get me wrong, when mentally disturbed people needlessly kill people, they need to be punished - shot by a firing squad on TV for all the world to see. But make no mistake, if you are listening to the left, you are being played like a fiddle.\nStop listening to D.C. politicians who don't have the IQ of their pets and listen to common sense. There is still time, but not much.",
      "28": "More security. Stop leaving schools wide open with no protection. That's just a start. Trouble in America is the lack of reasonable thought. Lawyers and politicians have stripped the citizenry of this country of the right to protect themselves; instead leaving our security up to failing police policies, training, and negligence.\nHuman beings are, by birth, responsible to protect themselves against harm from any outside threat. No court, cop, politician, or beaurocrat has any right to determine the destiny of any other human being. God created man. Man did not create man and therefore has no right to control any other man by his own doctrine.\nGet criminals out of society. Bring back the death penalty for those who cannot luve in society without causing harm to other members of society. Create consequences for criminal behavior.\nIn short, stop being a passive, liberal, crybaby society.",
      "29": "Get rid of ‘gun free zones’, where 98% of mass shootings have occurred since 1950.\nMake pleading away gun charges a felony. No more charging every black kid that comes around with a gun crime just so you can leverage it for a quick win, you charge them, or you go to prison.\nGun crimes are always the first plead away in an effort to get a perp to plead guilty. Even if there was no gun, the punishment is such that folks will admit to shit they didn’t do to avoid it, even if it’s a bullshit charge and there was no gun.",
      "30": "I respect for life including The Unborn would be a good start and returning back to worshiping God. The problem is a cultural one. Has nothing to do with arms we've had arms for a long time. We don't have a gun violence problem because gun violence is just a political term designed to Gin up excitement by the base of the left. There is just violence and it is caused by a corrupt people who have turned away from God and have turned away from decent behavior. They have problems with sexual immorality and with the desire to pleasure themselves at the expense of unborn children and the expense of others as well and they have a sense of entitlement. What the hell did you think was going to happen? When they took prayer out of school and when they started with this stupid so-called free love aspect there were many people who predicted all of the social ills that we now have and everybody laughed at them just like they laughed at Cicero in ancient Rome when he told them of the problems that would lead eventually to Rome's collapse. It's a cultural problem. At this point unless you can get people to turn themselves around it will take removing those people from the world to fix it. That's probably going to happen in a coming civil war because of the cultural Wars that we have. In fact the Civil War is virtually guaranteed. This is not a bad thing really. It means we get to clean this mess up even if it takes some violence to do it and we get to reset and return to our federal constitutional republic and finally we get to return to a more conventional judeo Christian morality. These are all good things and worth the casualties that will result from such a civil war.",
      "31": "Get rid of the morons that want to defund the police, that extol “diversity\". Get rid of the progressive socialist libtards, if they push too hard there could be a civil war and the problems will be solved. Having been In 2 countries in civil war and did Ops in more hunting commie rat bastards and terrorist worldwide, the leftist morons are clueless about human nature and history..",
      "32": "Laws should be changed that would allow graphic pictures of childrens killed be shown to the public and posted in front of member of Congress and Senator’s residences, so that they would have to answer to their family and friends why it is more important for them to support the NRA and gun companies than putting in laws that would protect their constituants",
      "33": "Dominic Wakeland , how do you stop serial killers from killing?\nYou do understand these mass shooters are severely troubled…? Do you even consider how many lives Madoff and Epstein ruined???\nOf course not!",
      "34": "For the media to stop fetishizing them.\nStop making them news.\nName each and every victim on-air, but refer to the scum who shot them as “Random shit-stain #1”.\nGive them zero publicity.\nDon’t make them infamous.",
      "35": "I would say that we need to begin to bring back the Mental Institutions and commit the mentally challenged people so they are off the streets",
      "36": "Proper federal regulation and education.\nGun manufacturers and gun interest groups specifically banned from making political donations and lobbying. They have proven they are indifferent to murdered children for the sake of good business, they are no longer allowed a say. Their greed murders your children.\nNo more blank check gun purchases. Registry of all guns in private ownership. All. Guns.\nFederal gun training starts at 21. Legal gun ownership starts at 25. Not before.\nAnnual mandatory, federal gun courses and psych evals. Demands on safe storing of weapons in private homes. If not completed or passed, all guns are revoked from private homes.\nIntensified prosecution against unsolicited use of private weaponry. Including brandishing guns against civil rights protesters. If convicted, guns are revoked.\nThat’s how the Free World does it.\nDunblane: How UK school massacre led to tighter gun control | CNN\nDunblane: How UK school massacre led to tighter gun control | CNN\nhttps://edition.cnn.com/2012/12/17/world/europe/dunblane-lessons/index.html",
      "37": "The solution is probably to stop focusing on mass shootings and to put them into perspective. A hundred people a year die from mass shootings and a hundred people a day die from car accidents.\nIt’s terrible when an airliner crashes and hundreds die but it doesn’t happen often. In a way, it’s the same with mass shootings. We need to do what we can to stop it if possible but it’s happening primarily because of a few “nutcases”.\nIt’s not that gun owners are being irresponsible. That would be something that we could address. It’s not because there are suddenly a lot of guns since there have been a lot of guns in the U.S. for a long time.\nThere was a time when there were no/few airline hijackings and then suddenly hijackings become more common. Nothing changed regarding the way the airlines were operating, there just suddenly were hijackers. We addressed some of the issues and virtually no one got away with it and it more or less stopped until suicide bombers started using hijacking as a tactic.\nThat is harder to stop, we’ve “policed” the whole system and it has slowed down but it’s still a concern. There are many more schools, malls, and other public buildings than there are airports.\nIt’s not...",
      "38": "Other countries have reduced the levels of mass shootings and other gun injuries and deaths by introducing legislation that requires a level of responsibity of anyone who wishes to posess a firearm. They also typically ban firearms with the charactersitics that make them particularly effective in carrying out mass shootings.\nAustrailia is hailed as the best example. Since the Port Aurthur shootings, the number of guns in the country has been reduced by 1/3 (meaning there are still tons of guns out there) and there has been a dramatic decrease in gun violence ever since.\nPerhaps if gun owners needed to carry liablility insurance (like car owners) then many would decide it is too expensive….",
      "39": "Get rid of the US style democracy, human rights and freedom which are to kill more people, infect more people like virus covid-19.\nAdopt the superior Chinese style democracy, human rights and freedom which are to save lives of billions, protect human rights, the beacon of humans lives.",
      "40": "Repeal the constitutional amendment that allows private gun ownership. Close down all gun shops and then wait two generations for people to forget about guns. Create an unlimited time amnesty for people to handover guns. People will still be handing in guns in a 100 years’ time, but that’s fine.",
      "41": "We have every sympathies for poor and pathetic Americans living in dangers, fear where mass shootings, school shooting, streets shooting, work place shootings, all kinds of shooting and killing happens every day everywhere. God save America , most miserable country in the world. So many got killed by gun violence but they still argue that guns should not be banned. they are the biggest laughing stock in the world and pitied by people in civilized nations."
    }
  },
  {
    "question_id": "https://www.quora.com/Do-any-WW1-trenches-still-exist",
    "title": "Do any WW1 trenches still exist",
    "answers": {
      "1": "Yes at Beaumont Hamel on the Somme. The trench system still exists you can see where the Germans held the high ground and were able to slaughter the Canadian Newfoundlanders and the a German lines across no mans land.\nIt gives you a real sense of a battlefield apart from its now green not torn up soil. The shell craters are still there.\nThe Somme in general is well worth a visit. What was once hell on Earth is now rolling French countryside. There are plenty of reminders of its violent past yet the area feels so now at peace. The cemeteries , and there are lots are beautifully maintained. More poignant if you have fallen ancestors there. We have stayed a couple of times in Albert.\nThe local French are really nice and welcoming.",
      "2": "I believe the best way to answer this question is to show you some modern photographs.\nBelow are pictures of the Newfoundland Memorial Park at Beaumont Hamel, France\nBelow Turkish Trench Gallipoli, Turkey.\nYpres, Sanctuary Wood. Belgium.\nVerdun France.\nCaporretto and Isonzo. Italy.",
      "3": "Yup.\nStill preserved.",
      "4": "Yes, a few German and Canadian trenches are preserved at Vimy Ridge. and there are some French and German trenches and bunkers around Verdun and up on the Vosges mountains\nI took a walk on the Vosges mountains to see the German positions and on my way back came across an entire cache of 75mm shells, just recently revealed by rains - I avoided them of course but that was over sixty years after World War One. The area around Verdun was still killing at least one person a year even in the 1990s. People pick up what they think is dud ammuniction, but it isnt.\nAt Vimy Ridge, at one point the trench lines were only 10 feet apart, you could spit at the enemy\nIn other parts of France you can see where the trench lines were by the chalk marks in the fields. They trenches are long gone, but the chalk underlay that was churned up marks the area clearly as you drive by. You know you are in the area when you start hitting cemetaries, some French, some British (Commonwealth) and German.\nIf France (and Belgium) if you know what to look for you can find all sorts of things from the war, trenches, bunkers, pockmarked buildings, the lot.",
      "5": "I don't know if they are still there, but some 30 years ago there were WW1 trenches still visible in the forests of the Masurian Lakes (now in Poland). The area was the sight of one of the biggest WW1 battles on the Eastern Front, Battle of Tannenberg\n. It was fought between Russia and Germany on Aug. 26–30, 1914, and resulted in Russia’s defeat.",
      "6": "Yes, some World War I trenches still exist and have been preserved as historical sites or landmarks. These trenches serve as a reminder of the trench warfare that characterized much of World War I. Here are a few examples of World War I trenches that have been preserved:\nVimy Ridge Trenches (France): The Vimy Ridge in northern France is home to a preserved network of trenches, tunnels, and other World War I relics. The Vimy Ridge was the site of a significant battle in April 1917 when Canadian forces captured the ridge from German forces. The site is now the Canadian National Vimy Memorial and includes preserved trenches that visitors can explore.\nThe Trench of Death (Belgium): Located near the city of Diksmuide in Belgium, the Trench of Death (Dodengang) is a well-preserved section of World War I trenches that was part of the Western Front. It is now a museum and memorial site that provides insights into the challenging conditions faced by soldiers during the war.\nLochnagar Crater (France): While not a trench system, the Lochnagar Crater in the Somme region of France is a massive crater created by an explosion during the Battle of the Somme in 1916. It is a popular historical site and serves as a reminder of the intense artillery barrages that characterized the war.\nSanctuary Wood Trench Museum (Belgium): Located near Ypres in Belgium, the Sanctuary Wood Trench Museum preserves a section of World War I trenches. Visitors can explore the trenches and gain a better understanding of the conditions faced by soldiers during the war.\nVerdun Battlefield (France): The Verdun battlefield in northeastern France contains numerous preserved trench systems, forts, and other remnants of World War I. The Battle of Verdun was one of the longest and most brutal battles of the war, and parts of the battlefield have been preserved for historical and educational purposes.\nThese preserved trench systems and battlefield sites offer visitors a glimpse into the harsh and challenging conditions that soldiers faced during World War I and serve as important historical and educational resources. Many of these sites have museums and interpretive displays to provide context and information about the war.",
      "7": "Yes.\nSome now look like this,\nSome have been better maintained like this:",
      "8": "There are places in Belgium where trences have been restored/ recreated. Any ‘original’ trenches would have fallen apart by now.\nWhile I’m thinking of it there are trenches in the basement of the museum at Passchendaele. I don’t know how much they have been recontructed",
      "9": "There are places in France and Belgium where trenches are preserved. In the UK practice trenches have been unearthed.",
      "10": "I think there are many in France but ofcourse they look all grassy and smooth now.\nMost ww1 trenches/battlefield sites are cordened off to the public due to un exploded bombs still being present.",
      "11": "Yes. There are still some preserved ones in Northern France, along with the dugouts at Verdun.",
      "12": "You gotta think of the answer to this question yourself. They are kept up as a memorial to the men who died in them and to serve as a reminder to never let this or any other world war happen again",
      "13": "They have tried to preserve some in memoriam to those who died there and french farmers still unearth munitions year after year every month french army comes to pick it up for disposal for safety known as the iron harvest locally there",
      "14": "Yes. Some Revolutionary war ones still exist near Yorktown VA."
    }
  },
  {
    "question_id": "https://www.quora.com/On-May-29-Russia-destroyed-Ukraines-last-warship-Yuri-Olfirenko-with-two-missiles-Should-the-US-supply-ships-to-Ukraine",
    "title": "On May 29 Russia destroyed Ukraines last warship Yuri Olfirenko with two missiles Should the US supply ships to Ukraine",
    "answers": {
      "1": "Warship ?\nIt was a landing ship basically a very outdated 53 year old troop carrier.\nThis is a warship\nUkraine does not really have a Navy , they have 13 or so ships , 1 frigate , 1 corvette and 11 patrol boats.\nWhich is wholly unimportant since the Russo-Ukrainian war is a land conflict and no Navy is going to change that.",
      "2": "No, it would be a waste of money that would be better spent on other weapons, such as anti ship missiles.\nUkraine had a negligible Navy to begin with and numerically would stand zero chance in open water against the Black Sea Fleet, far more effective to sink them without risking more Ukrainian lives.\nThe Moskva comically went down with zero Ukrainian casualties, that is the way to do it.",
      "3": "The Sea of Azov and the Black Sea should be cleared of Russian ships. (Only Ukraine sailors used.). Submarines and Exocet missiles might accomplish this. Granted such a strategy would take years to come to fruition (training the crews, etc) but once that new reality hits, Russia would have no use for Sevastopol. Thusly, the rationale for the invasion would disappear.\nNot saying that Putin would accept this. But his replacement might.",
      "4": "In the long run yes Ukraine will need ships again, in the short term though they would be no use at all for this war as Turkey isnt allowing military ships in and out of the black sea anyay, and even if they were its not a good “bang for buck”, far better to send some long range weapons to take out ALL of Russia’s black sea fleet IMHO.",
      "5": "The military value of this ship was probably zero. Very typical for the Russian bombing recently - bomb some old useless stuff and report.",
      "6": "Ukraine has advanced misiles and drones that have already destroyed Russia's antiquated navy vessels that strayed within range.\nThe illegal linvasion of Ukraine by Russia remains a land battle that Ukraine backed by elements of the NATO alliance and other western nations had stopped and is successfully driving back. This will not stop untill the last Russian invader has been killed or is driven out of every inch of the. independent western sovereign nation of Ukraine.\nMeanwhile other western nations on that border with the now pariah state of Russia are on fast track to join NATO. Well done in unifying the west against you Vlad Putin.",
      "7": "Russia dominates the Black Sea, there are areas of the sea where NATO countries have ports. Ukraine has only one outlet to the sea - Odessa. Where the grain ships come from. This port is controlled by Russia from the sea. The only way out for the Ukrainian fleet is to sail out of other NATO countries, in which case NATO will directly get involved in the war, and whether at least one country will go on such an adventure. Therefore, today Ukraine does not have a fleet.",
      "8": "We shouldn't be supplying anything.",
      "9": "Ukraine has sunk a larger tonnage of Russian Warships than Russia has sunk of Ukrainian ones.\nUkraine seems perfectly happy sinking Russian warships with homemade truck launched anti ship missiles."
    }
  },
  {
    "question_id": "https://www.quora.com/Does-science-scientifically-prove-that-no-God-exists",
    "title": "Does science scientifically prove that no God exists",
    "answers": {
      "1": "Q: Does science scientifically prove that no God exists?\nNo, for two reasons.\nScience is the study of physically discovered things and phenomena. God is a conceptual entity that has been variously described in different people’s belief systems, but never physically discovered. It remains undefined, and thus beyond the province of science. Science cannot investigate metaphysical ideas, just what can be observed.\nThe other reason is that science is concerned with making physically confirmed discoveries and investigating what they are made of and how they work, not proving things. Science issues theories, not proofs.",
      "2": "Define scientifically.",
      "3": "No ,Science is based on humanoid reasoning,even Darwinism can Not prove Everything to the Last Detail.B I t Nevertheless it is Definitely Closer to the TRUTH than All the humanoid religions COMBINED…..",
      "4": "Most science points to the existence of some kind of causal agent beyond time, space and matter.\nThe Big Bang Theory and the finely tuned nature of the physical constants which govern matter and energy suggest that there exists some intelligent cause behind the existence of matter, energy, time, space and life.\nTime, matter, energy and space somehow came into existence coincident with the ‘Big Bang’. Prior to the Bang, current cosmology suggests there was ‘nothing’. The thing that brought everything into existence, whatever it may be, might as well be called God at this point.\nIt is only the nature of that God that is subject to debate. Is it conscious? is it derived from a set of natural laws that are beyond our current understanding of nature? does it have intention? personality? etc. No one knows and science cannot give us the answer because science’s reach doesn’t extend past the Big Bang at this point.\nThe Fine Tuning arguments associated with the existence of matter and energy are certainly intriguing and would suggest intentionality may exist within this thing that brought everything into existence.\nThese arguments are certainly as old as when Augustine first outlined them and little has changed in their makeup.\nLife is another curious matter because everything about life points to design which suggests a designer or creator. The information requirements to support living systems don’t have a cause within the laws of physics and chemistry.\nOur current understanding of physics, chemistry and biology tell us that the atoms necessary to support life didn’t exist until quite some time had passed in the universe. If the cause of the existence of the universe is the same cause that developed the technology we call ‘life’ then that cause has the following characteristics -\nIt exists outside of and independent of Time, Space and Matter,\nIt’s existence, as measured by our concept of Time, has been sustained for a very long time, pointing again to its existence being independent of Time as we understand it.\nIf it can be called alive, it’s life is unlike any form of life we understand.\nIt has the ability to fine tune natural physical laws and is capable of feats of chemical engineering and information systems engineering beyond anything understood by man.\nDespite the intuitive appeal of this line of reasoning, many people prefer to believe there is no such cause. So while professing to understand the nature of cause and effect, many people believe that matter, time, space and energy are not subject to the laws of cause and effect but remain independent of them.\nIn addition, while understanding that random processes do not produce information, the people hold the position that the information technology necessary to support life is independent of this same rule.\nThese people hold these beliefs as articles of faith.\nIronically, these believers refer to themselves as ‘atheists’ and ‘agnostics’.",
      "5": "Well science does not bother itself with silly things that have no evidence like gods"
    }
  },
  {
    "question_id": "https://www.quora.com/unanswered/Is-the-Bible-a-good-book-What-are-some-examples-of-inaccuracies-in-the-Bible",
    "title": "Is the Bible a good book What are some examples of inaccuracies in the Bible",
    "answers": {
      "1": "Is the Bible a good book? What are some examples of inaccuracies in the Bible?"
    }
  },
  {
    "question_id": "https://www.quora.com/Which-screenshots-deserve-1-000k-views-and-3-000-upvotes",
    "title": "Which screenshots deserve 1 000k views and 3 000 upvotes",
    "answers": {
      "1": "21 November 2022",
      "2": "IT'S A LEARNING PROCESS 🤷‍♀️"
    }
  },
  {
    "question_id": "https://www.quora.com/Do-humans-deserve-to-live",
    "title": "Do humans deserve to live",
    "answers": {
      "1": "No!\n1.Chickens: Humans consume approximately 65 billion chickens annually. Does our consumption justify taking so many lives?\n2. Deforestation: Humans destroy over 18 million acres of forests every year. Can we continue at this rate?\n3. Plastic Waste: Every year, 8 million tons of plastic waste harm marine species in our oceans. Do we deserve a place on this planet?\n4. Animal Entertainment: Thousands of animals suffer in captivity for entertainment. Is our pleasure worth their pain?\n5. Food Waste: Vast amounts of food are wasted daily, while 9 million people go hungry. Does this behavior befit a species that deserves to thrive?\n6. Poaching: Poaching endangers iconic species. Should we continue to share this Earth with them?\n7. Habitat Destruction: Habitat destruction drives species to extinction. Do we deserve a future on a planet we're slowly destroying?\n8. Waste Generation: Daily, over 500 billion plastic bags are used, with many ending up in landfills. Is our convenience more important than the environment?\n9. Illegal Wildlife Trade: Human greed fuels a multi-billion-dollar illegal wildlife trade. Is our prosperity worth the decimation of endangered species?\n10. Resource Depletion: Rampant consumerism depletes Earth's resources. Do we deserve to inherit an impoverished planet?\n11. Air Pollution: Air pollution leads to respiratory diseases, affecting millions of people annually. Are we justified in polluting the very air we breathe?\n12. Factory Farms: Millions of animals suffer in factory farms. Can we call ourselves compassionate beings?\n13. Electronic Waste: We dispose of over 50 million tons of electronic waste recklessly. Is our technological advancement worth the environmental toll?\n14. Pesticides: Excessive use of pesticides harms ecosystems. Can we justify sacrificing biodiversity for agricultural convenience?\n15. Microplastics: Plastic microplastics invade our food chain. Is our disregard for nature reflected in our diets?\n16. Water Pollution: Chemical pollution contaminates our water, affecting billions of people. Are we deserving of clean water when we're the ones polluting it?\nAnd after all we are a single species homosapiens in a 2.13 million species.\nThanks for reading, even if it brings a little change in you I will be the happiest love you have a good day ❣️\nAdiós",
      "2": "Everyone deserves to live. It’s your only opportunity to make the world’s investment in your life worthwhile. Don’t waste it.",
      "3": "It is brand ambassador of the world 🌍",
      "4": "“Do humans deserve to live?”\nNo.\nNot in any absolute sense, anyway.\nLife is grace. It is an unearned and unearn-able gift. We are given the span of years God allots, and we have no right to any more than that, nor any reason to feel that those years allotted are anything more or less than divine magnanimity.\nThat being said, each person is entitled to their life, even if they don’t deserve it.\nIf a mother gives her son a lollipop just to see him smile, he doesn’t deserve his candy. But it is nonetheless his candy, vis a vis every other person in the world except his mother—that is, he may not deserve it, but his right to have it is nonetheless superior to the right of any other person.\nAs long as he doesn’t abuse it.\nIf he takes his sticky lollipop and starts pressing it against a stranger’s clean suit, that stranger has every right to take the lollipop away, even though he (the stranger) has no prior claim to the lollipop and the child does.\nLikewise, while I don’t deserve the life I have, no one has any right to take it from me, unless by living I am infringing on their valid rights.\nAs to the silliness in the question details—blather about how humans are “a pain to this planet and every living being in it”—that doesn’t merit any serious response.\nThe Earth belongs to us (as tenants and stewards, at least) not us to it.\nWe ought to be good stewards. But the notional reification of the biosphere has no rights against us.\nIt is God Who judges our stewardship, and if He decides we’re unworthy to live, there will be no need for a Quora answer to make that clear.",
      "5": "No we do not fuckin deserve to live at all, what have we done other than fuckin wars, killing innocent animals, polluting the environment???? killing each other because of fuckin religions,we are just like a virus and we do not fuckin deserve to live, I am desperately waiting for the day the earth will take a revenge on us and hopefully leaves us the good people who are tryin to save it from savages.",
      "6": "No not at all. Only babies and animals deserve everything in this world rest all here are only to make trouble.",
      "7": "A human is like a virus. Wherever it lands it starts to reproduce and expand its ever growing lineage. It consumes and exploits every natural resource till its last drop. Once it has fed itself it relocates to another land and initates the cycle again. Unlike other species humans cannot maintain an equilibrium with their surroundings. Humans have to alter their surroundings for their comfort even if it means harm to another specie or fellow human. Coming back to the point, When a virus uses a human as its host a human doesn't let it survive for the damage it causes to the body. So should mother Earth do the same? pop in an antibiotic ? well that decision lies only with her. You'll get your answer the day you feel that the end is near.",
      "8": "You were brought into existence by someone else. It’s not a question of deserving or not deserving to live. Rather, it’s just a fact: you are here. You exist. Your life is just as real and just as relevant as anyone else’s life.",
      "9": "Whether we deserve or not, we HAVE to live here only !\nWhere else can we go ? No planet of either the solar system or of the Milkyway galaxy can support us.\nWe, the humans, were created by NATURE, under the probability of 1 in 1 trillion of a septillion.ie., 1 in 1 followed by 21 zeros.\nWho else than such a rare, unique species deserve to live in our Earth?",
      "10": "Nothing is permanent. In every religion there is a concept of PRALAYA, destruction of everything and restart from the ZERO.\nNothing deserves to remain permanently.\nHumans are no exception.",
      "11": "Now this is a question that would have some complicated answers.\nI don’t think there’s a question that Humans have earned the right to thrive on our planet. Of the uncountable different species that have existed, we have been the ones that have managed to evolve in a way that allows us to live such a different life to every other animal currently alive.\nGo team! Let’s buy new cars!\nHowever, as a by-product of this development, the Human race has become so detached from Nature and the planet in general, most of us can’t even see the true extent of the havoc we are wreaking on Earth.\nThe supply/demand system which we live by is relentless, the face of the planet is changing so dramatically, and with there now being over 7 BILLION of us (rapidly expanding) this is only going to get more and more significant.\nThink about that. 7 BILLION. Even the furthest reaches of the planet, Antarctica aside, have signs of human development. The ‘wilderness’ areas of the world, which is apparently what we are now calling normal, not-yet-ruined land, are dwindling and it seems people it’s cannot leave them alone. For example, some people can not comprehend why drilling for oil in Alaska’s largest wildlife refuge is a BAD thing. Hey, if we can make money, screw it.\nMaybe one day the general population will realise that this planet was around a very long time before we arrived, and it will be a long time after we are gone as well. Some things are really more important than is and our lives.\nSome people are great but, as a whole, Earth would really be better if we just dissappeared, preferably taking our hundreds of billions of tonnes of concrete with us.\nHave a happy day!",
      "12": "Yes, you deserve to live in this world and you will go through a lot of ups and downs but you’ll come out of it once you believe that you can heal from whatever you are going through. Mental health is just as important as physical health, I would advise you to see a psychiatrist and a psychologist to get treatment if you’re constantly feeling this way.",
      "13": "Human race is the best example of stupidity. We have limited natural resources, our actions should be based on that fact but they are not. People want money and when they get them they become blind .. to anything, to any other facts. Isn’t this enough to prove we absolutely don’t deserve to live?",
      "14": "I think this question is very opinionated.\nFirst of let's get this clear, this question will have very different answers based on varying belief structures.\nI myself believe that looking at current condition and history of the impact us humans have made on the earth, simply put the answer is no.\nFor some barbaric reason humans seem to think that we are far superior to any life form that exist. Maybe it's the fact we experience consciousness with a complex social and belief systems. My point is that all life is equal, and should be treated with the same respect we would want.\nWe need to drastically reduce our “footprint” before we could consider to be deserving of this beautiful place we call Earth. I think Earth is already too far gone as a result from our destructive nature. The sheer devastation we have already unleashed upon this place is terrifying. The deadly war machine’s we have created are deeply disturbing. The industrialized inventions are an example of how far we will go to rape the Earth of its resources.",
      "15": "No, we didn't do anything to earn this planet. We didn't work to get the dust to gather at the formation of the solar system. Earth’s biosphere can get along just fine without humanity. However, we don't deserve to not have Earth either. As the dominant species on this planet (aka the only species that has realized that Earth is a planet), we live in a sort of symbiotic relationship with the planet. The planet gives us resources and we attempt to keep the biospheres stable by maintaining populations of certain animals. It would be a good idea to attempt to leave the planet though, because as a byproduct of our living here, we will inevitably run out of fuels and metals. Eventually our population will be so large that we will have to colonize other worlds in order to survive. in this case, it's better to think of humanity as not something that deserves any planet, but something that needs Earth and other planets to survive. We're kind of like bacterial colonies. We depend on a certain set of conditions to live, and when we get too large for our container to provide those conditions, we are forced to move to another container."
    }
  },
  {
    "question_id": "https://www.quora.com/Is-it-legal-for-Ukrainians-to-attack-outside-of-Ukraine",
    "title": "Is it legal for Ukrainians to attack outside of Ukraine",
    "answers": {
      "1": "Is it legal for Russians to attack outside of Russia? Russia attacked Ukraine. If someone attacks your country, it immediately becomes perfectly legal to attack them back, and that means every square inch of Russia, including Moscow.\nAn explosion in Belgorod, Russian Federation. Authorities claimed it was set off because of heat. Yeah, because heat is so often a problem in Russia… This is what happens when you invade other countries. Carelessly tossed cigarettes and ordinary heat start blowing everything up…\nThis is warfare. If people were serious about legality, they wouldn’t be engaging in war. War is what you do, when legal actions have failed or you have no legal basis to get what you wanted in the first place.\nMr. Putin wants a Greater Russia, he wants to have access to the oil, gas, and coal in Ukraine’s Donbas region, he wants to have the lucrative grain exports that Ukraine enjoys, and he wants a buffer zone between Russia and the NATO nations.\nPutin has no legal basis whatsoever to claim ...",
      "2": "Within the limits that others (aka Russians) feel free to attack ‘you’ (Ukrainians) then the reverse becomes ‘legal’.\nIt’s called self-defence. Whether it’s somebody’s grandad in Brooklyn or a nation in the Former USSR attacking a person, group of persons, or any political entity of any size leaves you (the ‘perp’) liable to retaliation from the victim.\nJust leave others alone in case you later get left unattached yourself. It’s a simple paradigm; easy to understand. Really.",
      "3": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "4": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "5": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "6": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "7": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "8": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "9": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "10": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "11": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "12": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "13": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "14": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "15": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "16": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "17": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "18": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "19": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "20": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "21": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "22": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "23": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "24": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "25": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "26": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "27": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "28": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "29": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "30": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "31": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "32": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "33": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "34": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "35": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "36": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "37": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "38": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "39": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "40": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "41": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "42": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "43": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "44": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "45": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "46": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "47": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "48": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "49": "Is it legal for Ukrainians to attack outside of Ukraine?",
      "50": "Is it legal for Ukrainians to attack outside of Ukraine?"
    }
  },
  {
    "question_id": "https://picturesworthsharing.quora.com/What-screenshot-deserves-12-45k-likes-and-views",
    "title": "What screenshot deserves 12 45k likes and views",
    "answers": {}
  },
  {
    "question_id": "https://www.quora.com/Do-you-think-well-ever-stop-starting-wars",
    "title": "Do you think well ever stop starting wars",
    "answers": {
      "1": "No. Perhaps when the Earth becomes so inhospitable that humans can only think about survival and nothing else. And even then, there will be wars and fighting over what scant resources remain. This quote was attributed to Plato by Douglas Mcarther, but it was George Santayana who said it.",
      "2": "Unfortunately, you have not specified who the “we” is.\nIf you are talking about criminals and miscreants, the answer is almost certainly no.\nIf you are talking about governments of people defending themselves from criminals and miscreants, the answer is relatively similar.",
      "3": "As a species? No. If wars served no purpose they wouldn't be undertaken. If you look at the species that wage wars it seems to be priced in with societal living. Chimps, dolphins, meerkats, lions and ants plus many more for example all wage war. It's not the sole preserve of humanity."
    }
  },
  {
    "question_id": "https://l0lmeme.quora.com/Which-screenshot-deserves-1-80k-views-in-a-day",
    "title": "Which screenshot deserves 1 80k views in a day",
    "answers": {
      "1": "8 July 2023"
    }
  },
  {
    "question_id": "https://www.quora.com/unanswered/Why-does-everyone-say-I-defy-gravity",
    "title": "Why does everyone say I defy gravity",
    "answers": {
      "1": "Well certainly not everyone but well because anyone who has seen or read this silly question had to have said it to have read it right? logic is logic after all.",
      "2": "They don’t. Nobody says that. Nice try though. You posted a question everyone will roll their eyes at. You got that going for you.",
      "3": "It’s spelled “reason,” not “gravity.”"
    }
  },
  {
    "question_id": "https://www.quora.com/Do-you-have-to-believe-in-science-to-believe-in-a-god",
    "title": "Do you have to believe in science to believe in a god",
    "answers": {
      "1": "Q: Do you have to believe in science to believe in a god?\nA: Is there ANYBODY who truly does not “believe in science”? We should all be able to acknowledge some of the accomplishments of science - including each of us having access to things like computers and the internet. Or refrigerators, air conditioning, cars, phones, television, etc.\nBut many people are deeply skeptical of certain scientific concepts, such as evolution, climate change, and even the Earth being round instead of flat.\nPeople who harbor such deep doubts about certain scientific conclusions almost universally come from the ranks of religious people. Belief in at least one god tends to be correlated with skepticism about science, and lack of belief in any gods tends to be correlated with high confidence in scientific conclusions.",
      "2": "Belief in science is not the same as belief in gods (remember there’s more gods that your favorite deity).\nI have belief in science because it’s a proven system for finding answers to questions. Plus if those answers are shown to be incorrection then they’re adjusted or even discarded. Science is based on evidence.\nBelief in gods is based on wishful thinking and blind acceptance of what other people say. Evidence doesn’t enter into the process. If someone disagrees with some religious position, they’re denounced as heretics.\nEvery year there’s lists of the top tend science discoveries. But there’s never a list of the top ten religious discoveries.",
      "3": "Being uneducated and ignorant of science doesn’t seem to hurt someone’s religious beliefs.\nYou’re trying to create a false equivalency. You desperately want to believe your religion is true, despite the complete absence of any evidence.\nThe evidence that our understanding of the world through science is correct is everywhere. No belief required.",
      "4": "Belief in science and belief in a god are two separate concepts that do not necessarily depend on each other. Some individuals who believe in a god also accept the scientific understanding of the world and see scientific knowledge as complementary to their spiritual beliefs. Others may have religious beliefs that do not align with certain scientific theories or explanations. Ultimately, the relationship between science and belief in a god is a personal one, and it varies among individuals.",
      "5": "You don't “believe” in science. It's not a religion or spiritual phenomenon. It's a discipline of study and research. You can believe in a god if you wish but if you do you must recognise science as the means of learning how God's continuing creation works, and not deny science.",
      "6": "Belief in Allah is a fundamental aspect of Islam. While Islam encourages the pursuits of knowledge and appreciates scientific discoveries. One can have faith in Allah without fully embracing science. Faith in Allah is a separate and fundamental aspect.\n“Allah will elevate those of you who are faithful, and ˹raise˺ those gifted with knowledge in rank. And Allah is All-Aware of what you do’. (Quran 58:11)\nmuslimandquran.com",
      "7": "All that’s “required” for a belief in a Supreme Being is, literally, a leap of faith. That’s what a belief is about. There’s no logic, rational thought or ones ability to reason associated with it. Throw all of that out the window. When you do, there’s then sufficient room for ones “belief” & “faith” to take root.\nLogic, rational thought & ones ability to reason are the tools required to successfully navigate oneself through THIS plane of existence. They’ll do you no good & serve no purpose in the world of faith & belief other than to confuse one.",
      "8": "Nope - in fact, it's probably a lot easier if you don't believe in science. That may set up a conflict with your faith in God. It doesn't have to - but many people think it does."
    }
  },
  {
    "question_id": "https://www.quora.com/Which-image-deserves-10-000-000k-views",
    "title": "Which image deserves 10 000 000k views",
    "answers": {}
  },
  {
    "question_id": "https://www.quora.com/What-will-be-the-consequences-of-the-Palestine-and-Israel-war",
    "title": "What will be the consequences of the Palestine and Israel war",
    "answers": {
      "1": "All I know is Gaza is going to be severely destroyed once this 2023 war is over.\nCry about it all you want, but it won’t change reality.\nPeople can write books and articles and discuss about how Israel should have treated West Bank Palestinians better (they should, seeing as West Bankers do not support Hamas and actually want peace), how Palestinians should not have supported Hamas (they shouldn’t support Hamas), and how Hamas should not have struck a civilian festival in Israel (they shouldn’t).\nWhat happened has happened, and it is clockwork that if you kill one Israeli, they will come in and slaughter 10–20 Palestinians.\nI’ll see in a few weeks.",
      "2": "This round?\nIt’s duck season.\nThe Hamas will be physically annihilated. And I mean hunted down like animals (just a figure of speech… No intention of insulting animals)\nNothing short of this.\nThe Israeli people lost its patience.\nFar less Palestinians will get any services from Israel.\nThey will have to actually employ their own resources to build their infrastructure and not smooch it from Israel.\nPalestinian employees would be replaced by others, Chinese, Thai, Romanian, you name it. Israelis will be fine with that. At least those are not terror supporters.\nThe price the Palestinian people will pay would be dire and if they love their children, they will take this up with their so-called leadership and ask them where the money went…\nHow’s that for starters?",
      "3": "Many on both sides will die, they will some respite down the line, and then they will carry on where they left off.",
      "4": "It's not a war. It's between a few thousand terrorists and a sovereign state. It's a criminal action not a military action.",
      "5": "We can all hope that Israel turns the Gaza Strip into a smoking pile of rubble."
    }
  },
  {
    "question_id": "https://worldsknowledge.quora.com/Which-post-worth-more-than-4588812K-upvotes-and-Views-265",
    "title": "Which post worth more than 4588812K upvotes and Views 265",
    "answers": {}
  },
  {
    "question_id": "https://www.quora.com/What-images-deserve-8383k-upvotes",
    "title": "What images deserve 8383k upvotes",
    "answers": {
      "1": "Love",
      "2": "Do you remember Twitter bragging last year when Facebook, WhatsApp and Instagram was down?\nI guess karma is indeed a #####😊\nCheck out my Daily Dose of Twitter (Funny series) :\nhttps://instarlaxy.com/daily-dose-of-twitter-140722-twitter-experiences-worldwide-outage-trending-twitterdown/"
    }
  },
  {
    "question_id": "https://www.quora.com/Which-American-warship-suffered-the-most-combat-damage-in-World-War-Two-but-didn-t-sink",
    "title": "Which American warship suffered the most combat damage in World War Two but didn t sink",
    "answers": {
      "1": "That would likely be the USS Franklin.\nOn March 19, 1945, a short ways off the coast of the Japanese mainland conducting air raids, Franklin was set upon by a single plane, thought to be a Yokosuka D4Y “Judy” dive bomber, but possibly a B7A “Grace” attack bomber/torpedo plane. This lone plane came out of the cloud cover, made a low-level run, and dropped two 550lb bombs on Franklin’s deck, one hitting amidships, the second further aft on the flight deck. Having been in the middle of flight operations, with armed and fueled aircraft both on deck and in the hangars, the bombs caused a series of explosions and massive fires which engulfed almost the entire aft section of the ship.\nThe ship exploded and burned for hours as firefighting crews struggled to bring the blaze under control. Unable to flood the magazines, it was suggested to abandon ship but the captain, controversially, refused so long as they still had any firefighting ability. The tons of water used to fight the fires caused a 13 degree list to starboard, causing serious stability issues. Eventually the fires came under control as there was little left to burn, either thrown overboard, blown overboard in the explosions, or burned already. A tow was secured from the cruiser Pittsburgh while engineers made their way through gutted decks to the undamaged boilers and engines, and raised enough steam for Franklin to eventually restore enough power to limp away unassisted. Emergency repairs stabilized the ruined ship enough to where it could be sent back to Pearl Harbor for more repairs, and then back to the US mainland.\nThe casualties were horrendous - officially 724 dead and scores injured, and more recent reports suggest the death toll may have gone above 800, almost a third of her crew, by far the highest casualty count any US Navy warship suffered and lived. Many tales of bravery and suffering were told of those that survived that day, particularly her chaplain Joseph O’Callahan who helped organize firefighting parties as well as attend to his religious duties with the dead and dying (I believe he got a Medal of Honor for his exploits). Less commendably, her captain Leslie Gehres tried to courtmartial those who were blown overboard or jumped to escape the flames and explosions, but the charges were eventually dropped, and the misanthropic Gehres was sent to a shore assignment to serve out the rest of his career.\nThe Franklin was in time fully repaired, but never re-entered the war. Eventually, though thought was given to upgrading her to accommodate jet aircraft or other experimental designs, she was mothballed and eventually scrapped.\nSome honorable mentions:\nthe carrier USS Bunker Hill, which took two Kamikazes off of Okinawa during flight operations, resulting in major fires and explosions, suffering damage and casualties almost as severe as the Franklin.\nthe light cruiser USS Houston, which took two aerial torpedoes during the air Battle of Formosa and was severely flooded to an extent that no other ship ever survived, her decks nearly awash at both ends, yet she eventually made her way to port and home for repairs.\nthe destroyer USS Laffey took multiple bomb and Kamikaze hits off Okinawa in 1945, virtually resculpting the ship’s profile, yet was able to effect enough repairs to make it home. Covered in more detail in another answer by Andrew Warriner.\nthe heavy cruiser USS New Orleans, at the Battle of Tassafaronga in November 1942 off Guadalcanal, was hit by a single Type 93 (Long Lance) torpedo that set off her forward magazines, ripping away nearly a third of the ship forward of the #2 turret and killing everyone in that part of the ship. It is surmised that the only thing preventing her from sinking was the twisted compartments where her bow was sheared off acted as a spare bulkhead that minimized additional flooding. Despite this catastrophic damage she was towed away, fitted with a makeshift false bow, and able to make it back to the States for extensive repairs and eventually re-enter the war, participating in almost every major campaign from 1944 onwards without incurring any more significant damage.\nthe heavy cruiser USS Pensacola, also at the Battle of Tassafaronga, was maneuvering to avoid the stricken New Orleans and was hit amidships by a Type 93 torpedo that set her fuel oil stores on fire, which spread to her aft shell magazines. Inexplicably, instead of a single chain-reaction explosion which would’ve destroyed the ship, only the shells in the #3 turret lift detonated one at a time, causing some scary moments for damage control but not further compromising her survival. Despite fires and extensive flooding, she was towed out of the battle area and eventually made it home for repairs.\nthe light cruiser USS Boise, during the Battle of Cape Esperance in October 1942, was hit by an 8in shell that penetrated directly to the forward magazines, starting a deflagration which in seconds should’ve turned into a massive explosion that undoubtedly would’ve destroyed her had not a deluge of seawater, admitted by the shell and initial detonations, completely flooded the magazines and stopped the chain-reaction before all the stored ordnance and powder could detonate. As it was, all the forward turrets were burned out and destroyed, along with the entire crews manning them. Everyone present, including the captain, thought for sure the ship was doomed when they saw the front end go up in a huge fireball, yet Boise made it back to port and eventually home for repairs, to fight another day.",
      "2": "I didn’t notice this one mentioned in the other answers, but the USS Aaron Ward (DM-34) on radar picket duty off Okinawa in May, 1945 was hit by six kamikazes and survived.\nShe was temporarily repaired and made it back to the United States under her own power, passing through the Panama Canal and arriving in New York in mid August. She was sold for scrap in 1946.",
      "3": "Without a shadow of doubt the USS New Orleans. She had her bow completely blown off and had to sail in reverse to make it back to port.",
      "4": "The aircraft carrier USS Franklin is my nominee, among many worthwhile candidates, for the ship that suffered the most combat damage in World War II but didn’t sink.\nThe Franklin, nicknamed “Big Ben”, was special in other ways too. Her keel was laid on December 7, 1942, the first anniversary of the Japanese attack on Pearl Harbor. But before the war was over, she would have suffered more casualties than any ship except the USS Arizona - and certainly the most of any ship to survive.\nFather Joe O’Callahan of USS Franklin was the first Navy chaplain to be awarded the Medal of Honor. His utterly selfless leadership during the crisis was probably the primary factor that inspired the dazed and shocked young crew to save their ship. The full award citation is provided at the end of this post; if you read nothing else, read that.\nThe Newport News Shipbuilding yards in Virginia completed the 27,000 ton ship in just over two years - an extraordinary achievement, to be sure. But for a nation that regarded itself as fighting for its future, and that of the free world, against brutal and despotic foes on the other side of two ceans, extraordinary had become a way of life.\nThe fast fleet carrier USS Franklin in 1944, still shiny and new and under warranty following her commissioning on January 31, 1944. That would change soon.\nIt was quite a turnaround from isolationism, a ‘homer’ movement that had attempted to keep America uninvolved in foreign affairs, under the belief that what happened overseas did not concern America.\nJapan corrected that misapprehension at Pearl Harbor and America was at war.\nHowever, as Franklin’s rapid completion highlights, America was not as unprepared for war as it might have been, thanks to the friendship between the chief executives of the world’s leading democracies, Great Britain and America.\nAmerica’s policy of Lend-Lease led to an ever-increasing expansion of prewar arms production and primed the shipbuilding industry for what would shortly be the nation’s most intense struggle since the Civil War. Pictured is USS Franklin at her launch ceremony on October 14, 1943.\nGreat Britain’s First Lord of the Admiralty, Winston Churchill, reached out to American President Franklin D. Roosevelt early in the conflict and engaged him in Britain’s plight following the fall of France in 1940.\nChurchill’s message, essentially, was this; the British Empire and Commonwealth is standing alone against a brutal tyranny that aims to replace liberal democracy in the world. And if the Axis dictatorships subdue us, they will come for America next, with the resources of whole continents at their command.\nIn summer of 1941, Roosevelt and Churchill, now prime minister, met aboard the battleship HMS Prince of Wales off Newfoundland. The result of their meeting was the signing of the Atlantic Charter on August 10, formalising Roosevelt’s agreement to make America “the arsenal of democracy”.\nRoosevelt, receiving war reports from Churchill and exchanging staff with the British, needed little convincing to realise the threat presented by the onslaught of fascism. His challenge would be moving a reluctant nation - Yamamoto’s “sleeping giant” - to roll over, rub its eyes, and see the horrifying sights just outside the farmhouse window.\nOver the next couple years, press and film began bringing home to Americans scenes of the London Blitz, the Battle of Britain, the Battle of the Atlantic, and the exploits of British armour in North Africa. Roosevelt addressed the nation often on the struggle.\nAmerica’s familial relationship with its sister nation Canada, already in the fight against the Germans, drew attention to the Allied cause as well.\nCanada entered the war in 1939 and from a population of 12 million, had over a million men under arms by 1945. Had the Germans launched Operation Sea Lion to invade England, the Canadians would have been critical to the defence of the island, prompting Churchill to write\n, “The Canadian Army Corps stood most conveniently posted between London and Dover. Their bayonets were sharp, and their hearts were high. Proud would they have been to strike the decisive blow for Britain and Freedom.”\nThe dominion’s early entry in the war gave millions of Americans with cross-border ties of family and friendship a personal stake in supporting Roosevelt’s efforts to rally support for the Allies.\nAs sympathy for the British grew, Roosevelt thus gained the political purchase to begin the large-scale manufacture of arms under the policy of ‘lend-lease’. The arms built by American industry would go to help keep the forces of Britain and her Commonwealth allies in the fight.\nUSS Franklin and her 23 sister ships in the formidable Essex class were produced rapidly in part because American yards had already gone into high gear, supporting British and Canadian shipbuilding in readying naval vessels to fight the Battle of the Atlantic.\nHMS Chaser was an Attacker-class escort carrier built for the Royal Navy in Pascagoula, Mississippi, under lend-lease. American yards geared up for war production and had greatly expanded its skilled trades for carrier construction even before Pearl Harbor.\nFranklin departed Bremerton, Washington on February 2, 1945, following a period of repairs following battle damage taken during the Battle of Leyte Gulf.\nWhile operating off the Philippines on October 30, 1944, the carrier had been bloodied by a kamikaze during the Battle of Leyte Gulf; the suicide attacker put his plane through the flight deck, killing 56 men and wounding 60 more on the gallery deck below.\nFor the men on board, it was probably hard to imagine worse. But worse awaited.\nFranklin, following a Japanese attack on March 19, 1945 that killed a staggering 800 men. With the lone exception of the USS Arizona, Franklin suffered the most casualties of any ship in the history of the USN.\nAfter replenishing in Hawaii, Franklin proceeded to the western Pacific and on March 15 joined Task Group 58.2, making strikes against bases at Kagoshima and Izumi on the Japanese home island of Kyushu to prevent them from launching attacks against the invasion fleet.\nHowever, the Japanese tactic of crashing bomb-equipped aircraft on American shipping was now at its peak, and the United States Navy was taking heavy damage.\nBut the most successful Japanese counter-attack of the campaign was not a kamikaze, but an aircraft flown by a skilled pilot. Such men were in short supply in 1945 Japan owing to wartime attrition. But one dive bomber flown by a skilled pilot caught Franklin flat-footed, and only four days after her arrival in theatre.\nFranklin, listing heavily following the near-fatal bombing on March 19th.\nFranklin had manoeuvred to within 50 miles of the Japanese coast before dawn on the 19th, the closest approach to Japan of any carrier during the war.\nThe Japanese were aware of the task group and sent many aircraft after it. The crew had been called to action stations 12 times during a six-hour span during the night and had already sent a fighter sweep over Honshu and an attack against shipping in Kure Harbour.\nAircraft of Air Group 13 aboard USS Franklin in 1944. A carrier’s most vulnerable time is when its aircraft are being refueled and rearmed. It was during this action that Franklin was attacked in 1945.\nThe ship was halfway through getting another wave of strike aircraft airborne when a single Japanese dive bomber pierced the cloud cover and found the carrier below.\nThe plane planted two 550-pound semi-armour piercing bombs on the aft end of the flight deck, both exploding several decks down. There were 31 armed and fueled aircraft warming up at the time across the stern half of the ship where the bombs hit, and these quickly caught fire. An additional 21 aircraft in the hangar bay were in various stages of refuelling and rearming. In moments the ship was ablaze.\nOver 800 men were killed in the attack, and nearly 500 wounded - 1,300 cassualties from a complement of 2,600, or half the crew. The carrier would surely have been doomed but for the valour of the survivors, who didn’t know when to give up the ship.\nWith Franklin ablaze and taking on water, the cruisers Santa Fe and Pittsburgh and the destroyers Miller, Hickox, Hunt, and Marshall closed in to help fight the fires, keep the ship afloat, and rescue crewmen, hundreds of whom were trapped belowdecks. Several of the destroyers reportedly went to far as to put their bows against the ship to facilitate the transfer of wounded.\nMany sailors became legends that day for their heroic actions\n.\nAmong the dead was one of the ship's surgeons, LCDR George W. Fox, M.D., who was killed while tending to wounded sailors; he was awarded the Navy Cross posthumously. When totaling casualty figures for both Franklin cruises numbers increase to 924 killed in action, the worst for any surviving U.S. warship and second only to that of battleship USS Arizona. Certainly, the casualty figures would have far exceeded this number, but for the work of many survivors. Among these were the Medal of Honor recipients Lieutenant Commander Joseph T. O'Callahan, the warship's Catholic chaplain, who administered the last rites, organized and directed firefighting and rescue parties, and led men below to wet down magazines that threatened to explode; and also Lieutenant Junior Grade Donald A. Gary, who discovered 300 men trapped in a blackened mess compartment and, finding an exit, returned repeatedly to lead groups to safety. Gary later organized and led fire-fighting parties to battle fires on the hangar deck and entered the No. 3 fireroom to raise steam in one boiler.\nAll the men who remained aboard to fight the fires and work to save their shipmates were volunteers.\nWith hundreds of men trapped belowdecks in the nightmarish aftermath of the attack, surviving crew and accompanying USN ships managed to keep the ship from capsizing. Her dangerous 15-degree list to starboard was corrected by shifting ballast but resulted in an equally serious list to port. Finally restored to an even keel, the damaged ship began the long voyage home.\nWith Santa Fe pouring water on the fires, the ship experienced severe listing that threatened her stability. Both fires and list were corrected as Pittsburgh took Franklin under tow for the remainder of the daylight hours.\nOnce the fire had been controlled and stability restored, men were able to return to the carrier’s engineering spaces and got two of the four screws turning again. Now under her own steam, Franklin sailed to Ulithi Atoll at 14 knots for emergency repairs before proceeding to the West Coast.\nFrankln was then compelled to make for the Panama Canal en route to the Brooklyn Navy Yard, sailing up the East Coast because all of the West Coast dockyards were already full, repairing the many ships that had also suffered damage in the savage months leading up to the unconditional surrender of Japan.\nFranklin (lower right) undergoing repairs at the Brooklyn Navy Yard in 1945. Although rapidly repaired, she never returned to service and was decommissioned in 1947, stricken from the Naval Vessel Register in 1959, and scrapped in 1966.\nThere has been much controversy around the ship’s commander, Captain Leslie Gehres, who was regarded by many who served under him, and many more who didn’t, as an overly demanding autocrat.\nCaptain Gehres was commanding officer of the aircraft carrier USS Franklin, ‘where his leadership tenure has been seen as a \"a cautionary tale about the scourge of 'toxic leadership.'\n\"\nOn the ship’s arrival at Pearl Harbor, Gehres declined the usual procedure of a civilian harbour pilot guiding the carrier to the dock, deciding to “taker her in” himself. He brought her in too fast and crashed her into a dock\n, afterwards blaming the incident on the mooring details.\nFranklin’s battle damage is clearly visible en route to the US (top) and following arrival at the Brooklyn Navy Yard (bottom). Unfortunately, as so often happens in real-life stories, there was some additional damage not so clearly visible.\nLater, Gehres made outrageous accusations of desertion against many sailors who jumped from the burning flight deck and were rescued by destroyers, despite their having done so to prevent a likely death by fire\n. In addition to the main fire, there were roughly 120 secondary explosions of bombs and fuel tanks from the aircraft standing ready on deck; many of the so-called “deserters” had literally been blown from the deck\n.\nAccording to the 2011 documentary USS Franklin: Honor Restored, Gehres was universally excoriated for his leadership deficiencies and his tendency to blame his crew for the near loss of his ship. Several men, including wounded, who had been blown off the ship by its huge explosions were later refused re-entry onto the ship. Gehres threatened to court martial men who had been blown overboard, because they had not been given the order to abandon ship.\nThe Navy, presumably not wanting to air its dirty laundry at war’s end, quietly dismissed all of Gehres’ spiteful charges and personnel actions and put him firmly - and permanently - on dry land, where he commanded a desk until his retirement as a rear admiral.\nFor the record, the Navy rained awards upon the surviving crew\n.\nFor their valor is saving their ship, the crew of Franklin and personnel of Air Group FIVE were awarded two Medals of Honor, 19 Navy Crosses, 22 Silver Stars, 116 Bronze Stars, and 235 Letters of Commendation, along with 808 posthumous Purple Hearts and an additional 347 Purple Hearts to survivors.\nNot all the awards were restricted to Franklin\nherself, as “additional Navy Crosses and Silver Stars were awarded to some of the officers and crews of the Santa Fe and Miller”, both of which came daringly alongside to help save the ship.\nPerhaps the most remarkable of these awards went to Father Joseph T. O’Callahan, the first Navy chaplain to receive the Medal of Honor, after the personal intervention of President Harry Truman following public outcry over the political nature of the Navy’s awards process.\nChaplain O’Callahan was frequently cited by survivors for his inspiring leadership during the critical hours following the Japanese attack. A widespread impression over his Navy Cross, a lower-ranking award, was that he had been denied the Medal of Honor because it would have spotlighted the ineffective leadership of Captain Gehres, and reflect badly on the Navy. The merits of the charge led the President of the United States to intervene.\nChaplain O’Callahan performed heroically and tirelessly, inspiring the crew as he moved about the ship on dangerous duty, leading sailors with the white cross on his helmet.\nAlthough wounded by one of the explosions after the attack, Chaplain O'Callahan moved about the exposed and slanting flight deck, administering the last rites to the dying, comforting the wounded, and leading officers and crewmen into the flames to carry hot bombs and shells to the edge of the deck for jettisoning. He personally recruited a damage control party and led it into one of the main ammunition magazines to wet it down and prevent its exploding. For this action he received the Navy Cross, which he publicly refused (the only man to do so in World War II).\nO’Callahan’s refusal of the Navy Cross awakened broad interest in the service’s awards process. Why was this chaplain, who inspired the crew with his selfless leadership, only offered the same level of award as the ship’s captain, who was handed a perfunctory Navy Cross despite risking little as his men were dying?\nThe public outcry led to an astonishing result.\nAt the time, it was speculated that O'Callahan was offered the Navy Cross in lieu of the Medal of Honor since his heroic actions on USS Franklin highlighted perceived lapses in leadership by the ship's commanding officer, Captain Leslie E. Gehres, which reflected poorly on the Navy. President Harry Truman intervened after the resulting public outcry and the Medal of Honor was awarded to O'Callahan on January 23, 1946. He was the first Naval Chaplain so decorated.\nFinally, the Navy had a legitimate and nationally recognised hero.\nThe judgment of history has never varied;\n“the fight to save Franklin was probably the most epic feat of damage control in the history of the U.S. Navy, and the valor of the crew in saving their ship was truly extraordinary”.\nIN MEMORIAM\nThe full text of the official citation for the Medal of Honor awarded to Chaplain O’Callahan reads as follows; it seems a fitting tribute and remembrance to the entire crew of USS Franklin.\n“For conspicuous gallantry and intrepidity at the risk of his life above and beyond the call of duty while serving as chaplain on board the U.S.S. Franklin when that vessel was fiercely attacked by enemy Japanese aircraft during offensive operations near Kobe, Japan, on 19 March 1945. A valiant and forceful leader, calmly braving the perilous barriers of flame and twisted metal to aid his men and his ship, Lt. Comdr. O'Callahan groped his way through smoke-filled corridors to the open flight deck and into the midst of violently exploding bombs, shells, rockets, and other armament. With the ship rocked by incessant explosions, with debris and fragments raining down and fires raging in ever-increasing fury, he ministered to the wounded and dying, comforting and encouraging men of all faiths; he organized and led firefighting crews into the blazing inferno on the flight deck; he directed the jettisoning of live ammunition and the flooding of the magazine; he manned a hose to cool hot, armed bombs rolling dangerously on the listing deck, continuing his efforts, despite searing, suffocating smoke which forced men to fall back gasping and imperiled others who replaced them. Serving with courage, fortitude, and deep spiritual strength, Lt. Cmdr. O'Callahan inspired the gallant officers and men of the Franklin to fight heroically and with profound faith in the face of almost certain death and to return their stricken ship to port.”",
      "5": "Two come to mind. The U.S.S. Franklin (CV-13) and U.S.S. Houston (CL-81). The Franklin was badly damaged but was able to get to raise steam and made it back to the U.S. under her own power for repairs.\nHouston took a torpedo amidships that damaged all four machinery spaces that rendered them useless. She was towed to Ulithi where she was partially dewartered, then towed to Manus where she was completely dewatered, had her hull patched, and two of her engines repaired so she could get home under her own power. Her keel was cracked and several of her main longitudinal beams severely distorted. She was repaired and returned to the fleet after the war. If you are interested, the book “The Battle to Save the Houston” details her story from launching to her return to New York for rebuilding. I highly recommend reading it.",
      "6": "USS New Orleans took a rather nasty blow:\nNote that there were TWO turrets forward of the bridge when New Orleans was commissioned into the US Navy, but after the battle of Tassafaronga one was, ahem, missing in action.\nSo that’s one candidate.\nAnother is the USS South Dakota, which took somewhere between 26 - 42 shell hits from the Battleship Kirishima at the Second Battle of Guadalcanal.\nSo that’s another candidate.\nBut, really, USS Franklin must take the “prize”. Over 800 dead, and the ship gutted by flame.",
      "7": "Two additional worth of consideration\nUSS Aaron Ward, DD773, after 4 kamikaze hits and additional bomb hits, Picket Station 16, Okinawa.\nUSS Minneapolis, after Tassafronga.\nEvery battle in the Slot around Guadalcanal demonstrated the power of the Long Lance torpedo. Several time, the US sprung the trap and should have decimated the IJN destroyers, but the torpedos changed the course of the action.",
      "8": "The USS Laffey deserves to be mentioned.\nOn April 16, 1945, the Laffey and the landing craft LCS-51 were north of Okinawa on radar picket duty, stationed some distance from the fleet to provide early warning of kamikaze attacks. It was extremely hazardous duty: the pickets themselves often became targets for the kamikazes.\nAt 7:44, the Laffey spotted a Val dive bomber scouting for targets and drove it off with 5 inch gunfire.\nAt 8:29, the Laffey's radar picked up a wave of over fifty kamikazes approaching.\nThe Laffey and LCS-51 would spend the next hour and a half fighting off 22 kamikaze attacks.\nKamikazes 1 - 4: four Val dive bombers broke off from the formation and attacked the Laffey from the starboard bow and the stern. The two Vals attacking on the bow were destroyed by Laffey's 5 inch guns. The two Vals attacking from astern were dispatched by Laffey's and LCS-51's 20mm and 40mm guns.\nKamikazes 5 - 6: two Judy bombers attacked the Laffey from starboard side. Both were destroyed by Laffey's guns but one Judy dropped a bomb that scored a near miss on Laffey, wounding three.\nKamikazes 7 - 8: a Val and a Judy attacked Laffey from the port and starboard. Laffey shot down the Judy, but the Val approaching from astern clipped the after deckhouse, doused the Laffey's stern with burning aviation gasoline and crashed alongside Laffey. The Laffey's crew put out the fire by 8:42.\nKamikaze 9: a Val hit the Laffey’s after deckhouse, killing three sailors manning a 20mm gun and igniting another fire.\nKamikaze 10: another Val approaching from astern was concealed by smoke Laffey's fires crashed amidships starting more fires.\nKamikaze 11: another Val attacked from astern, and though damaged by Laffey's guns, crashed into the aft twin 5 inch gun turret, detonating the turret's ammunition.\nThe Laffey’s aft 5 inch gun turret\nNow 8:47, the Laffey's stern was on fire and the ship's high speed was fanning the flames. Laffey's captain, Commander Frederick Becton, reduced speed.\nKamikaze 12: Laffey shot down a Val approaching from starboard but its bomb scored a near miss and jammed Laffey's rudders in a 26 degree turn to port.\nLaffey wasn't entirely alone. A flight of four Wildcats from the USS Shamrock Bay were overhead and shot down six kamikazes before returning when their ammunition was exhausted and running low on fuel. A flight of 12 Corsairs arrived when the Wildcats departed.\nKamikazes 13 - 14: both kamikazes hit Laffey. Laffey lost power to her forward 5 inch guns and only four 20mm guns were working. A second flight of 12 Corsairs joined the fight over the Laffey.\nKamikazes 15 - 16: A Val was shot down in its attack run on Laffey by a Corsair who engaged a second incoming Val. The Val overshot the Laffey and crashed in the sea but the Corsair hit the Laffey's radar antenna and ditched. LCS-51 rescued the pilot.\nKamikazes 17 - 20: At 9:34, the Laffey was joined by the destroyer USS Bryant. Bryant shot down three kamikazes but the fourth hit Bryant's superstructure, killing 34 and wounding 30, knocking out Bryant's radios and combat information center. Bryant departed for Kerama Retto.\nKamikaze 21: A Val dived on Laffey and hit the port 20mm gun battery with a bomb.\nKamikaze 22: A Val diving on Laffey was shot down by LCS-51.\nUSS Laffey after the attacks.\nThe Laffey suffered 31 killed and 72 crew wounded in the attack.\nLaffey made it to Kerama Retto for emergency repairs and sailed for Seattle for further repairs. The war ended before Laffey was repaired.\nThe Laffey is now a museum ship at Charleston, South Carolina: Tour & Explore USS LAFFEY Destroyer\n.",
      "9": "USS Enterprise (CV-6) was known as the ‘Grey Ghost’ because the IJN believed up to 3 times that she was sunk. As one of three pre-war carriers to survive World War 2. She had fought in nearly every naval battle in the Pacific. Four of which are against the IJN’s own formidable fleet carriers. During these battles, she had taken quite a bit of damage. This is a quick summary of when and how she was damaged.\nFebruary 1 1942 a near miss from a G4M (or G3M) Bomber.\nDuring the Battle of the Eastern Solomons. Enterprise had taken 3 bomb hits and a damaging near miss.\nBattle of Santa Cruz. Enterprise was hit twice and had two near misses that caused flooding. The forward bomb hit jammed the forward elevator. This was not repaired until after the Naval Battle of Guadalcanal.\nMarch 18 1945. Dud bomb dented the forward elevator.\nMarch 20 1945. Friendly fire from Anti-Aircraft rounds.\nApril 11 1945. Two near misses from Kamikazes.\nMay 14 1945. Kamikaze crashed into the flight deck and blew up the forward elevator.",
      "10": "Lots of good answers here, I’ll toss another in the mix:\nUSS Newcomb. Fletcher destroyer. Picture taken after receiving 5 Kamikaze hits. Surviv...",
      "11": "If you want the most combat damage meted out and suffered before sinking you might check out the USS Johnston (DD-557)\nwhich deserves credit (or not) for single handedly turning the Battle of Samar from a disaster to an American victory. She brashly turned into a force of battleships and cruisers firing guns and torpedoes at everything in sight and taking hits for nearly three hours from 7 AM to 9:45 AM before finally sinking and taking Commander Ernst Evans who had his uniform and some fingers blown off down with his ship.\nYes, you’d think a mighty battleship like Yamato should be able to squash a destroyer like Johnston like a bug from 25 miles away but their manual gun computers could only hit one battleship sailing in a straight line from another one on a straight course, and could not hit a manuevering target steering at splashes until she was in range of torpedoes and radar directed 5 in guns and few appreciate how remarkable in a fight like this a little destroyer can keep fighting a losing battle for 3 hours, and the Japanese never figured out they were dealing with tiny Jeep carriers and destroyers and not Halsey’s fast carrier fleet until they heard a open call for help and realized the real fleet was on its way.\nDestroyer Escort Samuel B Roberts deserves 2nd place recognition for slugging it out with a cruiser with only two 5 in manually aimed guns. The fact that big guns are completely useless against destroyers which can be armed with missiles is why we still have destroyers but no big gun battleships today, not because the carrier made them obsolete.\nNo ships named for Evans or Johnston or Roberts were replaced when they went out of service, and no ship was ever named for Gambier Bay which was the carrier sunk by gunfire as the sacrifice straggler of the formation.",
      "12": "Certainly cruiser Birmingham took three hard hits, one of them during an attempt to assist a burning carrier, but survived triumphantly. Then there’s USS Intrepid, an Essex-class carrier hit so often (torpedo, kamikazes) the she was sometimes called “the Evil I”.",
      "13": "USS Curtiss (AV 4j a seaplane tender was hit by at Pearl Harbor. Repaired, and patrolled the pacific. At Okinawa on June 21, 1945 was hit by a Kamikaze. Two holes down to third deck explosion Lots of damage, 35 killed, 21 injured. Did not sink.\nMy paternal uncle, DRS, was chief boatswain’s mate. Awarded 5 battle ribbons while serving aboard Curtiss.\n^ USS Curtiss after Pearl Harbor. Wiki images.^\nhttps://web.archive.org/web/20051109225931/http://www.dcfp.navy.mil/mc/museum/War_Damage/11.pdf\nCurtiss (AV-4)\n(AV-4: dp. 8,671; l. 527'4\nhttps://www.history.navy.mil/research/histories/ship-histories/danfs/c/curtiss-av-4.html",
      "14": "The post is about warships - though frequently overlooked - the courage of our merchant marines during conflicts is often over looked - yet they sailed through the same dangers as our navies, more-often-than-not, without the satisfaction of massed anti aircraft armament.\nI would like to add an Honourable Mention for the merhantman, S.S.Ohio. A modern, welded hull tanker built for Texaco in 1940.\nRequisitioned by the British in May 1942 (under Lend Lease), under rather controversial conditions, the fuels carried in this ship probably saved Malta with the fuels it (eventually), delivered, awash and, had she not been so well designed and built, would - no, should - have been sunk.\nRather than make a long post I include a link to the Wikipedia entry, that is expansive and thorough.\n(photo from the Wiki article)\nSS Ohio - Wikipedia\nWell built - well manned ….. well done.",
      "15": "I gotta go with USS Laffey (DD-724).\nUSS Laffey (DD-724) - Wikipedia\nAllen M. Sumner-class destroyer For other ships with the same name, see USS Laffey . USS Laffey (DD-724) is an Allen M. Sumner -class destroyer , which was constructed during World War II , laid down and launched in 1943, and commissioned in February 1944. The ship earned the nickname \"The Ship That Would Not Die\" for her exploits during the D-Day invasion and the Battle of Okinawa when she successfully withstood a determined assault by conventional bombers and the most unrelenting kamikaze air attack in history. Today, Laffey is a U.S. National Historic Landmark and is preserved as a museum ship at Patriots Point , outside Charleston, South Carolina . [4] Laffey was the second ship of the United States Navy to be named for Bartlett Laffey . Seaman Laffey was awarded the Medal of Honor for his stand against Confederate forces on 5 March 1864. [5] Construction and commission [ edit ] Laffey's keel was laid down on 28 June 1943 by Bath Iron Works Corp., Bath, Maine ; launched on 21 November; sponsored by Ms. Beatrice F. Laffey, daughter of Seaman Laffey; and commissioned on 8 February 1944, with Commander Frederick Becton in command. Service history [ edit ] World War II [ edit ] Upon completion of underway training, Laffey visited Washington Navy Yard for one day and departed on 28 February 1944, arriving in Bermuda on 4 March. She returned briefly to Naval Station Norfolk , where she served as a school ship , then headed for New York City to join the screen of a convoy escort bound for England on 14 May. Refueling at Greenock, Scotland , the ship continued on to Plymouth , England, arriving on 27 May. Laffey immediately prepared for the invasion of France . On 3 June, she headed for the Normandy beaches escorting tugs , landing craft, and two Dutch gunboats . The group arrived in the assault area, off Utah beach , Baie de la Seine , France, at dawn on D-Day, 6 June 1944. On 6–7 June, Laffey screened to seaward, and on 8–9 June, she successfully bombarded gun emplacements. Leaving the screen temporarily, Laffey raced to Plymouth to replenish and returned to the coast of Normandy the next day. On 12 June, pursuing enemy E-boats that had torpedoed the destroyer Nelson , Laffey broke up their tight formation, preventing further attacks. Screening duties completed, Laffey returned to England, arriving at Portsmouth on 22 June, where she tied up alongside the battleship Nevada . On 25 June, she got underway with the battleship to join Bombardment Group 2 shelling the formidable defenses at Cherbourg-Octeville . Upon reaching the bombardment area, the group was taken under fire by shore batteries; destroyers Barton and O'Brien were hit. Laffey was hit above the waterline by a ricocheting shell, but it failed to explode and did little damage. Late that day, the bombardment group retired and headed for Northern Ireland , arriving at Belfast on 1 July 1944. She sailed with Destroyer Division 119 ( DesDiv 119) three days later for home, arriving at Boston o\nhttps://en.wikipedia.org/wiki/USS_Laffey_(DD-724)\n4 bombs and 6 Kamikazes and she didn’t got down. And you can still visit her today in Charleston.",
      "16": "My vote goes to CV13 - USS Franklin USS Franklin (CV-13) - Wikipedia",
      "17": "Ok its British and ww1 hms Zulu and Nubian were so damaged but at different ends so they were joined to make the Zubian who went on to sink a sub\nThe Nulu was scrapped\nTrue story",
      "18": "USS Newcomb, DD-586, 8 battle stars, was hit by 5 Kamikazes, 18 killed, 25 missing, fought off the remaining attackers, and spent weeks being reinforced under repeated arial attacks to be able to steam under her own power to the west coast for major repairs.",
      "19": "USS Lexington (the first one, BC conversion) - which the Japanese thought they had sunk 2 or 3 times.\nShe became known as “the Grey Ghost” as a result….\nFranklin can argue the point though.",
      "20": "There were two which were severely damaged, and both were subsequently sunk by the US Navy: the carriers Lexington and Hornet.\nMH"
    }
  },
  {
    "question_id": "https://www.quora.com/Does-Ukraine-have-a-right-to-destroy-the-Crimean-bridge-since-according-to-the-international-law-Crimea-is-part-of-Ukraine",
    "title": "Does Ukraine have a right to destroy the Crimean bridge since according to the international law Crimea is part of Ukraine",
    "answers": {
      "1": "Ukraine has the right to destroy any infrastructure within Ukraine or Russia.\nThere’s a war going on, if you didn’t notice\nIt doesn’t matter if the Kerch strait bridge is in Russia, Ukraine, or partially in both. It’s a bridge vital to a war effort and Ukraine is fighting a defensive war. There is no legal, ethical or moral dilema, Ukraine has the right to destroy it. This is true even if there are civilians on the bridge, it’s up to Russia to make sure civilians don’t use vital military infrastructure during wartime.\nYep, it sucks to be a civilian in wartime, but such is the reality of war.",
      "2": "Russia declared war on Ukraine. Ukraine can take whatever step necessary to defend itself and drive the invaders out, so long as they do not contravene the Geneva Convention. Bridges are usually the first infrastructures to go in a war.\nTaking out the Crimean Bridge would be acceptable. It would prevent Russia from reinforcing its troops by that route.\nAfter Russia is driven out of Crimea, if I am Ukraine, I am not sure I would want a bridge connecting to Russia. Destroying the bridge would be a defensive measure against future invasions.",
      "3": "Q: Does Ukraine have a right to destroy the Crimean bridge since according to the international law, Crimea is part of Ukraine?\nA: Do you mean the Kerch bridge which connects Crimea to mainland Russia? If so, it would be perfectly permissible. Remember, even if Russia has not declared war yet, Russia has de facto invaded Ukraine. That makes military targets fair targets, so Ukraine can blow up any military target they can reach, including bridges.",
      "4": "There’s a war going on. Russia is transporting war material on the bridge; hence, it is a legitimate target.\nWhether Crimea is part of Ukraine has no real bearing on this. Ukraine has the right by international law to attack absolutely any target inside Ukraine or Russia that is used for the Russian war effort, except of course hospitals where war casualties are treated.",
      "5": "“Crimea is part of Ukraine” doesn’t have anything to do with it. Per the Geneva Conventions, any infrastructure that is being used for military purposes is a legitimate target during wartime.\nA school, for example, should not be targeted under normal circumstances. Put an artillery battery in the schoolyard, though, and any expectation of protected status is forfeit. Same with hospitals, places of worship, etc. Basically the idea is you can’t have it both ways - both sides in a conflict are expected to respect protected status, and both sides are expected not to abuse it.\nThe Kerch Strait Bridge is a major rail and wheeled traffic artery into Crimea, which is an active war zone. The Russians routinely use it to move vehicles and supplies to the front. Russian claims that it’s “purely civilian” are transparent nonsense, and the fact that the government is actively encouraging civilians to travel there makes them culpable for placing civilians in harm’s way.",
      "6": "Ukraine is in a defensive war against an aggressive Russia.\nIn a war all resources that are part of the war-effort are legitimate targets. The Crimean bridge is an important part of the logistics of the Russian war-effort, and as such an entirely legitimate target.\nWhere the bridge is located isn’t really of much relevance — it could be in the middle of Russia, and it’d still be a valid target.",
      "7": "Ukraine is at war and as such, has every right to destroy infrastructure in the hands of its enemy,, regardless of where it is located. Bridges under Russian control are valid targets, since they can be used to help the Russian war effort.\nIf Ukraine wants to blow that bridge, or even if Ukraine wants to blow the hell out of an arms depot in Belgorod, or even in Moscow, they have every right. I have no idea what “international law” says about the matter, but every nation has the right to exist and to defend its existence by whatever means necessary. Russia has conducted military operations well beyond any validly disputed territories and has called into question Ukraine’s right to be an independent, sovereign state. That makes this a struggle for Ukraine’s national existence, and in my book, allows them to say to hell with what any “international law” says.",
      "8": "Q: Does Ukraine have a right to destroy the Crimean bridge since according to the international law, Crimea is part of Ukraine?\nOf course. That is precisely why it has every right to destroy that bridge.\nThat bridge was not build by Ukrainians; it was built on Ukrainian soil without Ukrainian approval. That bridge is in a war zone, thanks to its builders. That bridge is used/can be used to support the ongoing war against Ukraine, so Ukraine has every right to take it down. Unlike residential areas, theatres, hospitals, malls, restaurants, train stations… bridges, railroads and roads are fair game in such circumstances as the one Ukraine is in.",
      "9": "Ukraine is at war with Russia. I see mentioned in the news about the 2 parents who died and one child injured in the attack. Yet I don't see mention of all the civilians deliberately murdered by Russia, hospitals , shopping centres and playgrounds hit. Trains stations hit with cluster bombs full off people leaving Ukrainian.\nWhy not just lost the shear number of war crimes Russia has committed next to this article?",
      "10": "Sergei, you must think your target audience is really stupid.\nCrimea is part of the Ukraine, so the Ukraine has the right to blow up a bridge in the Ukraine up to stop Russia from taking even more of the Ukraine.\nAccording to “interntional law” Russia does not have the right to invade the Ukraine or take territory of the Ukraine. The Ukraine has the right to blow up their own bridge, and Russia has no right to either object to it to try to stop it.\nAccording to “international law” even if the Crimean bridge connected the Ukraine to Russian territory, the Ukraine still has a right to blow up that bridge in wartime.\nIt is a war, a war started by the Russian government you work for, Sergei, and the Ukraine now has the right to bomb your house and kill everyone in your family, as “collateral damage”.\nAfter all, that is what your government is doing to the people of the Ukraine.\nBut as I said, you must think your target audience is really stupid. So please do us all a favour. Go tell the evil people you work for that Crimea is part of the Ukraine.\nPlease. Do us all a favour, and tell them the truth. You have had far too much practice telling us lies for your own good. It has made you think we can be really, really stupid.",
      "11": "According to international law, the Crimea is part of the Ukraine. Russia even said so, firstly in 1954, and again in 1991.",
      "12": "Does Russia have the right to destroy civilian apartment buildings, hospitals, schools and children’s playgrounds in Ukraine? These targets seem to be against every international law, not to mention the laws of human decency.",
      "13": "ukraine has the right to destroy anything between lvov and their soon to be recognized border with china.",
      "14": "Crimea was stolen from Ukraine 🇺🇦 and will be taking back soon I don’t think just because mr poo 💩 poo says it part of Russia that it’s international law LOL. that’s a joke coming from a clown 🤡 poo poo the clown !",
      "15": "It doesn’t matter what the status of Crimea is.\nUkraine and Russia are at war. Both sides are perfectly in their right to blow up roads, railroads, ferries and ships bringing equipment, troops and provisions to the front.\nThe Kerch bridge is a road and a railroad doing just that. Russia is using Crimea as a secondary gateway into Ukraine and Ukraine of course wants to cut it off.",
      "16": "Ukraine has the right to take the fight back to Russian Soil if they feel that’s needed to stop the Russian aggression.\nThat’s what the allies did during WW2 after all. The landing in Normanide and then the push towards and into Germany. Soviet pushed in from the east.\nIf the aggressor in a conflict isn’t going to stop said conflict then you are in the full right to make them stop. If that means you push them out of your country, but have to keep attacking their country to get the message across you do so.\nMake no mistake here: Russia is the aggressor, if Russia hadn’t attacked none of this would have happened. If they end up getting their shit destroyed because of it they only have themselves to blame!",
      "17": "Russia is waging war on Ukraine. Ukraine has the right to defend itself. Critical military infrastructure is a primary target. The Kerch Bridge is one of the main supply routes for the Russian war effort.\nUkraine has, of course, the right to destroy this Bridge.",
      "18": "I’m not sure what authority you are looking to for granting of such a right, but the aphorism “All is fair in love and war” certainly should apply to the defenders in a war of aggression. The Ukrainians can, should, and most likely will, blow up anything they feel will work to hinder, hurt, or defeat the Russians.\nThe Ukrainians haven’t been too concerned so far about asking permission, and I don’t think they’ll start after months of having the Russians repeatedly bomb every civilian target they could hit, including apartment buildings, schools, hospitals, water, sewer, and power infrastructure.\nCutting off the Sebastopol base from Mother Russia’s re-supply would seem to be more than appropriate.",
      "19": "Since they were invaded by Russia they have the right to destroy anything which could reasonably be considered a Russian military asset.",
      "20": "Ukraine has been attacked. They have every right to fight back.\nYes, Crimea is part of Ukraine. But that doesn’t even matter. If the Russians were using a bridge in Russia to move military equipment and personnel into Ukraine, then Ukraine would be entirely justified in taking that out, too, if they had the capacity to do it. Similarly, if they were to hit other Russian targets in Russia (fuel and ammunition depots, repair facilities, etc.), 100% OK.\nYou can’t start a war, and then complain when the other guy shoots back.",
      "21": "The Kerch bridge is part of Russia’s military supply lines, and as such it is a legitimate military target for Ukraine.\nThere really isn’t anything else to it than that. Anything or anyone in Russia responsible for getting military supplies to Russias frontline troops is easily defensible as a legitimate military target.",
      "22": "Ukraine is under attack by Russia so, even if for whatever reason Crimea wasn’t part of Ukraine, they would have a right to strike any militarily relevant targets inside Russia (which they occasionally did).",
      "23": "Of course they can, I always thought it would make a nice pier for the Russians, a monument to Putin’s folly.\nIn fact Putin’s Pier has a nice ring to it.",
      "24": "They should blow it the eff up as soon as possible. Cutting off Crimea from Russia will hasten Ukraine’s ability to recover their stolen territory.",
      "25": "In other words:\n“Does Ukraine have the right to destroy its own bridge?”\nYes. The answer would be yes.",
      "26": "Of course. The bridge is strategical infrastructure object. The first target of any army except for russian. russians target civilian objects.",
      "27": "Yes. The only question is whether they allow the Russisns to retreat first.",
      "28": "Ukraine is justified under international law to blow up bridges in Siberia should it feel the need to do so, let alone those on its own territory. As long as any such action meets the basic standards of proportionality and discrimination, then it’s fair game.",
      "29": "Right? does Russian have a right to invade? War isn’t about rights, it’s about winning. The so-called laws of war are only an attempt to curb unnecessary death and destruction. Only the victors can prosecute for violations.",
      "30": "I'm not an expert for war law, but Russia has attacked Ukraine.\nThe way I see it, this means that Ukraine could target anything with “military interest\" not just in Ukraine (their country, who can forbid it?) but also in Russia.",
      "31": "What international law? The one Russia is currently violating?",
      "32": "Absolutely…and they would have that right even if the Bridge went from Russian territory to other Russian territory…as it is being used to support the Russian invasion of Ukraine…which makes it a legitimate military target! Bridges have always been considered legitimate military targets…so the Ukrainians should either bomb it…or hit it with missiles…preferably when there are Russian military assets, like supply trucks, on it!",
      "33": "It will make good scrap metal to feed the furnaces of the rebuilt Azovastal plant. Ukraine can feed its economic postwar recovery by beating plowshares into swords.",
      "34": "Ukraine has a right to destroy anything related to russian military including factories making buttons for their uniform. It’s not a question of right but of capability",
      "35": "Do you mean, can Ukraine destroy a bridge which is part of the Ukraine.\nYes!",
      "36": "Under international law, does Russia have a “right” to invade a neighboring peace loving sovereign nation, and then try reduce it into a smoldering ruin?\nIn defending one’s freedom from aggression is the Ukraine right in international law that it is fighting a great patriotic war in its own defense? As to the question, it has every right to defend its self from, and impede an invasion.",
      "37": "If Russia ask for permission to build a bridge up to Ukrainian soil and Ukraine was okay with it – then no.\nElse it is an Ukrainian bridge and they can do whatever they want with it. I mean – it’s theirs!",
      "38": "Since Russia is firing missiles into Ukrainian cities and murdered tens of thousands of their civilians, Ukraine would be well within its rights to bomb and fire missiles into Russian cities. Or attack any infrastructure within Russia. Probably not a good idea. Right now they hold the moral high ground, and almost the entire world supports them. But, they would be well justified.\nPersonally, I’ve wondered why they haven’t been firing missiles at the ships Russia has moored in Sevastopol. Nothing better than a target that isn’t moving. They would be doubly justified, because it’s their own territory. I always wondered why they didn’t sneak a special forces unit in by land and start launching missiles at those ships. Another option would be to put some of their missiles on these new “Metal Shark” Combat boats and strike at night. They could also use these to strike that bridge.\nU.S. Sending Metal Shark Maritime Combat Boats to Ukraine, Company Says - USNI News\nLouisiana-based company Metal Shark announced Tuesday that the U.S. would send six of its maritime combat vessels to Ukraine as part of the $450 million aid the White House announced last week. The White House said it would send 18 patrol boats to Ukraine as part of the latest assistance package, but would not identify […]\nhttps://news.usni.org/2022/06/28/u-s-sending-metal-shark-maritime-combat-boats-to-ukraine-company-says#:~:text=U.S.%20Sending%20Metal%20Shark%20Maritime%20Combat%20Boats%20to%20Ukraine%2C%20Company%20Says,-By%3A%20Heather%20Mongilio&text=Louisiana%2Dbased%20company%20Metal%20Shark,White%20House%20announced%20last%20week.",
      "39": "Yes, and they'd have just as much right to bomb a bridge or railroad inside Russia. However, they probably don't have the means.",
      "40": "Yes they have. Remember that Russia and Piutn illegally and unjustified attacked Ukraine, an independent and sovereign state, and is using that damn bridge to supply its invading, terrorist RF army. Moreover, Crimea, according to all international laws, treaties and the UN, is still legally part of Ukraine. Ukraine has the right to defend its territory and that Crimeea Bridge is used by Russian invading forces against Ukraine. Therefore, Ukrainian army is fully justified in destroying that Russian bridge, which, from the point of view of international laws and also from the legal point of view, is located on the legal, national territory of Ukraine.",
      "41": "Well since Crimea is part of Ukraine they are clearly allowed to blow up their own bridges.",
      "42": "If, as your question asserts, that according to International law Crimea is a part of Ukraine, (which I happen to agree with)… then logically the Bridge belongs to them.\nAs such it is their property and they can do with it as they wish…\nNow under normal circumstances they would be expected to dismantle any unwanted structure piece by piece and over a protracted period of time… but if they instead choose to blow it to smithereens, then that is their business!\nAny foreign military vehicles that happen to be illegally parked on “said” bridge during said period of deconstruction will therefore be summarily issued with a hefty fine and will be towed away to the bottom of the Azov sea! :)\nCheers!",
      "43": "I suspect that Ukraine expects that the bridge will be useful for Ukraine if and when the Russians are in full retreat. They clearly do not want Russian Soldiers as POWs as there may be quite a few. During WW2 Russia executed most POWs as they were difficult and costly to keep as prisioners.",
      "44": "There’s a war on.\nUkraine was attacked.\nIt has the right to hit any militarily important target.\nAlso, even if not at war, countries are at liberty to blow stuff up within their own borders, which, as you so correctly state, Crimea is.",
      "45": "Technically speaking “Crimean Bridge” is located on Ukrainian soil, since Crimea is regarded as part of the Ukraine by most of the world. So Ukraine can do whatever it wants with it…",
      "46": "If Crimea is a part of Ukraine, then the bridge is Ukrainian State property, so Ukraine can do whatever the hell it likes with it. If Crimea is not a part of Ukraine, then the bridge is a piece of strategic enemy infrastructure facilitating a Russian attack on Ukraine, and Ukraine has every justification for targeting it.",
      "47": "I think they'd have a right to destroy the bridge even if they considered it legitimate Russian territory. Russia is their enemy in a shooting war. Enemy infrastructure is a legitimate target under such circumstances, right?",
      "48": "Krimean bridge is half-built into Ukrainian territory, illegally, without permission from Ukraine.\nIt is also illegally blocking bigger ships from entering the sea of Kerch.\nI’ll ask you back: If someone without permission builds something on your lot, also partially blocking your road to your garage, are you allowed to destroy it?\nAlso, Ukraine is under Russian attack. So in order to defend itself, Ukraine has all the rights to destroy ANYTHING in Russia that is being used for military purposes. And that bridge is being used to supply the Russian occupation troops of Crimea and southern Ukraine, it is very clearly used for military purposes.\nSo, there are TWO very good reasons why Ukraine is allowed to destroy the bridge.",
      "49": "After the Russian invasion of Ukraine there is no more right or legality involved. Putin disabled any legality. The Russian annexion of Crimea can be seen equally as illegal. I think Ukraine can and should do what is needed for its protection.",
      "50": "Yes. They also have every right to attack that same bridge is it crossed the Ukraine/Russian border, since it is clearly a military target, being used by their invading enemy to move military goods, ammunition, fuel, and troops towards their fight"
    }
  },
  {
    "question_id": "https://www.quora.com/unanswered/How-does-the-use-of-technology-by-terrorists-change-the-dynamics-of-warfare",
    "title": "How does the use of technology by terrorists change the dynamics of warfare",
    "answers": {}
  },
  {
    "question_id": "https://www.quora.com/Why-do-Americans-eat-hamburgers-every-day",
    "title": "Why do Americans eat hamburgers every day",
    "answers": {
      "1": "We don’t. I’ve never met an American in my life that eats hamburgers every day.\nI’m sure they exist, but it’s not common. Most people I know burgers were maybe weekly, if not bi-weekly or even monthly. Stats seem to suggest that for the average American it’s slightly more than once a week, but given there are almost definitely a contingent that eat way too many throwing that off, more likely for most people it’s a bit less than once a week, which I’d say is pretty accurate to my experience growing up.",
      "2": "Because for many they are simple to make and very inexpensive. Plus if made right they can be very nutritional !!!",
      "3": "They don’t, although I had a friend decades ago who ate a burger for supper every night, since his mother always let him eat one regardless of what she prepared for supper for the family. As tasty as a burger can be, I can’t remember when I last had one. Most of my friends prefer Asian, Indian, or Tex-Mex, all of which are plentiful here in Houston.",
      "4": "It’s the only food in the entire country. If you walk into a grocery store, all of the isles are just filled with various burgers. There is no dairy section, just burgers. No snack section, just mini bite sized burgers. There are no pet supplies, just burgers. School supplies? Burger themed. Burgers? Burger. This is because this is an extremely religious practice and everyone who lives here is converted into eating hamburgers. Anyone who doesn’t eat 3 burgers a day goes to jail for 25 years where they are then force fed 5 burgers an hour.\nQuestions like these make me cackle. We do not.",
      "5": "American here, I eat a hamburger once a year or so. I do think Americans eat a crazy amount of meat every day though.",
      "6": "We do? I don’t. Maybe once every couple of weeks. So, am I just not American? What am I otherwise?",
      "7": "Well, there are 350 million Americans, and lots of hamburger joints …. it would be odd to have a day when at least a few million of them weren’t eating at least one burger meal…",
      "8": "I’m not sure where you heard about Americans and their diets but we don’t eat hamburgers every day. It’s tacos, we eat tacos every day.",
      "9": "Why do Americans eat hamburgers every day?",
      "10": "Why do Americans eat hamburgers every day?",
      "11": "Why do Americans eat hamburgers every day?",
      "12": "Why do Americans eat hamburgers every day?",
      "13": "Why do Americans eat hamburgers every day?",
      "14": "Why do Americans eat hamburgers every day?",
      "15": "Why do Americans eat hamburgers every day?",
      "16": "Why do Americans eat hamburgers every day?",
      "17": "Why do Americans eat hamburgers every day?",
      "18": "Why do Americans eat hamburgers every day?",
      "19": "Why do Americans eat hamburgers every day?",
      "20": "Why do Americans eat hamburgers every day?",
      "21": "Why do Americans eat hamburgers every day?",
      "22": "Why do Americans eat hamburgers every day?",
      "23": "Why do the American eat hamburgers every day?",
      "24": "Why do Americans eat hamburgers every day?",
      "25": "Why do Americans eat hamburgers every day?",
      "26": "Why do Americans eat hamburgers every day?",
      "27": "Why do Americans eat hamburgers every day?",
      "28": "Why do Americans eat hamburgers every day?",
      "29": "Why do Americans eat hamburgers every day?",
      "30": "Why do Americans eat hamburgers every day?"
    }
  },
  {
    "question_id": "https://www.quora.com/What-are-some-hidden-space-images-or-screenshots-that-deserve-millions-of-views-and-likes",
    "title": "What are some hidden space images or screenshots that deserve millions of views and likes",
    "answers": {
      "1": "This is not a Normal Picture",
      "2": "This is beyond sad.",
      "3": "hehe😁😁",
      "4": "This picture made my day …!!",
      "5": "inspiration",
      "6": "Graceful Gods",
      "7": "Ye jhukega nahi sala ….",
      "8": "😂😂",
      "9": "These screenshots definitely deserve millions because they are teaching a big message of humanity to the society♥️♥️♥️",
      "10": "Spiral Town made with SD using control net.",
      "11": "Thank you :)",
      "12": "This is a real inspiration for women. Rani lakshmi bai",
      "13": "BATH TIME !",
      "14": "I have added 4 I hope this will help you",
      "15": "This is the my laptop screen …. Very well said",
      "16": "Here are they:\nThis little News Paper Hawker boy had later become the MOST LOVED and RESPECTED MAN of India . He was ABDUL KALAM,the erstwhile PRESIDENT OF INDIA\nABDUL KALAM\nMahatma Gandhi with Rabindranath Thakur.— a not seen before photo.\nA RAREcolorised PHOTO OF RAMAKRISHNA PARAMHANSA & MA SARADA DEVI.\nColorised close-up photo of VIR BHAGAT SINGH\nRare photo- MAHATMA GANDHI.\nThe FEARLESS QUEEN OF JHANSI in her real photo( controversy nevertheless) taken by the German photographer ,Hoffman.\nHer uncommon patriotic ardour had filled the hearts of millions of Indian freedom fighters with courage and patriotic fervours.\nShe still continues to inspire countless Indians\nPhoto source :Pinterest\nCourtesy:PINTERST",
      "17": "Click here:—)",
      "18": "Image : taj mahal hidden door ..\nThe Taj Mahal Everyone knows it is symbol of love but wait this symbol of love has many secrets inside . It is said that taj mahal have a door at its side which was made of wood but after some time it was constructed again of concrete . They don't let us to see there what's inside .\nIf 100 upvote comes I will reveal the answer😉🙌",
      "19": "THE MORE YOU SCROLL, THE MORE YOU LAUGH🤣🤣🤣🤣🤣🤣\n1.\n2.\n3.\nUPVOTE IF YOU LIKE (:",
      "20": "Bro right think.",
      "21": "More content view in follow my speces 👉\nRVCJ Media'",
      "22": "It is often said that those who excel brilliantly at a very young age or else make big sacrifices at such an age are inspired by close family members or relatives. This can be very clearly seen in the inspirational impact of several members of the extended family or joint family on Bhagat singh. However there was an additional factor at work here. Some of these members of his family also suffered",
      "23": "😁🤣",
      "24": "There are so many hidden image but one image which is clear to you is yourself.You can be a destroyer o creator.You can be a follower or a guru..You can do mistake but after doing mistake if you are able to bring changes in your attitude and never commit that mistake then you can see change in yourself and nothing will be hidden from u.",
      "25": "🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓\n🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓🤓",
      "26": "Corona duty staffs , nurses , doctors ambulance drivers around the world have worked tirelessly to fight this pandemic & made the world better place\nRest in peace to those who martyred saving billions🙏\nIt will be written as the greatest fight in 21st century to protect human lives from virus in history books\nNow focus on global warming, climate change , gun culture, war like issues to resolve it"
    }
  },
  {
    "question_id": "https://picturesworthsharing.quora.com/What-screenshot-deserves-2-0976k-likes-and-views",
    "title": "What screenshot deserves 2 0976k likes and views",
    "answers": {
      "1": "Ready to take your relationships to the next level and build deeper connections with those you care about?\nEVERYTHING YOU NEED is in my bio, a collection of game-changing resources that will transform the way you approach relationships and help you build lasting intimacy and trust.💕"
    }
  },
  {
    "question_id": "https://www.quora.com/When-was-the-last-time-you-cried-and-why-1",
    "title": "When was the last time you cried and why 1",
    "answers": {
      "1": "Yesterday actually. I was coming out of a store and I heard something behind me. When I looked back I saw a family behind me of two young girls, a mother, and father. They were white. The two girls were acting like monkeys and making monkey sounds. The mother and father were laughing. I got in my truck which was facing them and started it up. I really wasn't sure who the gestures were being directed at until they did it again just before getting in their car which was right in front of mine while looking at and laughing at me. I looked at the mother and father and, as the mother laughed, I looked at the father just to see if he actually saw and was okay with what they were doing. The smirking sneer on his face said everything. They meant for me to see that. To feel that. And although I have confronted racism and racist people before, I think it was the kids doing what they did that hurt me more than I had felt it before. The mere fact that kids had been taught that kind of nastiness and that it was being deliberately directed at me for no other reason than I'm black just brought immediate tears to my eyes. I couldn't even help it. I looked the other way so they wouldn't see me.",
      "2": "The last time i cried my heart out was when i saw my mother being viciously beaten by my father just because she bought me an expensive smartphone and kept it a secret from him . I was in 11th standard then. Never before i felt a strong feeling inside that i should go and rip off my fathers hands . Imagine the situation in which your mother is getting beaten , cursed all because of you and you not able to do a single thing as the gate was locked from the inside.\n5 years have passed. I can still feel my mother's cries echoing in my head all the time . Though my father had tried numerous times since then to beat her again , i have been her shield from that day onwards. I never leave my father and mother alone at a place , even if it is full of people. It was that day when i said to myself that boy, your crying days are over. As long as you cry your mother would never be safe even in her own house. Beleive me , i have never even shed a single drop of tear since then , whatever the situation may be . I guess they are all dried up now . That one incident changed my whole personality. I became less demanding and started having trust issues since then . The only persons important to me in the world is my brother and my mother . I even have decided not to marry until and unless i provide them with all the comforts of the world .\nDomestic violence is a curse for the society. No one can better understand it than me . I wished once to report my father to the police but then my mother always stops me saying that the family repuatation would be ruined . I just pray to god that my father should answer for all the pain he has inflicted on my mother since the time of marriage one day .",
      "3": "I'm crying now. Our baby is dying and my husband is in complete denial that she has stomach cancer of some kind.\nIt's been heartbreaking watching her the last week ,she wants to eat but cannot for some reason. I know she's dying a slow death. She's lost 10 lbs in 8 days.\nWe've been to the vet and I'm taking her to the emergency vet now for more tests.\nI'm inconsolable every time I lose a baby. I try so hard to be strong but this absolutely breaks me. Not sure how long she'll be with us but I've loved her for her 9 years on this earth.\nShe's our last girl of my husband's 8 Chows.\nUpdate:\nDawn lost her battle with stomach cancer yesterday Wed. November 22, 2017. Sadly once symptoms of stomach cancer are present it's always fatal. She's the 3rd Chow girl I've had that has gotten stomach cancer of some kind. I'm still crying as I write this. Thank you all so much for your support. It's meant a lot to me. God Bless",
      "4": "“When was the last time you cried and why?”\nRight now, as I’m writing this.\nMonday, May 30th, my best friend R was put to eternal sleep.\nWe met each other through motorcycling — we were both members of the BMW GS Club Nederland — when I went to a Ride Event and he was standing in the emergency lane after he ran out of gasoline for his Super G motorcycle.\nThis is my wife sitting on Super G while talking to R:\nSince SuperG had a smaller tank than his orange GS pictured above, he had miscalculated the amount of gasoline left to make it to the petrol station where the riders would meet and gas up before the Ride. So he rode pillion with me to get a gas tank with spare fuel that could take him to the other motorcyclists.\nIf that hadn’t happened, we probably never would’ve become friends — R was introverted and quiet and I probably wouldn’t have noticed him among that boisterous crowd. But because I helped him that day, we spend time at the breaks during the Ride together and got to know each other better. He lived quite close to my In-Laws, so we saw each other every few weeks or so.\nA wasteland near his home provided a good practicing ground riding off-road with Super G (which was a stripped GS to make it as light as possible), but R didn’t want to ride alone, so I’d go over to his house and we’d take turns on Super G, so there’d always be someone nearby if something went wrong riding trial on a 200kg machine…\nAbout ten years before I met him, R had been training to join the Dutch Marine Corps when he got into a car accident that damaged his back, so he had to drop out of the training. Already prone to depression, R became increasingly depressed, although I didn’t notice that when I first met him.\nSince I’m not judgmental, R confided in me about his depression and his increasing desire to commit suicide. After another attempt to take his own life, he was in-and-out of clinics where they tried several therapies to help him, but all to no avail. As a matter of course, I visited him in the clinics, where I was allowed to take him off the grounds to cafés and restaurants where we could play darts and talk. I found out later that — apart from his girlfriend — I was the only person who did this for him.\nThe last two years R had been contact with a psychiatrist for euthanasia evaluation on grounds of severe psychological/mental suffering. May 19th we had dinner together — R and his girlfriend, me and my wife - where he announced that a date had been set.\nMay 30th.\nI was glad for him and I didn’t feel sad. It was weird, knowing he’d be gone in ten days. I made him promise to meet with me one last time on Wednesday May 25th, where we had a leisurely lunch and where he talked me through the arrangements he’d made — visiting the funeral parlour, how the euthanasia would be performed, how he hoped that the nurse who would fix his IV wouldn’t come by too early, because he wanted to sleep in on his last day… I even joked that he should pay attention when they put in the IV needle, because they would probably dab some sterilisation fluid before they punctured the skin…\nAfter the lunch R gave me a new bottle of his favourite Eau de Toilette, because he didn’t need it anymore. We hugged and I told him I would miss him. He told me he’d miss me too.\nAnd I went home. No tears, just numb.\nWe had chat contact later that evening because he wanted to use one of the photos of us together during the funeral service. He also asked if I wanted to say something during the funeral service. I thought about it, though about telling what I’m writing here, about the chance meeting that lead to this fast friendship. But in the end I declined — I didn’t feel like boring people at a funeral with such a personal story.\nThen Monday came and I was at school supervising children during lunch break at the moment R was euthanised. The children distracted me, but I did feel the same numbness I felt after my goodbyes on Wednesday. It still felt unreal.\nThen, Friday, June 3rd, at the funeral service, one of his friends, suffering from the same debilitating depressions, came up to me. She had never met me, just heard stories from R how important I had been to him.\nI could feel the lump in my throat, so I just hugged her and told her that she could always call me if she felt overwhelmed and needed someone to talk to. We filed into the hall and I was directed to the front, to sit right behind the family. While watching the casket and hearing the eulogies, the grief suddenly overwhelmed me and I could finally cry for him. And for myself, losing my friend. I’m not overtly emotional, but now my face was wet with tears and I felt this enormous weight pressing on my chest that made me gasp for breath.\nAs I’m crying now.\nI’m not a believer, but I sincerely hope that R has gone to a better place, where he’s free of the black hole that followed him these last decades.\nRest in Peace, my friend. You helped make me a better person, just for knowing your goodness. Farewell.\nEDITED TO ADD:\nPeople ask me about the euthanasia, so I posted answers in the comments, but I think it’s better to post them here:\nEuthanasia is not easily granted - R was insistent in his desire to depart, and his psychiatrists knew that if they refused him the clean and honorable way to depart, he’d commit suicide. He’d tried before, only to be resusitated against his will.\nI lost three friends through suicide and I know that people who are sincere about their desire to depart from this life cannot be stopped, but they can be helped to do it as painlessly and comfortable as possible, without any chances of being resuscitated and having to life on with (permanent) injuries sustained in the suicide attempt.\nPlease understand that euthanasia is not available to just anyone who wishes to depart this life — the euthanasia must be on medical grounds. R had been in therapy for over two decades, but therapy is exhausting and, for R, didn’t improve his life. He had to convince two separate psychiatrists to be granted the opportunity of euthanasia.\nIn the Netherlands there has been the choice for euthanasia for unbearable physical suffering without chances of improvement, but I didn’t know about euthanasia for unbearable psychological suffering until R told me about it.\nHaving lost friends through suicide, I was glad for R that he would be assisted in his departure, so that he didn’t need to suffer through the fear, pain, and anxiety of having to commit suicide.\nEuthanasia didn’t just give him the opportunity to depart cleanly and without the averse consequences of suicide, but they also helped with preparing for his departure — because he was about to be euthanaised, he was granted the same opportunity as terminally ill patients to make his own funeral arrangements. So he could ask his favourite singer if he could use her music at the service, he could take say farewell to his loved ones, and share his last moments with his love, who could hold his hand while he departed.\nAnd for that, I’m truly grateful.\nThat said, while I’m grateful for the comments that support me in my bereavement, I don’t want the comment section of this answer to become a discussion on euthanasia. With respect to R’s decision and in his memory, I would encourage people who want to give their opinions on euthanasia to take their notions elsewhere.",
      "5": "I cried a couple of weeks back when one of my best friends got married. Watching her transform from a girl to a woman just overwhelmed me.\nI was a non-believer of marriages before this. ...",
      "6": "Thursday, November 30th.\nTwo days ago.\nMy mother and I had argued, again. During which, she said the two things that broke me:\nI don’t care anymore, I’m done with you.\nThen she left the room.\nI sat in the closet and cried. Not just because of what she said, but because I had hurt her to that point. I felt like a worthless piece of shit. So, I did what I always do when I’m upset. I called my best friend, and talked to her about it.\nIn the breaks between my sobs(I was seriously hyperventilating, so embarrassing), I said what I was thinking. I can’t do anything right, I’m selfish, and all I care about is my self. This, is what my mother has said to me. Multiple times. Now, I’m not saying what she said was unwarranted, because it wasn’t.\nI had accidentally broke one of her most precious heirlooms during an argument two days beforehand.\nI had slammed the door, causing the dresser adjacent to it to shake, therefore, the item fell.\nWe argued everyday from when I was nine, till I was seventeen.\nI recovered from depression in January of this year. I’ll be eighteen in eight days. Because of me, she became the emotionless person she is…it’s my fault.\nWe made each other miserable.\nPlease…try to have a good relationship with your parents. I wish I could.",
      "7": "On November 1, 2012 my mother burst an aortic aneurysm after a Halloween Party. My brother rushed her to the hospital. She was wheeled in with a smile on her face. She waved to my brother and said, \"Bye, Jim! I love you!\" and then went \"Wheeeee!\" because she was having a ride on a gurney and it was an exciting adventure for her. The doors on the OR closed and that was it for her. The insults to her body were grave and her brain died. There was a room full of machines keeping her body alive but it was useless. She filled with fluid and looked like a fat circus clown. Her fingers and toes turned completely black. The doctors stuck pins directly into her eyeballs to test for any brain activity via pain. There was none.\nThe machines beeped and ticked while the family gathered from the four corners of the US. On the third day we gathered by her bed with the nurses and doctors of Brighams and Women's Hospital in Boston, the best hospital in the world. They waited respectfully while we said goodbye to my mother, told her we loved her, held hands and said a prayer. Then we nodded and the doctors and nurses started turning off the switches of the many machines keeping her body alive. There were beeping alarms, which they silenced. Softly, the doctor pronounced her dead at 11:13AM. We hugged each other. The nurses were crying with us. The doctor offered us his heartfelt condolences and left. We stayed for awhile. No one rushed us.\nWe finally shuffled out. My mother was cremated and we dumped her ashes in the places she loved. At the Service I held it together barely, long enough to get through her favorite Gospel reading, John 14: \"In my Father's house there are many rooms. I go there now to prepare one for you.\" But later in my car, alone, I broke down and cried. I suppose it doesn't matter if you are 50-something. When your mom dies, you cry -- a lot. My mother was blessed by God who gave her a great life and a painless death, surrounded by people who loved her. I doubt he will be as merciful to me, a selfish man and frequent sinner. But I can be grateful that he took her gently, painlessly and while she still held the power of her mind and body. There are many, many worse ways to die.",
      "8": "A couple months ago I was sexually assaulted. In a public bus. Again.[1]\nI was going to work, and this guy on his 30s sat down next to me on the bus. I had previously been sexually assaulted in a public bus, and it took me so long to sit down next to a random person again. It took me months of therapy and medication for my anxiety attacks. I had depression. My best friend had passed away less than a year before. I had suicidal thoughts, even.\nAt first, he was just taking his jacket off. But then, when his hand was touching my hip, he stopped.\nAnd that’s when I felt his fingers stretching to touch it.\nI looked at him sternly and said, “Stop.”\nHe looked away and I ignored it.\nIt could have been accidental, I thought.\nBut then, he started lifting my jersey, caressing my skin.\nI pushed him away and left my seat. I got up and screamed at him, “Only because I am a woman, it doesn’t give you the right to touch me. Only because I am just wearing a jersey, you have no right of touching me. You don’t have the right of touching any woman, man or child without his or her consent, you understand me?!”\nI was just so angry, and screamed my lungs out at him. The bus was packed.\nNo one said a thing.\nA woman saw him touching me.\nShe said nothing.\nI was only halfway on my way to my job, so I just walked over to the back of the bus.\nThere was a man on his 60s laughing, looking at me.\nIt was humiliating.\nThe fact that people had seen it and done nothing.\nThe fact that the first thing I saw was that man laughing at me.\nI cried the hardest I had in years as I got off the bus.\nDo something if you see an act of sexual assault in public, for the love of God.\nI had never felt that humiliated and lonely.\nAnd no one bothered to help me.\nI honestly feel like crying my eyes out again as I type this. I was just so, so disappointed with people that day.\nPS: I went to the Mossos d’Esquadra, but they only could try to identify him. They couldn’t do much, unfortunately.\nEDIT: I have disabled comments because I’m not willing to receive any further bullshit like this. If you’d like to comment on this, please send me a private message. If you’re going to say something dumb, refrain yourself from doing so or I’ll block you. Thank you.\nFootnotes\n[1] Mariana Ferreira Albuquerque's answer to When did you realize that you had grown up?",
      "9": "When was the last time you cried and why?",
      "10": "When was the last time you cried and why?",
      "11": "When was the last time you cried your heart out?",
      "12": "When was the last time you cried and why?",
      "13": "When was the last time you cried and why?",
      "14": "When was the last time you cried and why?",
      "15": "When was the last time you cried and why?",
      "16": "When was the last time you cried and why?",
      "17": "When was the last time you cried and why?",
      "18": "When was the last time you cried and why?",
      "19": "When was the last time you cried and why?",
      "20": "When was the last time you cried your heart out?",
      "21": "When was the last time you cried and why?",
      "22": "When was the last time you cried and why?",
      "23": "When was the last time you cried and why?",
      "24": "When was the last time you cried your heart out?",
      "25": "When was the last time you cried and why?",
      "26": "When was the last time you cried and why?",
      "27": "When was the last time you cried and why?",
      "28": "When was the last time you cried and why?",
      "29": "When was the last time you cried and why?",
      "30": "When was the last time you cried and why?",
      "31": "When was the last time you cried and why?",
      "32": "When was the last time you cried and why?",
      "33": "When was the last time you cried and why?",
      "34": "When was the last time you cried and why?",
      "35": "When was the last time you cried and why?",
      "36": "When was the last time you cried and why?",
      "37": "When was the last time you cried and why?",
      "38": "When was the last time you cried and why?",
      "39": "When was the last time you cried and why?",
      "40": "When was the last time you cried and why?",
      "41": "When was the last time you cried and why?",
      "42": "When was the last time you cried and why?",
      "43": "When was the last time you cried and why?",
      "44": "When was the last time you cried and why?",
      "45": "When was the last time you cried and why?",
      "46": "When was the last time you cried and why?",
      "47": "When was the last time you cried and why?",
      "48": "When was the last time you cried your heart out?",
      "49": "When was the last time you cried and why?",
      "50": "When was the last time you cried and why?"
    }
  },
  {
    "question_id": "https://truthaboutrussia.quora.com/Why-do-Russians-call-Ukrainians-Nazis",
    "title": "Why do Russians call Ukrainians Nazis",
    "answers": {
      "1": "I couldn’t think of any good reason from memory at the time. One possible reason became apparent to me last year when I closely reviewed the map of (IIRC) Treblinka concentration camp in the second world war.\nI was slightly surprised to see sections of the camp denoted as “Ukrainian Guards” quarters. I haven’t bothered to look any further because the answer isn’t a big one for me. I would like to understand because I couldn’t find any connection other than this, and a short article wrt Banderites which I will also follow up on.\nSorry I don’t mean to ostracize Ukraine, I fully support their stance to the orcs. I just really want to understand how their Russian public could believe this idea in any way, shape or form.",
      "2": "Part of the reason is to attempt to dehumanize their enemy. Russians and Ukrainians are closely related in several ways, and name-calling was thought a necessary step to lessen the hesitancy of cousins to kill each other.",
      "3": "To justify the war. The Soviet Union suffered 27 million dead in the “Great Patriotic War” at the hands of the Nazis."
    }
  },
  {
    "question_id": "https://www.quora.com/What-are-some-pictures-which-deserve-at-least-91k-upvotes",
    "title": "What are some pictures which deserve at least 91k upvotes",
    "answers": {
      "1": "Hi"
    }
  },
  {
    "question_id": "https://www.quora.com/How-does-one-explain-evolution-using-only-facts-and-science",
    "title": "How does one explain evolution using only facts and science",
    "answers": {
      "1": "The word “evolution” is shorthand for a series of explanations for how species’ individuals change from generation to generation. The main concept is that traits are inherited via DNA, a set of instructions that can change due to random mutations in the copying process or from exposure to chemicals or radiation. Every human, e.g., has some mutations different from their parents’ DNA; some mutations are irrelevant to survival, some aid survival, and some hurt it. Creatures that survive last longer so are more likely to have offspring, and thus pass on DNA changes. DNA can tell your body how to fight an infection, or how to form body parts, or just your appearance; some changes might be viewed as attractive by a mate, or give you a longer life. Some might be irrelevant to you but in later generations might save lives when a new type of infection appears, and then it might become a common trait since such survival will allow that change to proliferate.",
      "2": "How does one explain evolution using only facts and science?",
      "3": "How does one explain evolution using only facts and science?"
    }
  },
  {
    "question_id": "https://www.quora.com/Does-any-scientist-who-believes-in-science-have-a-scientific-argument-or-evidence-for-the-existence-of-God-or-creator",
    "title": "Does any scientist who believes in science have a scientific argument or evidence for the existence of God or creator",
    "answers": {
      "1": "In order for an hypothesis to be interogated via the scientific method we must have evidence to test. Evidence that is observable or measurable, testable, potentially falsifiable and reproducible. A confirmed hypothesis will produce actionable, predictable results. God(s) supposedly live, “outside of time and space and are composed of pure spirit.” As such, if a God or gods do exist they are undetectable by any means known to man. This makes gods an unfalsifiable assertion which falls outside of the realm of scientific investigation. There is no valid, testable evidence for any god.",
      "2": "I think you’ll find that ALL Scientists believe in Science. It sort of goes with the job.",
      "3": "People confuse belief with understanding. Scientists understand and apply scientific methods to understand what is going on in the world. This involves evidence and theories to explain evidence. Belief in gods existence is not based on evidence. Most concepts of gods involve the supernatural which means there is no evidence. Thus science is not applicable.",
      "4": "No. 7% of scientists claim to believe in god. But what they state in science journals like the age of the universe is 13.6 billion years, on Sunday they go to Church and say god created the universe 6000 years ago in six days. They cannot answer even simple questions like when the earth and Sun did not exist or how god counted six days. 93% of scientists say they are atheists and god is a stupid idea. (as per the PEW survey).",
      "5": "No.\nWhether you believe in science, god, or anything else, there is no evidence for a god or a creator.\nGive up, already.",
      "6": "This guy has degree in Applied Science (Biology)\nand his research has resulted in the astonishing finding that this velociraptor co-existed with man about 6000 years ago, not long after the entire universe was formed. He also built an enormous ark and tried to sue his insurance company after they refused to pay for water damage that resulted from a rainstorm.\nHe is now Pinhead in Chief at Answers in Genesis where he employs his labcoated flying monkeys to produce work based on the following methodologies: “We could simply tell you there are two main types of scientific research—operational and historical—but we’d rather show you… our assumptions could be accurate, it’s always better to start with an eyewitness account… otherwise, our assumptions could lead us in the wrong direction…and to do that, we want you to take part in a short experiment… for example, some geologists take present-day rates of radiometric decay and rock formation and imagine that the rates have always been the same. But that’s not the case… In fact, using the Bible as a framework allows us to understand why science is even possible and to make sense of the past from a solid foundation.That’s why they think the earth is so old (it’s not). But we can’t zip back in time to test this for accuracy.”\nSo friends, is there a Bible sized hole in your secular education? Don’t worry, the “scientists” at Answers in Genesis can help correct your misapprehensions for a paltry $12.99; no more boring lectures, no more labs, no more pesky tests:\nSo if it isn’t already obvious querent, the answer is NO!",
      "7": "Yes there is a scientific argument about God’s existence. The fine-tuning of our universe, our solar system, and our planet that leads to you and me is unbeatable. Why? Because statistically is practically impossible to have all constants and variables randomly take the correct values required to produce intelligent life. The other possible alternatives would be to prove that there are trillions and trillions of universes out there and that we are the lucky ones to live in one that’s friendly to life. This is the only reason this matter is still open to debate. Let’s remember this, TOO MANY COINCIDENCES IS NO COINCIDENCE",
      "8": "No.\nScience deals with the physical universe.\nGods are magic. Scientists don’t do magic.",
      "9": "To ignore the fact that there is design and complexity in every aspect of creation requires a religion in itself in evolution. Faith in God is based on evidence. To think that the beauty and variety on and in this earth came about by chance is an unbelievable stretch of imagination. I remember as a kid looking at the table of elements with all the blank spaces. There not blank anymore. The addition of a microscopic particle changes the element. Surely a designer was involved. The complexity of the human eye, the human brain, DNA, the ability to speak and reason points to a design with purpose. To give credit to Mother Nature and chance and deny the existence of a loving God is pure arrogance. To listen to some of the arguments scientists postulate borders on the absurd. Life now is considered to have come to earth from space or from aliens. Another example is the thought that a butterfly decides to change its color or a moth decides to change from black to white. Sounds like worshiping the creation rather than the creator. Try reading Romans Chapter 1 beginning in verse 20 written almost 2,000 years ago.",
      "10": "Scientists don't “believe\". They know, or work to know. They don't concern themselves with imaginary characters, since there is no credible evidence of any kind, for deities, or supernatural things existing.",
      "11": "No. The reason for that is the fact that there is no evidence for the existence of any gods. And for the millionth time, scientific findings don't need arguments, because they are based on observable data.",
      "12": "‘Do’ any scientists… not ‘Does’ any scientists…\nScience isn’t a ‘belief’, in the same way maths isn’t a ‘belief’.\nBut no, there is no evidence of any god or ‘creator’, they are just myths.",
      "13": "The fundamental principle of physics known as conservation of energy informs us that energy cannot be created (nor destroyed), and as everything in the universe consists only of energy in various forms, the universe cannot be a creation. According to physics, there can be no legitimate role for a creator deity in this universe.\nNo scientist “believes” in science; there is no such thing as belief in science. There is only knowledge. Either we know or we don’t know; belief has no role in science, which tests all ideas."
    }
  },
  {
    "question_id": "https://worldsknowledge.quora.com/Which-post-worth-more-than-4588812K-upvotes-and-Views-479",
    "title": "Which post worth more than 4588812K upvotes and Views 479",
    "answers": {}
  },
  {
    "question_id": "https://www.quora.com/Do-you-think-the-latest-stinger-MANPADS-being-delivered-to-Ukraine-will-be-able-to-take-down-the-Russian-Airforce-including-the-SU-34",
    "title": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU 34",
    "answers": {
      "1": "If they come into range, absolutely.\nJust knowing the Stingers are there will make Russian pilots more cautious and influence them to stay up high, above 12,000 feet and and about 4 miles away, where they must use expensive standoff weapons instead of cheap guns, rockets, and bombs.\nStingers are deadly to helicopters and drones and have forced Russia not to use them on the front lines where they really need them.",
      "2": "Well, a MANPAD is able to take down an Su-34 in correct conditions.\nSu-34\nHowever those conditions are it flies low and slow, close to the MANPAD position. While not impossible outright, this isn’t the correct use of an Su-34, which is a supersonic strike aircraft - akin in primary purpose to F-35 or Panavia Tornado. The proper use of a Su-34 is not to strafe enemy units from a low altitude, it is to bomb them from high altitude, preferably with precision weapons. MANPADs aren’t able to engage above 3800 meters and for a fast plane like the Su-34, you should divide that by, ugh, three at least, if you want to do more than force it into evasive maneuvers.\nHowever the Su-34 aren’t the main concern of Ukrainians. While these are dangerous birds and probably one of the worse things to meet on the battlefield, there are also few of them, Russia has fewer than 150 of them and not all are deployed to Ukraine. Instead the main threat and the main target for MANPADs are attack helicopters and attack aircraft like Su-24, who do fly low and slow and engage with cannons as a main weapon\nThe primary target may not even be combat planes, but transport helicopters and transport planes. The presence of Stinger missiles alone forces Russian forces to create a defensive perimeter of 5–10 km around any airfield they intend to use for resupply. Any smaller and partisan units with Stingers can creep in and shoot down incoming aircraft, with devastating consequences. Russians know that from Afghanistan and it’s not pretty.\nSo yes, MANPADs are incredibly effective against Russian forces. If they simply force Russians to use the guided weapons they lack overall and prevent them from using the simple cannons they have aplenty they already achieved loads for Ukraine, without even shooting any planes down.",
      "3": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "4": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "5": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "6": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "7": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "8": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "9": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "10": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "11": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "12": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "13": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "14": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "15": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "16": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "17": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?",
      "18": "Do you think the latest stinger MANPADS being delivered to Ukraine will be able to take down the Russian Airforce including the SU-34?"
    }
  },
  {
    "question_id": "https://healthdailyadvice.quora.com/In-military-history-has-a-nation-ever-won-a-battle-by-bluffing",
    "title": "In military history has a nation ever won a battle by bluffing",
    "answers": {
      "1": "During World War 2, the Canadian soldier Leo Major, liberated the Dutch city of Zwolle all on his own, defeating a German regimen composed of over a hundred men. Leo Major talked to the German commanding officer and convinced the officer that his unit was surrounded by artillery and would be blown up the next day.\nLeo Major also went around the town firing his gun and throwing explosives making the Germans believe that th..."
    }
  },
  {
    "question_id": "https://www.quora.com/What-are-some-deep-meaning-photos-that-deserve-1k-views",
    "title": "What are some deep meaning photos that deserve 1k views",
    "answers": {
      "1": "big brain meme."
    }
  },
  {
    "question_id": "https://memesbylogkyakhayenge.quora.com/Which-screenshot-deserve-72k-upvotes-and-views-6",
    "title": "Which screenshot deserve 72k upvotes and views 6",
    "answers": {}
  },
  {
    "question_id": "https://www.quora.com/Which-book-should-an-atheist-read-first-The-Bible-or-The-Quran",
    "title": "Which book should an atheist read first The Bible or The Quran",
    "answers": {
      "1": "Which book should an atheist read first: The Bible or The Quran?",
      "2": "Which book should an atheist read first: The Bible or The Quran?",
      "3": "Which book should an atheist read first: The Bible or The Quran?"
    }
  }
]